_ᕶᖃᕹᖈ = _ᖄᖄᖘᕴ(_ᖙᖆᕺᕵ(31))
function i(_ᖙᖆᕺᕵ) {
                var _ᖚᖃᕶᖆ = _ᕹᕴᕸᕶ.$_DP()[8][22];
                for (; _ᖚᖃᕶᖆ !== _ᕹᕴᕸᕶ.$_DP()[16][19]; ) {
                    switch (_ᖚᖃᕶᖆ) {
                    case _ᕹᕴᕸᕶ.$_DP()[4][22]:
                        if (_ᕺᕿᖉᖀ[_ᖙᖆᕺᕵ])
                            return _ᕺᕿᖉᖀ[_ᖙᖆᕺᕵ][_ᕴᖉᕸᖚ(42)];
                        _ᖚᖃᕶᖆ = _ᕹᕴᕸᕶ.$_DP()[0][21];
                        break;
                    case _ᕹᕴᕸᕶ.$_DP()[8][21]:
                        var t = _ᕺᕿᖉᖀ[_ᖙᖆᕺᕵ] = {
                            i: _ᖙᖆᕺᕵ,
                            l: !1,
                            exports: {}
                        };
                        _ᖚᖃᕶᖆ = _ᕹᕴᕸᕶ.$_DP()[0][20];
                        break;
                    case _ᕹᕴᕸᕶ.$_DP()[4][20]:
                        return _ᕿᕸᖉᖈ[_ᖙᖆᕺᕵ][_ᕷᕹᖀᖈ(98)](t[_ᕷᕹᖀᖈ(42)], t, t[_ᕴᖉᕸᖚ(42)], i),
                        t[_ᕴᖉᕸᖚ(28)] = !0,
                        t[_ᕴᖉᕸᖚ(42)];
                        break
                    }
                }
            }
function _ᖄᖄᖘᕴ(_ᕿᕸᖉᖈ) {
                var _ᕷᕹᖀᖈ = _ᕹᕴᕸᕶ.$_DP()[0][22];
                for (; _ᕷᕹᖀᖈ !== _ᕹᕴᕸᕶ.$_DP()[8][21]; ) {
                    switch (_ᕷᕹᖀᖈ) {
                    case _ᕹᕴᕸᕶ.$_DP()[12][22]:
                        return _ᕿᕸᖉᖈ && _ᕿᕸᖉᖈ[_ᕺᕿᖉᖀ(48)] ? _ᕿᕸᖉᖈ : {
                            default: _ᕿᕸᖉᖈ
                        };
                        break
                    }
                }
            }
var _ᕿᕸᖉᖈ = (0,_ᕶᖃᕹᖈ[_ᕺᕿᖉᖀ(46)])(_ᖘᕸᖃᕶ[_ᕺᕿᖉᖀ(46)][_ᕺᕿᖉᖀ(534)](_ᕷᕹᖀᖈ), _ᖄᖙᖀᕷ)
u = {
    // callback: _ᕴᖉᕸᖚ(22),
    // captcha_id: _ᖚᖃᕶᖆ[_ᕺᕿᖉᖀ(550)],
    // challenge: _ᖚᖃᕶᖆ[_ᕴᖉᕸᖚ(629)],
    // client_type: _ᖚᖃᕶᖆ[_ᕺᕿᖉᖀ(669)],
    // lot_number: _ᖚᖃᕶᖆ[_ᕴᖉᕸᖚ(400)],
    // risk_type: _ᖚᖃᕶᖆ[_ᕺᕿᖉᖀ(684)],
    // payload: _ᖚᖃᕶᖆ[_ᕺᕿᖉᖀ(627)],
    // process_token: _ᖚᖃᕶᖆ[_ᕴᖉᕸᖚ(619)],
    // payload_protocol: _ᖚᖃᕶᖆ[_ᕺᕿᖉᖀ(664)],
    // pt: _ᖚᖃᕶᖆ[_ᕺᕿᖉᖀ(656)],
    w: _ᕿᕸᖉᖈ
}
console.log(u)