[
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "GOOGL",
        "title": "Alphabet-Backed Isomorphic Labs Raises $600 Million for AI Drug Development",
        "date": "2025-03-31",
        "summary": "The subsidiary of Google parent Alphabet plans to use its first round of external funding to boost its artificial-intelligence drug design pipeline across multiple therapeutic areas."
    },
    {
        "company": "GOOGL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Read about AJ Bell, Worldline and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "GOOGL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about airline credit cards, BNP Paribas, Oversea-Chinese Banking Corp. and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "GOOGL",
        "title": "Google Says End of U.S. Trade Loophole to Pose Headwind",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "GOOGL",
        "title": "Private Equity Sets Up Shop on Madison Avenue",
        "date": "2025-04-24",
        "summary": "Once put off by ad agencies’ fickle cash flows, private investment firms now see an opportunity to capitalize on the sector’s accelerating shift toward automation."
    },
    {
        "company": "GOOGL",
        "title": "Corrections & Amplifications",
        "date": "2025-04-18",
        "summary": "Corrections & Amplifications for the edition of April 19, 2025."
    },
    {
        "company": "GOOGL",
        "title": "Trump Targets Democratic Fundraising",
        "date": "2025-04-25",
        "summary": "A.M. Edition for April 25. President Trump directs the Justice Department to "
    },
    {
        "company": "GOOGL",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "GOOGL",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Judge Rules Google Operates Illegal Ad Monopoly",
        "date": "2025-04-18",
        "summary": "The tech giant faces multiple legal threats related to how it wields market power."
    },
    {
        "company": "GOOGL",
        "title": "The Journal Acrostic (Saturday Variety Puzzle, April 19)",
        "date": "2025-04-18",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "date": "2025-04-25",
        "summary": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback."
    },
    {
        "company": "GOOGL",
        "title": "7-Eleven Owner Flags Tariff Challenges, Says Couche-Tard Talks Continue",
        "date": "2025-04-25",
        "summary": "The Japanese operator of 7-Eleven convenience stores says it will continue efforts to revamp its business, and warned that retail conditions in the U.S. will get tougher due to tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tesla, Boeing and Alphabet Earnings: What to Watch for This Week",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "GOOGL",
        "title": "From Fake Eyelashes to Care Bears, U.S.-Bound Goods Are Stuck in Tariff Limbo",
        "date": "2025-04-22",
        "summary": "Some companies are torn: Do they revamp supply chains or wait for the trade war to ebb?"
    },
    {
        "company": "GOOGL",
        "title": "Anthropic Scores Win in AI Copyright Dispute With Record Labels",
        "date": "2025-03-26",
        "summary": "Anthropic scored a win this week after a U.S. court denied an injunction that Universal Music Group and other record labels had sought to prevent the artificial-intelligence company from using copyrighted lyrics to train its AI models."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Crypto Knocks on the Door of a Banking World That Shut It Out",
        "date": "2025-04-21",
        "summary": "President Trump’s pledge to make America a “bitcoin superpower” has set the stage for crypto to become more intertwined with the banking system."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Find insights into  bank earnings,  CIMB Group and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "GOOGL",
        "title": "Key Changes (Monday Crossword, April 21)",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Monday: Hertz, MicroStrategy, Capital One, Comerica",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "The $40 Billion Startup Mystery Shaking Up Silicon Valley",
        "date": "2025-04-09",
        "summary": "The founder says Figure AI has created autonomous robots, setting off an investor frenzy in private markets."
    },
    {
        "company": "GOOGL",
        "title": "‘Enough Is Enuf’: A Dream of Simpler Spelling",
        "date": "2025-04-13",
        "summary": "George Bernard Shaw, Theodore Roosevelt, Andrew Carnegie and others have lobbied to reform English spelling. The language has been resistant."
    },
    {
        "company": "GOOGL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "GOOGL",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "GOOGL",
        "title": "Anthropic, Databricks Team Up in Scramble for AI Revenue",
        "date": "2025-03-26",
        "summary": "Anthropic and Databricks struck a five year, $100 million pact to sell artificial intelligence tools to businesses, targeting those seeking to build their own AI agents."
    },
    {
        "company": "GOOGL",
        "title": "The Drone-Delivery Service Beating Amazon to Your Front Door",
        "date": "2025-03-29",
        "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "GOOGL",
        "title": "He Comes From Music Royalty. Can He Save Atlantic Records?",
        "date": "2025-04-09",
        "summary": "The 31-year-old music scion Elliot Grainge has been tasked with shepherding a 77-year-old music label into the modern era."
    },
    {
        "company": "GOOGL",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "7-Eleven Owner Plans Board Refresh ",
        "date": "2025-04-17",
        "summary": "Seven & i Holdings has proposed a slate of new directors, including a former senior government official, in its latest effort to strengthen operations in the face of a takeover attempt by the Canadian owner of Circle K."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Trump Adds Tougher Limits on China’s Access to U.S. Technology",
        "date": "2025-03-26",
        "summary": "Plus, AI startup Anthropic wins in court over copyrighted music. And, Gamestop’s play in bitcoin boosts its stock. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "U.S. House Committee Urges Two U.S. Banks to Withdraw From CATL’s Listing",
        "date": "2025-04-18",
        "summary": "A U.S. congressional committee has urged two U.S. banks to pull out of working on Chinese battery giant Contemporary Amperex Technology’s planned listing in Hong Kong, expressing “significant concerns” over their involvement in the process."
    },
    {
        "company": "GOOGL",
        "title": "Abbott Labs Bracing for Tariffs as Profits Rise",
        "date": "2025-04-16",
        "summary": "Abbott Labs boosted its earnings in the first quarter and hinted that its full-year guidance might have gotten a lift were it not for looming cost hikes from the recent tariff war."
    },
    {
        "company": "GOOGL",
        "title": "Google Offers to Tweak Automotive Services, Maps Contracts to Appease German Regulator",
        "date": "2025-04-09",
        "summary": "The company said it would license the services contained in its Google Automotive Services business as separate stand-alone versions."
    },
    {
        "company": "GOOGL",
        "title": "Sweepstakes Company Publishers Clearing House Files for Bankruptcy  ",
        "date": "2025-04-10",
        "summary": "The direct-mail company’s Prize Patrol gained fame delivering oversize checks with TV cameras running."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Abbott Labs Forecasts Tariff Impact of a ‘Few Hundred Million Dollars’",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Albertsons Sales Grow on Boost From Pharmacy Business",
        "date": "2025-04-15",
        "summary": "Albertsons  saw its top-line figure increase in the latest quarter as its pharmacy business powered identical sales growth."
    },
    {
        "company": "GOOGL",
        "title": "AMD Closes $4.9 Billion ZT Systems Deal, Targeting Its Piece of the ‘AI Factory’",
        "date": "2025-03-31",
        "summary": "Chip giant CEO Lisa Su says AI is still in its “very early stage” as the company revs up competition with Nvidia."
    },
    {
        "company": "GOOGL",
        "title": "Value Retailers Have Been Waiting for the Higher-Income Consumer. They’ve Arrived. ",
        "date": "2025-04-18",
        "summary": "As financial stress mounts, chains like Dollar Tree and Academy that cater to the budget-conscious are seeing more of a new class of shoppers."
    },
    {
        "company": "GOOGL",
        "title": "Vol. 38, No. 3: Canada",
        "date": "2025-03-31",
        "summary": "In the latest WSJ stylebook bulletin, some reminders about how we handle Canadian datelines and related Great White North terms. Also: We spell April Fools’ Day with an apostrophe, no fooling…"
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "CEOs Break Silence on Trump Trade War",
        "date": "2025-04-08",
        "summary": "For weeks, business leaders have avoided voicing concerns about tariffs. Some executives are getting more vocal."
    },
    {
        "company": "GOOGL",
        "title": "Temasek-Backed Private-Equity Firm Raises Over $600 Mln in Latest Funding Round",
        "date": "2025-04-14",
        "summary": "Private-equity firm ABC Impact has raised over $600.0 million in its latest funding round, drawing interest from investors, including a multilateral development bank and a sovereign-wealth fund."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The Branding Guy Hired to Make Yahoo Cool Again",
        "date": "2025-04-05",
        "summary": "Josh Line is used to being behind the scenes. As Yahoo’s new chief marketing officer, he needs to bring the company back into the spotlight."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Uber, Hertz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "GOOGL",
        "title": "WPP Buys InfoSum in AI Push",
        "date": "2025-04-03",
        "summary": "The London-listed ad group said that InfoSum—which will join its media investment group GroupM—will help it create marketing solutions that are enhanced by AI."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "GOOGL",
        "title": "Why Costco Went All In on Kirkland — and How It Paid Off",
        "date": "2025-03-31",
        "summary": "Costco’s $86 billion Kirkland Signature brand went against industry standards when it was launched in 1995. WSJ breaks down why the private label is now the retail behemoth’s secret weapon.  "
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Japan Regulator Orders Google to Stop Anticompetitive Practices",
        "date": "2025-04-15",
        "summary": "Japan’s antitrust regulator instructed Alphabet’s Google to stop what it said are anticompetitive practices involving mobile search services, its first order against a U.S. technology giant."
    },
    {
        "company": "GOOGL",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Won’t Stop Companies Buying ASML’s Machines—Heard on the Street",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Out of the Tariff Turmoil, a Few Winners Emerge",
        "date": "2025-04-18",
        "summary": "Some small U.S. companies are seeing a boost in business from new trade barriers."
    },
    {
        "company": "GOOGL",
        "title": "This Financial Firm Can Give Investment Advice in Gen Z Slang, No Cap",
        "date": "2025-04-01",
        "summary": "Arta, a wealth-management startup, is using mobile apps and AI tools to reach young millionaires."
    },
    {
        "company": "GOOGL",
        "title": "7-Eleven Owner Targets Profit Growth Despite Tariff Uncertainty",
        "date": "2025-04-09",
        "summary": "Seven & i Holding projected a rise in annual profit despite the uncertainty caused by U.S. tariffs, continuing efforts to stave off a takeover attempt by the Canadian owner of Circle K"
    },
    {
        "company": "GOOGL",
        "title": "U.K. Banknote Printer De La Rue Accepts Takeover Bid by Atlas",
        "date": "2025-04-15",
        "summary": "The company agreed to a $347 million takeover by U.S. buyout firm Atlas Holdings, signaling the end of its nearly 80-year listing on the London Stock Exchange."
    },
    {
        "company": "GOOGL",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "GOOGL",
        "title": "Consulting Giants Offer Billions in Cuts to Federal Contracts. It Might Not Be Enough.",
        "date": "2025-04-02",
        "summary": "Accenture, Deloitte, IBM and other firms submitted proposed price concessions but are expected to be asked to dig deeper."
    },
    {
        "company": "GOOGL",
        "title": "Spirits, Swiss Watches, Sneakers: Global Stock-Market Winners and Losers from Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Small Sellers of Fireworks, Ski Apparel and Other Imports Can’t Escape Tariff War",
        "date": "2025-04-11",
        "summary": "Uncertainty about President Trump’s tariffs is leading many small businesses to interrupt or halt production because they can’t absorb price hikes and lack leverage to negotiate."
    },
    {
        "company": "GOOGL",
        "title": "When Is It Time to Sell a Stock? Try Following This Indicator",
        "date": "2025-04-03",
        "summary": "A sharp break below a stock’s 10-week moving average, in conjunction with high volume, often acts as a sell signal. Consider Amazon’s recent rise and fall."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Amazon CEO Says Generative AI Will Reinvent Every Customer Experience",
        "date": "2025-04-10",
        "summary": "Generative AI is going to reinvent virtually every customer experience and enable entirely new ones that have only been dreamed about, Amazon.com Chief Executive Andy Jassy said."
    },
    {
        "company": "GOOGL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "GOOGL",
        "title": "American Airlines to Provide Free Wi-Fi, Joining Race to Court Connected Travelers",
        "date": "2025-04-15",
        "summary": "The deal with AT&T will provide free in-flight internet to loyalty program members, beginning in January."
    },
    {
        "company": "GOOGL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Caterpillar, China’s new restrictions on rare-earths exports, copper prices and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "GOOGL",
        "title": "Section Eight (Saturday Variety Puzzle, April 12)",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: Lululemon, General Motors, Deutsche Bank",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Consumer Staples Gain on Rush to Safety After Tariffs Spark Market Rout",
        "date": "2025-04-03",
        "summary": "The sector’s exposure to the tariffs that are poised to hit a number of industries, from clothing and shoe makers, to toys and autoparts companies, is minimal."
    },
    {
        "company": "GOOGL",
        "title": "Inside Out (Thursday Crossword, April 17)",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "GOOGL",
        "title": "Where Do I Begin? (Thursday Crossword, April 10)",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Big Office Landlord Made $4 Million in Previously Undisclosed Payouts to Its CEO",
        "date": "2025-04-05",
        "summary": "Paramount Group recently revealed that it made payments to the chief executive’s jet company as well as for his personal accounting services."
    },
    {
        "company": "GOOGL",
        "title": "‘The Mesopotamian Riddle’: The Buried Voice of an Empire",
        "date": "2025-04-04",
        "summary": "The translation of ancient Assyrian writing into modern languages was a challenge that had long vexed historians. Three Victorian amateurs were determined to solve the puzzle."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "GOOGL",
        "title": "How RFK Jr. Is Reshaping the U.S. Health Agencies",
        "date": "2025-03-27",
        "summary": "P.M. Edition for Mar. 27. Health and Human Services Secretary Robert F. Kennedy Jr. announced "
    },
    {
        "company": "GOOGL",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "GOOGL",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    }
]