[
    {
        "company": "GOOGL",
        "title": "Google Faces Its Monopoly Reckoning",
        "date": "2025-04-20",
        "summary": "The Justice Department’s proposal that the company share data, shed its Chrome browser, and cease exclusionary contracts deserves broad support. "
    },
    {
        "company": "GOOGL",
        "title": "Justice Department Urges Tough Action to Break Google’s Search Dominance",
        "date": "2025-04-21",
        "summary": "The judge who found that the tech company maintained an illegal monopoly is asked to force it to sell its Chrome web browser."
    },
    {
        "company": "GOOGL",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "GOOGL",
        "title": "Google Says End of U.S. Trade Loophole to Pose Headwind",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "GOOGL",
        "title": "Could Google Be Forced to Break Up After District Judge’s Ruling?",
        "date": "2025-04-18",
        "summary": "A U.S. district judge ruled "
    },
    {
        "company": "GOOGL",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "GOOGL",
        "title": "Google Faces Potential $6.6 Billion U.K. Antitrust Lawsuit Over Search Advertising",
        "date": "2025-04-16",
        "summary": "The lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Japan Regulator Orders Google to Stop Anticompetitive Practices",
        "date": "2025-04-15",
        "summary": "Japan’s antitrust regulator instructed Alphabet’s Google to stop what it said are anticompetitive practices involving mobile search services, its first order against a U.S. technology giant."
    },
    {
        "company": "GOOGL",
        "title": "Google Says End of ‘De Minimis’ Exemption to Pose Headwind",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk Is Stepping Back From DOGE. Can He Really Stay Away?",
        "date": "2025-04-25",
        "summary": "Elon Musk says he’s going to spend less time in Washington and more time running Tesla. WSJ columnist and Musk-watcher Tim Higgins unpacks what that plan might look like in reality. Also, the WSJ’s Isabelle Bousquette takes us inside "
    },
    {
        "company": "GOOGL",
        "title": "AI Tools Help Alzheimer’s Researchers Dig Into Data",
        "date": "2025-03-27",
        "summary": "The Oxford Drug Discovery Institute uses artificial intelligence-powered databases "
    },
    {
        "company": "GOOGL",
        "title": "Go Delete Yourself From the Internet. Seriously, Here’s How.",
        "date": "2025-04-20",
        "summary": "Find your data, request removal…and repeat."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Japan Accuses Google of Being Anticompetitive",
        "date": "2025-04-15",
        "summary": "Plus: JPMorgan Chase, Bank of America and Bank of New York Mellon press pause on electronic communications with their regulator following an email hack. And Johnson & Johnson says tariffs will increase costs for its medical-technology products. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Japan Accuses Google of Being Anticompetitive",
        "date": "2025-04-15",
        "summary": "Plus: JPMorgan Chase, Bank of America and Bank of New York Mellon press pause on electronic communications with their regulator following an email hack. And Johnson & Johnson says tariffs will increase costs for its medical-technology products. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Google Offers to Tweak Automotive Services, Maps Contracts to Appease German Regulator",
        "date": "2025-04-09",
        "summary": "The company said it would license the services contained in its Google Automotive Services business as separate stand-alone versions."
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Uber Sued Over Cancellation Practices",
        "date": "2025-04-21",
        "summary": "Plus: The Justice Department asks a federal judge to force Google to sell its Chrome web browser. And crypto firms swoop in on the banking world with applications for charters. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Here’s How Big the AI Revolution Really Is, in Four Charts",
        "date": "2025-04-23",
        "summary": "It’s as transformative as the internet itself. Here are the key players in the generative-AI battle, and where they stand right now."
    },
    {
        "company": "GOOGL",
        "title": "Can Robots Make Sneakers? Just Ask Nike.",
        "date": "2025-04-22",
        "summary": "President Trump wants more products to be made in the U.S., pushing some companies toward robotics in a bid to avoid high labor costs. But WSJ reporter Jon Emont says "
    },
    {
        "company": "GOOGL",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "GOOGL",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "How Google Used AI to Re-Create ‘The Wizard of Oz’ for the Las Vegas Sphere",
        "date": "2025-04-09",
        "summary": "Google invented new techniques to enhance resolution and generated new character performances to bring the 1939 film to the giant screen."
    },
    {
        "company": "GOOGL",
        "title": " ‘Sell America’ Trade Picks Up After New Trump Threats on Fed",
        "date": "2025-04-21",
        "summary": "P.M. Edition for April 21. U.S. markets were on edge about President Trump's tariff war as well as his threats to fire Federal Reserve chief Jerome Powell. Stocks fell, the dollar hit fresh multiyear lows against major currencies, and yields on longer-term Treasurys rose. Plus, U.S. megabanks are built for business from all corners of the globe. Heard on the Street columnist "
    },
    {
        "company": "GOOGL",
        "title": "Consulting Firms Offer to Cut Up to $20 Billion From Federal Contracts",
        "date": "2025-04-22",
        "summary": "Booz Allen Hamilton, Guidehouse and others are negotiating with the General Services Administration as part of a broad review of government contractors."
    },
    {
        "company": "GOOGL",
        "title": "AI and Nuclear Power and ‘Wizard of Oz,’ Oh My!",
        "date": "2025-04-21",
        "summary": "Google used artificial intelligence to re-imagine “The Wizard of Oz” for an immersive experience at the Las Vegas Sphere, and WSJ CIO Journal reporter Isabelle Bousquette got "
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "GOOGL",
        "title": "How DOGE Plans to Plow Ahead Without Musk at the Helm",
        "date": "2025-04-24",
        "summary": "The Tesla CEO’s White House role is expected to diminish in the coming weeks."
    },
    {
        "company": "GOOGL",
        "title": "South Korean Firm Galaxy Corporation Targets $1 Billion Valuation in 2026 IPO",
        "date": "2025-04-21",
        "summary": "Galaxy Corporation, a South Korean entertainment-technology group representing K-pop star G-Dragon, plans to go public next year in a deal that could value it at around $1.0 billion."
    },
    {
        "company": "GOOGL",
        "title": "South Korean Firm Galaxy Corporation Targets $1 Billion Valuation in 2026 IPO",
        "date": "2025-04-21",
        "summary": "Galaxy Corporation, a South Korean entertainment-technology group representing K-pop star G-Dragon, plans to go public next year in a deal that could value it at around $1.0 billion."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "GOOGL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Our Capitulation Nation",
        "date": "2025-04-20",
        "summary": "Everybody’s folding, from Trump and Democrats to law firms and universities."
    },
    {
        "company": "GOOGL",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "GOOGL",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Alphabet-Backed Isomorphic Labs Raises $600 Million for AI Drug Development",
        "date": "2025-03-31",
        "summary": "The subsidiary of Google parent Alphabet plans to use its first round of external funding to boost its artificial-intelligence drug design pipeline across multiple therapeutic areas."
    },
    {
        "company": "GOOGL",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Fed Chair in the Hot Seat",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Ireland’s Privacy Watchdog Probes Musk’s Grok AI Model",
        "date": "2025-04-11",
        "summary": "Ireland’s data privacy watchdog said it is looking into whether Grok has been illegally trained on European user posts on Musk’s X social media platform."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "WPP Buys InfoSum in AI Push",
        "date": "2025-04-03",
        "summary": "The London-listed ad group said that InfoSum—which will join its media investment group GroupM—will help it create marketing solutions that are enhanced by AI."
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "GOOGL",
        "title": "Galaxy Digital Settles with NYAG for $200 Million Over Luna Ties",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "GOOGL",
        "title": "Marketers Are Putting More Content and Quality Control in the Hands of AI",
        "date": "2025-04-17",
        "summary": "The arrival of marketing campaigns generated entirely by artificial intelligence is inevitable, consultants say."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Former Intel CEO Pat Gelsinger Makes a Few More Long-Shot Bets  ",
        "date": "2025-03-26",
        "summary": "The semiconductor titan that failed to turn around Intel is refocusing his energy on other challenges, like quantum computing and taking churches to the cloud."
    },
    {
        "company": "GOOGL",
        "title": "Efforts to Weed Out Fake Users for Online Advertisers Fall Short",
        "date": "2025-03-28",
        "summary": "Brands spend billions on ads without knowing if they are being shown to humans. With fake users making up 40% of web traffic, bot-detection companies can’t keep up."
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "How the Company Making Nearly All Its Money From the Government Is Navigating Trump’s Cuts",
        "date": "2025-04-03",
        "summary": "Booz Allen’s CEO discusses the more than $1 billion in price concessions his firm has offered up and what its business will look like post-DOGE."
    },
    {
        "company": "GOOGL",
        "title": "Is Chinese AI All It’s Cracked Up to Be?",
        "date": "2025-04-16",
        "summary": "Beijing is pushing a tech challenge to the U.S., but Washington can counter it with smart policies."
    },
    {
        "company": "GOOGL",
        "title": "Chatbot Confidential: How to Protect Your Privacy When Using AI Chatbots",
        "date": "2025-04-13",
        "summary": "A podcast series that examines the risks that come with using generative AI-powered chatbots and how to keep your data safe."
    },
    {
        "company": "GOOGL",
        "title": "Rocket to Buy Mr. Cooper Group in $9.4 Billion Mortgage-Industry Deal",
        "date": "2025-03-31",
        "summary": "The Detroit-based company agreed to buy Mr. Cooper, one of the country’s largest mortgage firms, in a $9.4 billion all-stock deal."
    },
    {
        "company": "GOOGL",
        "title": "‘McAtlas’: McNuggets the World Over",
        "date": "2025-04-04",
        "summary": "Part of the global appeal of McDonald’s is its cultural flexibility. Meatless burgers are offered in India, while Czech diners can order a beer to go with a Big Mac."
    },
    {
        "company": "GOOGL",
        "title": "Don’t Be Fooled by a Copycat Hotel Website",
        "date": "2025-04-01",
        "summary": "Some hotel-booking websites "
    },
    {
        "company": "GOOGL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "GOOGL",
        "title": "Zuckerberg, on Witness Stand, Rebuffs Claims Meta Monopolizes Social-Media Market",
        "date": "2025-04-15",
        "summary": "The Meta Platforms CEO testified that his company had legitimate business reasons for acquiring Instagram more than a decade ago."
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "GOOGL",
        "title": "Johnson & Johnson Pivots Its AI Strategy ",
        "date": "2025-04-18",
        "summary": "The company is making a shift to focus on only the highest-value GenAI use cases and shut down pilots that were redundant or underdelivering."
    },
    {
        "company": "GOOGL",
        "title": "Yahoo Hires Marketing Chief to Bring Back Love for ‘One of the OGs of the Internet’  ",
        "date": "2025-03-31",
        "summary": "Yahoo hired a new chief marketing officer to revive a brand that has seen major ownership and leadership changes over the years. "
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk’s Mr. Fix-It Takes Center Stage During a Really Bad Week",
        "date": "2025-04-05",
        "summary": "Antonio Gracias made a rare public appearance alongside his friend as he helps with DOGE."
    },
    {
        "company": "GOOGL",
        "title": "Dow Drops More Than 500 Points",
        "date": "2025-04-17",
        "summary": "Trump renews attack on Federal Reserve Chair Jerome Powell. Plus, Netflix posts higher-than expected earnings. Eli Lilly stock surges after GLP-1 pill succeeds in a pivotal trial. Ariana Aspuru hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Consulting Giants Offer Billions in Cuts to Federal Contracts. It Might Not Be Enough.",
        "date": "2025-04-02",
        "summary": "Accenture, Deloitte, IBM and other firms submitted proposed price concessions but are expected to be asked to dig deeper."
    },
    {
        "company": "GOOGL",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Harvard’s $9 Billion Scramble to Avoid Becoming the Next Columbia",
        "date": "2025-04-02",
        "summary": "The Ivy League school’s president, Alan Garber, made a flurry of moves before Trump opened a federal funding review."
    },
    {
        "company": "GOOGL",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "GOOGL",
        "title": "U.S. Tries to Crush China’s AI Ambitions With Chips Crackdown ",
        "date": "2025-04-17",
        "summary": "New chip restrictions for Nvidia and AMD show the Trump administration’s determination to battle China on tech advances as well as trade."
    },
    {
        "company": "GOOGL",
        "title": "Musk Merges His AI Company With X, Claiming Combined Value of $113 Billion",
        "date": "2025-03-29",
        "summary": "Elon Musk’s artificial-intelligence startup xAI has acquired X, the social-media platform he also owns, in an all-stock deal that assigns the new enterprise a lofty valuation."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Anthropic Scores Win in AI Copyright Dispute With Record Labels",
        "date": "2025-03-26",
        "summary": "Anthropic scored a win this week after a U.S. court denied an injunction that Universal Music Group and other record labels had sought to prevent the artificial-intelligence company from using copyrighted lyrics to train its AI models."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Can Europe's Homegrown Satellite Company Compete with Elon Musk's Starlink?",
        "date": "2025-04-14",
        "summary": "Europe is looking at Eutelsat, a smaller rival to Starlink, to reduce its reliance on the U.S. company. Plus, how much personal information should you give an AI chatbot? WSJ personal tech columnist Nicole Nguyen dives into that in our special three-part series “"
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Trump Settles on Tariff Plan Ahead of ‘Liberation Day’ Deadline",
        "date": "2025-04-01",
        "summary": "Plus, Meta CEO Mark Zuckerberg is pressing U.S. trade officials to help fight an expected European Union ruling that could undermine its ad business. And Softbank agrees to lead $40 billion funding for OpenAI. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "EU Chief Warns Bloc Could Target Digital Services If Talks With U.S. Fail–Report",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "GOOGL",
        "title": "How I Realized AI Was Making Me Stupid—and What I Do Now",
        "date": "2025-04-03",
        "summary": "Backers of the new tech say it will free us to be creative, but studies show that avoiding mental effort can cause your brain to atrophy."
    },
    {
        "company": "GOOGL",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Thursday: General Motors, Jefferies, GameStop, Lululemon",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Trump Adds Tougher Limits on China’s Access to U.S. Technology",
        "date": "2025-03-26",
        "summary": "Plus, AI startup Anthropic wins in court over copyrighted music. And, Gamestop’s play in bitcoin boosts its stock. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Chatbot Confidential: When AI at Work Is Risky Business",
        "date": "2025-04-06",
        "summary": "Gen AI chatbots have changed how we work. Today, we bring you the second installment of Tech News Briefing’s special series “Chatbot Confidential,” where WSJ personal tech columnist Nicole Nguyen details best practices for using the chatbots while protecting your privacy. In this episode, we dive into an area where the temptation to tap generative AI tools is very strong: work! We’ll tell you about the risks your new helper brings and how not to give away company secrets while using them."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    }
]