[
    {
        "company": "GOOGL",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "GOOGL",
        "title": "Google Says End of U.S. Trade Loophole to Pose Headwind",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Google Says End of ‘De Minimis’ Exemption to Pose Headwind",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Google Faces Its Monopoly Reckoning",
        "date": "2025-04-20",
        "summary": "The Justice Department’s proposal that the company share data, shed its Chrome browser, and cease exclusionary contracts deserves broad support. "
    },
    {
        "company": "GOOGL",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Justice Department Urges Tough Action to Break Google’s Search Dominance",
        "date": "2025-04-21",
        "summary": "The judge who found that the tech company maintained an illegal monopoly is asked to force it to sell its Chrome web browser."
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "GOOGL",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Here’s How Big the AI Revolution Really Is, in Four Charts",
        "date": "2025-04-23",
        "summary": "It’s as transformative as the internet itself. Here are the key players in the generative-AI battle, and where they stand right now."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Uber Sued Over Cancellation Practices",
        "date": "2025-04-21",
        "summary": "Plus: The Justice Department asks a federal judge to force Google to sell its Chrome web browser. And crypto firms swoop in on the banking world with applications for charters. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk Is Stepping Back From DOGE. Can He Really Stay Away?",
        "date": "2025-04-25",
        "summary": "Elon Musk says he’s going to spend less time in Washington and more time running Tesla. WSJ columnist and Musk-watcher Tim Higgins unpacks what that plan might look like in reality. Also, the WSJ’s Isabelle Bousquette takes us inside "
    },
    {
        "company": "GOOGL",
        "title": "Could Google Be Forced to Break Up After District Judge’s Ruling?",
        "date": "2025-04-18",
        "summary": "A U.S. district judge ruled "
    },
    {
        "company": "GOOGL",
        "title": "ServiceNow Bumps Up Annual Guidance as Government Business Grows",
        "date": "2025-04-23",
        "summary": "Chief Executive Bill McDermott said the platform is operating in a best-case-scenario environment as companies look to optimize their supply chains amid recent tariff announcements and federal clients aim to boost efficiency amid government spending cuts."
    },
    {
        "company": "GOOGL",
        "title": "With Trump Tariffs, Even AI Could Get More Expensive",
        "date": "2025-04-04",
        "summary": "Higher prices may be in store for a range of materials used to build the data centers that will deliver AI."
    },
    {
        "company": "GOOGL",
        "title": "Google Offers to Tweak Automotive Services, Maps Contracts to Appease German Regulator",
        "date": "2025-04-09",
        "summary": "The company said it would license the services contained in its Google Automotive Services business as separate stand-alone versions."
    },
    {
        "company": "GOOGL",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "GOOGL",
        "title": " ‘Sell America’ Trade Picks Up After New Trump Threats on Fed",
        "date": "2025-04-21",
        "summary": "P.M. Edition for April 21. U.S. markets were on edge about President Trump's tariff war as well as his threats to fire Federal Reserve chief Jerome Powell. Stocks fell, the dollar hit fresh multiyear lows against major currencies, and yields on longer-term Treasurys rose. Plus, U.S. megabanks are built for business from all corners of the globe. Heard on the Street columnist "
    },
    {
        "company": "GOOGL",
        "title": "Can Robots Make Sneakers? Just Ask Nike.",
        "date": "2025-04-22",
        "summary": "President Trump wants more products to be made in the U.S., pushing some companies toward robotics in a bid to avoid high labor costs. But WSJ reporter Jon Emont says "
    },
    {
        "company": "GOOGL",
        "title": "South Korean Firm Galaxy Corporation Targets $1 Billion Valuation in 2026 IPO",
        "date": "2025-04-21",
        "summary": "Galaxy Corporation, a South Korean entertainment-technology group representing K-pop star G-Dragon, plans to go public next year in a deal that could value it at around $1.0 billion."
    },
    {
        "company": "GOOGL",
        "title": "AI Tools Help Alzheimer’s Researchers Dig Into Data",
        "date": "2025-03-27",
        "summary": "The Oxford Drug Discovery Institute uses artificial intelligence-powered databases "
    },
    {
        "company": "GOOGL",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Google Faces Potential $6.6 Billion U.K. Antitrust Lawsuit Over Search Advertising",
        "date": "2025-04-16",
        "summary": "The lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services."
    },
    {
        "company": "GOOGL",
        "title": "Japan Regulator Orders Google to Stop Anticompetitive Practices",
        "date": "2025-04-15",
        "summary": "Japan’s antitrust regulator instructed Alphabet’s Google to stop what it said are anticompetitive practices involving mobile search services, its first order against a U.S. technology giant."
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "GOOGL",
        "title": "Trump Must Deregulate U.S. Energy to Unleash AI Dominance",
        "date": "2025-04-08",
        "summary": "America’s vast natural gas reserves can power data centers and help it win the AI race with China."
    },
    {
        "company": "GOOGL",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "GOOGL",
        "title": "Can Europe's Homegrown Satellite Company Compete with Elon Musk's Starlink?",
        "date": "2025-04-14",
        "summary": "Europe is looking at Eutelsat, a smaller rival to Starlink, to reduce its reliance on the U.S. company. Plus, how much personal information should you give an AI chatbot? WSJ personal tech columnist Nicole Nguyen dives into that in our special three-part series “"
    },
    {
        "company": "GOOGL",
        "title": "Galaxy Digital Settles with NYAG for $200 Million Over Luna Ties",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "GOOGL",
        "title": "How Google Used AI to Re-Create ‘The Wizard of Oz’ for the Las Vegas Sphere",
        "date": "2025-04-09",
        "summary": "Google invented new techniques to enhance resolution and generated new character performances to bring the 1939 film to the giant screen."
    },
    {
        "company": "GOOGL",
        "title": "EU Bets on Gigafactories to Catch Up With U.S., China in AI Race",
        "date": "2025-04-09",
        "summary": "The European Union said it would focus on building AI data and computing infrastructure and making it easier for companies to comply with regulation."
    },
    {
        "company": "GOOGL",
        "title": "AI Boom to Fuel Surge in Data Center Energy Needs, IEA Says",
        "date": "2025-04-10",
        "summary": "The global push for artificial intelligence is poised to fuel a sharp rise in electricity demand, with consumption from data centers expected to more than double by the end of the decade, according to the International Energy Agency."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Japan Accuses Google of Being Anticompetitive",
        "date": "2025-04-15",
        "summary": "Plus: JPMorgan Chase, Bank of America and Bank of New York Mellon press pause on electronic communications with their regulator following an email hack. And Johnson & Johnson says tariffs will increase costs for its medical-technology products. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Amazon CEO Says Generative AI Will Reinvent Every Customer Experience",
        "date": "2025-04-10",
        "summary": "Generative AI is going to reinvent virtually every customer experience and enable entirely new ones that have only been dreamed about, Amazon.com Chief Executive Andy Jassy said."
    },
    {
        "company": "GOOGL",
        "title": "The AI Data-Center Boom Is Coming to Rural America",
        "date": "2025-03-30",
        "summary": "Meta Platforms and other tech companies are looking for huge swaths of flat land and plentiful power."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Former Intel CEO Pat Gelsinger Makes a Few More Long-Shot Bets  ",
        "date": "2025-03-26",
        "summary": "The semiconductor titan that failed to turn around Intel is refocusing his energy on other challenges, like quantum computing and taking churches to the cloud."
    },
    {
        "company": "GOOGL",
        "title": "Trump to Review Preliminary TikTok Deal As Deadline Approaches",
        "date": "2025-04-02",
        "summary": "Senior administration officials are expected to attend a Wednesday meeting about a potential deal; plan would require Beijing’s blessing."
    },
    {
        "company": "GOOGL",
        "title": "The Drone-Delivery Service Beating Amazon to Your Front Door",
        "date": "2025-03-29",
        "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables."
    },
    {
        "company": "GOOGL",
        "title": "Chatbot Confidential: Using AI for Tax Preparation",
        "date": "2025-03-30",
        "summary": "People are tapping generative AI-powered chatbots for help with everything from writing code to planning vacations. But using generative AI is risker for some tasks than others. Ahead of the last day to file taxes, WSJ’s personal tech columnist Nicole Nguyen joins Tech News Briefing for the special series “Chatbot Confidential,” where she’ll reveal best practices for using AI chatbots while being mindful of protecting your privacy."
    },
    {
        "company": "GOOGL",
        "title": "Meta’s Head of AI Research to Resign Amid Computing Push",
        "date": "2025-04-01",
        "summary": "Joelle Pineau said she would step down effective May 30, creating an executive vacancy as the company aggressively invests and competes in the booming sector."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The Trump Family Advances Its All-Out Crypto Blitz, This Time With Bitcoin Mining",
        "date": "2025-03-31",
        "summary": "A business led by two of the president’s sons will invest in American Bitcoin, a new mining company controlled by Hut 8."
    },
    {
        "company": "GOOGL",
        "title": "Chatbot Confidential: When AI at Work Is Risky Business",
        "date": "2025-04-06",
        "summary": "Gen AI chatbots have changed how we work. Today, we bring you the second installment of Tech News Briefing’s special series “Chatbot Confidential,” where WSJ personal tech columnist Nicole Nguyen details best practices for using the chatbots while protecting your privacy. In this episode, we dive into an area where the temptation to tap generative AI tools is very strong: work! We’ll tell you about the risks your new helper brings and how not to give away company secrets while using them."
    },
    {
        "company": "GOOGL",
        "title": "AI Agents Are a Moment of Truth for Tech",
        "date": "2025-03-29",
        "summary": "All emerging technology needs to deliver on its promise, sooner or later. For AI agents, that time is now."
    }
]