[
    {
        "company": "GOOGL",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Google Says End of U.S. Trade Loophole to Pose Headwind",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Google Says End of ‘De Minimis’ Exemption to Pose Headwind",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Tesla, Boeing and Alphabet Earnings: What to Watch for This Week",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Tesla Profit Slumps",
        "date": "2025-04-22",
        "summary": "Plus: Meta could see a $7 billion pullback from Chinese advertisers over tariffs, research firm says. And Verizon says it won’t cover any handset price increases due to tariffs. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Google Faces Its Monopoly Reckoning",
        "date": "2025-04-20",
        "summary": "The Justice Department’s proposal that the company share data, shed its Chrome browser, and cease exclusionary contracts deserves broad support. "
    },
    {
        "company": "GOOGL",
        "title": "Tesla, Boeing Earnings; Home Sales: What to Watch This Week",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "GOOGL",
        "title": "Google Faces Potential $6.6 Billion U.K. Antitrust Lawsuit Over Search Advertising",
        "date": "2025-04-16",
        "summary": "The lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services."
    },
    {
        "company": "GOOGL",
        "title": "Judge Rules Google Operates Illegal Ad Monopoly",
        "date": "2025-04-18",
        "summary": "The tech giant faces multiple legal threats related to how it wields market power."
    },
    {
        "company": "GOOGL",
        "title": "Colgate-Palmolive Cuts Earnings Outlook on Tariffs",
        "date": "2025-04-25",
        "summary": "Colgate-Palmolive posted a higher profit in the first quarter but lowered 2025 earnings guidance due to tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Colgate-Palmolive Cuts Earnings Outlook on Tariffs",
        "date": "2025-04-25",
        "summary": "Colgate-Palmolive posted a higher profit in the first quarter but lowered 2025 earnings guidance due to tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Tesla’s Net Income Sinks 71% in First Quarter",
        "date": "2025-04-22",
        "summary": "Plus: stocks rally on optimism from White House on tariff negotiations. And Verizon says it won’t pay for the costs of tariffs on smartphones, but shoppers will. Anthony Bansie hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "GE Aerospace Profit Climbs on Gains in Commercial Services, Defense",
        "date": "2025-04-22",
        "summary": "The maker of jet engines reported higher earnings for the first quarter on revenue gains from its defense businesses and commercial engines and services unit."
    },
    {
        "company": "GOOGL",
        "title": "Justice Department Urges Tough Action to Break Google’s Search Dominance",
        "date": "2025-04-21",
        "summary": "The judge who found that the tech company maintained an illegal monopoly is asked to force it to sell its Chrome web browser."
    },
    {
        "company": "GOOGL",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Verizon Earnings Top Views; Reports Wider Post-Paid Phones Losses",
        "date": "2025-04-22",
        "summary": "Verizon Communications reported a rise in first-quarter earnings but postpaid phone losses increased. Verizon said it is still on course to meet its yearly goals."
    },
    {
        "company": "GOOGL",
        "title": "Nokia Flags Earnings Hit From Tariffs",
        "date": "2025-04-24",
        "summary": "The company expects to take an earnings hit in the second quarter from tariffs and said that reaching the high end of its guidance range for the year now looked more challenging."
    },
    {
        "company": "GOOGL",
        "title": "Boeing Earnings; PMI Surveys; Home Sales: What to Watch Wednesday Onward This Week",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Meta Could Be Facing $7 Billion in Lost Revenue From China",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tesla Profit Sinks, Hurt by Backlash Over Elon Musk’s Political Role",
        "date": "2025-04-22",
        "summary": "The chief executive says he will spend significantly less time on DOGE starting in May. First-quarter net income falls 71%."
    },
    {
        "company": "GOOGL",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "LG Electronics Posts Earnings Beat, Plans to Relocate Some Production to U.S.",
        "date": "2025-04-24",
        "summary": "The South Korean consumer-electronics giant reiterated plans to relocate some production to the U.S. in response to President Trump’s recent tariff action."
    },
    {
        "company": "GOOGL",
        "title": "Watch: Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "GOOGL",
        "title": "General Dynamics 1Q Profit Jumps on Rising Revenue",
        "date": "2025-04-23",
        "summary": "General Dynamics recorded higher earnings in the first quarter as its aerospace segment improved its profitability and revenue climbed."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Just Eat Takeaway Posts Flat Growth for Key Metric, Backs Guidance",
        "date": "2025-04-23",
        "summary": "The food-delivery group said gross transaction value for the first quarter was €4.72 billion, compared with €4.70 billion for the same period a year earlier."
    },
    {
        "company": "GOOGL",
        "title": "Just Eat Takeaway Posts Flat Growth for Key Metric, Backs Guidance",
        "date": "2025-04-23",
        "summary": "The food-delivery group said gross transaction value for the first quarter was €4.72 billion, compared with €4.70 billion for the same period a year earlier."
    },
    {
        "company": "GOOGL",
        "title": "SAP Shares Jump After Earnings Beat Forecasts Despite Tariff Uncertainty",
        "date": "2025-04-23",
        "summary": "Shares surged after the business-software group posted operating profit that beat analysts’ expectations and backed its full-year guidance, reassuring investors."
    },
    {
        "company": "GOOGL",
        "title": "Traders Wager on a Rocky Earnings Season",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tariff Uncertainty Clobbers Earnings Optimism",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "GOOGL",
        "title": "Tech Shares Drive Stocks Higher for a Third Straight Session",
        "date": "2025-04-24",
        "summary": "Nasdaq Composite is up more than 5% this week on trade-deal optimism."
    },
    {
        "company": "GOOGL",
        "title": "Huawei Posts Profit Drop But Revenue Signals Solid Comeback",
        "date": "2025-03-31",
        "summary": "The Chinese technology giant’s net profit fell in 2024 as higher expenses weighed, but solid revenue growth signals that the company is making a comeback after years of heavy U.S. sanctions that have affected its businesses."
    },
    {
        "company": "GOOGL",
        "title": "Procter & Gamble Cuts Fiscal-Year Guidance",
        "date": "2025-04-24",
        "summary": "Procter & Gamble lowered its fiscal-year outlook after posting lower sales in the third quarter amid a challenging consumer environment."
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Relief Rally, Day Three",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "GOOGL",
        "title": "Comcast Loses Broadband Customers, Takes Theme-Park Hit From L.A. Fires",
        "date": "2025-04-25",
        "summary": "​The company posted lower quarterly earnings, but found bright spots with its mobile-phone plans and Peacock streaming service."
    },
    {
        "company": "GOOGL",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "GOOGL",
        "title": "Hasbro Beats Estimates as Profitability Improves",
        "date": "2025-04-24",
        "summary": "The toymaker said the global tariff war hadn’t impacted first-quarter results, adding that the company wouldn’t touch the guidance it gave in February given the level of uncertainty in the trade environment."
    },
    {
        "company": "GOOGL",
        "title": "Netflix, Unscathed by Tariffs, Posts Record Profit",
        "date": "2025-04-17",
        "summary": "The streamer forecasts stronger revenue growth in the second quarter."
    },
    {
        "company": "GOOGL",
        "title": "Tesla Stock Jumps After Musk Says He Will Spend Less Time on DOGE",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Capital One Profit Rises Ahead of Discover Merger",
        "date": "2025-04-22",
        "summary": "Capital One recorded a higher first-quarter profit and is prepared to complete its acquisition of Discover on May 18."
    },
    {
        "company": "GOOGL",
        "title": "SAP Posts Higher Revenue, Operating Profit",
        "date": "2025-04-22",
        "summary": "Sales from the business-software company’s core cloud business rose to 4.99 billion euros from 3.93 billion euros while total revenue rose to 9.01 billion euros compared with 8.04 billion euros in the prior-year period."
    },
    {
        "company": "GOOGL",
        "title": "Capital One Profit Rises Ahead of Discover Merger",
        "date": "2025-04-22",
        "summary": "Capital One recorded a higher first-quarter profit and is prepared to complete its acquisition of Discover on May 18."
    },
    {
        "company": "GOOGL",
        "title": "SAP Posts Higher Revenue, Operating Profit",
        "date": "2025-04-22",
        "summary": "Sales from the business-software company’s core cloud business rose to 4.99 billion euros from 3.93 billion euros while total revenue rose to 9.01 billion euros compared with 8.04 billion euros in the prior-year period."
    },
    {
        "company": "GOOGL",
        "title": "Trump Targets Democratic Fundraising",
        "date": "2025-04-25",
        "summary": "A.M. Edition for April 25. President Trump directs the Justice Department to "
    },
    {
        "company": "GOOGL",
        "title": "Adidas Posts Better-Than-Expected Results Despite Tariff Threat",
        "date": "2025-04-23",
        "summary": "Operating profit rose to €610 million from €336 million previously, the German sporting-goods company said."
    },
    {
        "company": "GOOGL",
        "title": "WPP CEO Sees Client Unease Amid Tariff Uncertainty, But No Spending Cuts",
        "date": "2025-04-25",
        "summary": "EXCLUSIVE: “The bigger question is what happens longer term, how this impacts the economy. I don’t think we’ll see that in the U.S. until May,” the head of the advertising company said in an interview."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "U.S. Could Pause Ukraine Talks If Progress Isn’t Made Soon",
        "date": "2025-04-18",
        "summary": "A.M. Edition for April 18. Secretary of State Marco Rubio says Washington has presented Kyiv and Moscow with a framework deal to end their war, but that "
    },
    {
        "company": "GOOGL",
        "title": "Marketers Are ‘Scenario Planning’ in an Uncertain Economy, Ad Giant IPG Says",
        "date": "2025-04-24",
        "summary": "Interpublic Group reiterated its 2025 organic revenue guidance and tried to assure analysts that it’s capable of handling any potential downturn."
    },
    {
        "company": "GOOGL",
        "title": "SK Hynix Posts Strong First Quarter Earnings on AI Chip Demand",
        "date": "2025-04-23",
        "summary": "The South Korean memory chip maker posted stronger-than-expected earnings for the first quarter on brisk demand for artificial-intelligence chips amid uncertainty about sweeping U.S. tariffs."
    },
    {
        "company": "GOOGL",
        "title": "AT&T Adds More Subscribers, Sees Tariffs Spurring Phone Upgrades",
        "date": "2025-04-23",
        "summary": "The telecom company said that tariffs triggered an acceleration in consumers upgrading their mobile phones."
    },
    {
        "company": "GOOGL",
        "title": "GE Vernova Swings to Profit as Backlog Rises",
        "date": "2025-04-23",
        "summary": "GE Vernova swung back to a profit in the first quarter as orders stacked up and its revenue climbed, sending shares higher in the premarket session."
    },
    {
        "company": "GOOGL",
        "title": "BYD First-Quarter Profit Doubled on Strong EV Sales",
        "date": "2025-04-25",
        "summary": "Chinese auto giant BYD continued to outpace Tesla in the first quarter, reporting a doubling in net profit on robust growth in its electric-vehicle business."
    },
    {
        "company": "GOOGL",
        "title": "China Bets Trump Will Cave on Tariffs",
        "date": "2025-04-24",
        "summary": "P.M. Edition for April 24. Chinese officials call for full repeal of levies and dismiss suggestions that trade talks with Washington have begun. WSJ Asia economic reporter Jason Douglas says President Trump’s apparent softening on tariffs against China strengthens "
    },
    {
        "company": "GOOGL",
        "title": "The Score: UnitedHealth, Netflix, Eli Lilly and More Stocks That Defined the Week",
        "date": "2025-04-18",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news"
    },
    {
        "company": "GOOGL",
        "title": "How Many Trillions Do Americans Spend Complying With Federal Rules?",
        "date": "2025-04-24",
        "summary": "The regulatory tax rivals the income tax."
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about Canadian railway cargo, Kuehne + Nagel, Renault and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Saint-Gobain Shares Rise After Company Posts Higher Sales, Reassures on Tariffs",
        "date": "2025-04-25",
        "summary": "The supplier of construction materials’ stock rose after it reported higher revenue, confirmed its full-year outlook and said it has no direct exposure to customs tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Hyundai Profit Steady but Tariff Hit Looms",
        "date": "2025-04-24",
        "summary": "South Korea’s largest carmaker reported steady profit despite headwinds from overall sluggish electric-vehicle demand, but President Trump’s new sweeping tariffs threaten to put a brake on growth."
    },
    {
        "company": "GOOGL",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "A Side Hustle for Friends of Musk: Selling Access to Stakes in His Private Companies",
        "date": "2025-04-25",
        "summary": "Lucrative stock deals have allowed SpaceX to avoid public scrutiny even as it has grown into one of the largest companies in the U.S."
    },
    {
        "company": "GOOGL",
        "title": "Stocks Rally on New Hopes of Tariffs Easing",
        "date": "2025-04-22",
        "summary": "The Dow industrials surged more than 1,000 points after Monday’s selloff."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Tuesday Recap: Another Wild Swing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Uber Sued Over Cancellation Practices",
        "date": "2025-04-21",
        "summary": "Plus: The Justice Department asks a federal judge to force Google to sell its Chrome web browser. And crypto firms swoop in on the banking world with applications for charters. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": "WSJ Heard on the Street columnist Dan Gallagher breaks down why Tesla stock is on the rise even after the electric car company posted a 71% drop in net income during its most recent quarter. "
    },
    {
        "company": "GOOGL",
        "title": "3M Keeps Guidance but Adds Tariff Hazards",
        "date": "2025-04-22",
        "summary": "The company says Trump’s tariff campaign could knock down adjusted earnings per share by 20 cents to 40 cents this year."
    },
    {
        "company": "GOOGL",
        "title": "PepsiCo Says Tariff Costs Will Contribute to Earnings Decline this Year",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Kimberly-Clark Cuts Profit Outlook as New Tariff Costs Mount",
        "date": "2025-04-22",
        "summary": "The CEO said the company doesn’t plan to cut investments or pass the costs on to consumers with across-the-board price increases."
    },
    {
        "company": "GOOGL",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "GOOGL",
        "title": "Kimberly-Clark Lowers Profit Forecast, Citing ‘Geopolitical Landscape’",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Apple, Meta Fined by EU, Ordered to Comply With Tech Competition Rules",
        "date": "2025-04-23",
        "summary": "The move risks ratcheting up tensions with the Trump administration as EU officials pursue trade talks."
    },
    {
        "company": "GOOGL",
        "title": "70,000 Bets a Minute: How FanDuel’s Parent Is Winning at Sports Gambling",
        "date": "2025-04-25",
        "summary": "Peter Jackson, the CEO of "
    },
    {
        "company": "GOOGL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Fresnillo, gold futures and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "GOOGL",
        "title": "Newmont Profit, Revenue Jump, Boosted by Gold Surge",
        "date": "2025-04-23",
        "summary": "The gold miner recorded a profit of $1.9 billion, or $1.68 a share, up from $179 million, or 15 cents a share, a year earlier."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Either Sadness or Euphoria",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "GOOGL",
        "title": "STMicroelectronics Expects Lower Sales, but Signals Recovery Is Coming",
        "date": "2025-04-24",
        "summary": "The company projected lower sales as weak demand for some semiconductors used in cars and industrial equipment continued to plague an industry that now faces heightened uncertainty from unpredictable tariff policies."
    },
    {
        "company": "GOOGL",
        "title": "IMF Warns Tariffs Will Slow Global Economic Growth and Hit U.S. Economy",
        "date": "2025-04-22",
        "summary": "Plus, Gold surges to $3500 in intraday trading. And defense stocks fall after some of the biggest industry names report their earnings. Anthony Bansie hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Wednesday Recap: Either Sadness or Euphoria",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Here’s How Big the AI Revolution Really Is, in Four Charts",
        "date": "2025-04-23",
        "summary": "It’s as transformative as the internet itself. Here are the key players in the generative-AI battle, and where they stand right now."
    },
    {
        "company": "GOOGL",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "GOOGL",
        "title": "South Korean Firm Galaxy Corporation Targets $1 Billion Valuation in 2026 IPO",
        "date": "2025-04-21",
        "summary": "Galaxy Corporation, a South Korean entertainment-technology group representing K-pop star G-Dragon, plans to go public next year in a deal that could value it at around $1.0 billion."
    },
    {
        "company": "GOOGL",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Delivery Hero Shares Fall on Weaker Performance in Asia",
        "date": "2025-04-24",
        "summary": "Shares fell after the food-delivery group reported a weaker performance in its Asian segment, raising concerns about its ability to recover in South Korea."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Tesla Has a Deep Hole to Pull Out Of",
        "date": "2025-04-23",
        "summary": "Elon Musk promises more attention on the EV maker, but brand damage from his political activities won’t be easy to repair."
    },
    {
        "company": "GOOGL",
        "title": "Kuehne + Nagel Exceeds Expectations as Earnings Rise",
        "date": "2025-04-24",
        "summary": "The logistics group reported an increase in net profit which exceeded analysts’ expectations after earnings rose at most of the company’s business segments."
    },
    {
        "company": "GOOGL",
        "title": "GE Aerospace Plans to Offset Tariffs with Cost Cuts, Seek Refunds on Some Duties",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Japan Accuses Google of Being Anticompetitive",
        "date": "2025-04-15",
        "summary": "Plus: JPMorgan Chase, Bank of America and Bank of New York Mellon press pause on electronic communications with their regulator following an email hack. And Johnson & Johnson says tariffs will increase costs for its medical-technology products. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "LG Electronics Expects Lower Quarterly Operating Profit",
        "date": "2025-04-07",
        "summary": "The South Korean consumer-electronics giant forecast a 5.7% drop in first-quarter operating profit, though it sustained steady revenue growth."
    },
    {
        "company": "GOOGL",
        "title": "Stocks Fall and the Dollar Drops Amid Trump’s Threats to Fire Fed Chair",
        "date": "2025-04-21",
        "summary": "Investors are seeking refuge after President Trump’s renewed attacks on Federal Reserve chief Jerome Powell. Plus: DHL stock falls after it suspends high-value shipments to the U.S. And Capital One shares rise after regulators approve its $35 billion acquisition of Discover. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": " ‘Sell America’ Trade Picks Up After New Trump Threats on Fed",
        "date": "2025-04-21",
        "summary": "P.M. Edition for April 21. U.S. markets were on edge about President Trump's tariff war as well as his threats to fire Federal Reserve chief Jerome Powell. Stocks fell, the dollar hit fresh multiyear lows against major currencies, and yields on longer-term Treasurys rose. Plus, U.S. megabanks are built for business from all corners of the globe. Heard on the Street columnist "
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Continue Rally for Second Day",
        "date": "2025-04-23",
        "summary": "Plus: The White House says there will be \"no unilateral reduction in tariffs against China.\" And OpenAI CEO Sam Altman says he is stepping down as chairman of the nuclear-energy startup Oklo. Anthony Bansie hosts."
    },
    {
        "company": "GOOGL",
        "title": "Stock Gains Accelerate",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Russia Launches Major Assault on Kyiv",
        "date": "2025-04-24",
        "summary": "A.M. Edition for April 24. Moscow has "
    },
    {
        "company": "GOOGL",
        "title": "Traders Expect Wild Swings After Tesla Reports Earnings",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Fed Chair in the Hot Seat",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "GOOGL",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "GOOGL",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Now Streaming on Netflix: A Show Where Profits Trump the Trade War",
        "date": "2025-04-18",
        "summary": "The streaming giant sticks by its full-year forecast in a rare show of resilience in a tumultuous market."
    },
    {
        "company": "GOOGL",
        "title": "Deliveroo Revenue Rises on Strong Growth, Backs Guidance",
        "date": "2025-04-17",
        "summary": "The food delivery company reported higher revenue for the first quarter, boosted by robust gross transaction value growth in key markets."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Japan Regulator Orders Google to Stop Anticompetitive Practices",
        "date": "2025-04-15",
        "summary": "Japan’s antitrust regulator instructed Alphabet’s Google to stop what it said are anticompetitive practices involving mobile search services, its first order against a U.S. technology giant."
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "GOOGL",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "GOOGL",
        "title": "Samsung Guides for Softer First-Quarter Profit But Still Beats Consensus",
        "date": "2025-04-08",
        "summary": "Samsung Electronics guided for softer first-quarter operating profit amid few signs of an immediate recovery in its flagship semiconductor business."
    },
    {
        "company": "GOOGL",
        "title": "Google Offers to Tweak Automotive Services, Maps Contracts to Appease German Regulator",
        "date": "2025-04-09",
        "summary": "The company said it would license the services contained in its Google Automotive Services business as separate stand-alone versions."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Publicis Confirms Outlook After Organic Growth Beats Expectations",
        "date": "2025-04-15",
        "summary": "The advertising and marketing-services group confirmed its outlook for the year after first-quarter organic growth beat expectations, saying new business wins can make up for potential cuts to client spending due to tariff uncertainty."
    },
    {
        "company": "GOOGL",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Citigroup Reports Jump in Profit, Revenue",
        "date": "2025-04-15",
        "summary": "Citigroup reported a jump in profit and revenue in the first quarter of 2025 that beat analysts’ expectations, thanks in part to market volatility that generated higher fees for its trading business."
    },
    {
        "company": "GOOGL",
        "title": "Dow Drops More Than 500 Points",
        "date": "2025-04-17",
        "summary": "Trump renews attack on Federal Reserve Chair Jerome Powell. Plus, Netflix posts higher-than expected earnings. Eli Lilly stock surges after GLP-1 pill succeeds in a pivotal trial. Ariana Aspuru hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Wall Street’s Trading Revenue Powered by Tariff Uncertainty",
        "date": "2025-04-14",
        "summary": "Goldman Sachs is the latest big bank to report that increased trading fueled its quarterly profit."
    },
    {
        "company": "GOOGL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "GOOGL",
        "title": "Spotify, Netflix Prove Bright Spots Within Broader Market Selloff",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "GOOGL",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "GOOGL",
        "title": "Meta’s Ad Business Relies a Lot on China. Tariffs Could Hurt It, Warns Analyst.",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "GOOGL",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Edge Lower While Investors Wait for Signs on Tariff Talks",
        "date": "2025-04-15",
        "summary": "The Dow Industrials and the S&P 500 slid fractionally; bank stocks gained on strong earnings reports."
    },
    {
        "company": "GOOGL",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "Plus: Goldman Sachs profit surges as tariff uncertainty powers trading revenue. And U.S. companies are going bankrupt at the fastest rate since 2010. Charlotte Gartenberg hosts."
    },
    {
        "company": "GOOGL",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Edge Lower While Investors Wait for Signs on Tariff Talks",
        "date": "2025-04-15",
        "summary": "The Dow Industrials and the S&P 500 slid fractionally; bank stocks gained on strong earnings reports."
    },
    {
        "company": "GOOGL",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "Plus: Goldman Sachs profit surges as tariff uncertainty powers trading revenue. And U.S. companies are going bankrupt at the fastest rate since 2010. Charlotte Gartenberg hosts."
    },
    {
        "company": "GOOGL",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "GOOGL",
        "title": "Amazon Rallies as Investors See More Resilience",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Powell, Global Rate Moves, Retail Sales: What to Watch This Week in Markets",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Morgan Stanley’s Profit Surged on Trading Revenue",
        "date": "2025-04-11",
        "summary": "The bank’s profit increased to $4.32 billion in the first three months of the year, or $2.60 per share, surpassing the $2.18 per share analysts expected."
    },
    {
        "company": "GOOGL",
        "title": "By the Numbers: How Bad Was This Week in the Stock Market?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "GOOGL",
        "title": "Abbott Labs Bracing for Tariffs as Profits Rise",
        "date": "2025-04-16",
        "summary": "Abbott Labs boosted its earnings in the first quarter and hinted that its full-year guidance might have gotten a lift were it not for looming cost hikes from the recent tariff war."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Bank Shots",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on U.S. auto sales in March, the Canadian economy, Germany’s labor market, and more in the latest Market Talks covering the auto and transport sector."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Bank of America, Citi Stocks Rally; Wall Street Profits From Tariff Chaos",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Trump Settles on Tariff Plan Ahead of ‘Liberation Day’ Deadline",
        "date": "2025-04-01",
        "summary": "Plus, Meta CEO Mark Zuckerberg is pressing U.S. trade officials to help fight an expected European Union ruling that could undermine its ad business. And Softbank agrees to lead $40 billion funding for OpenAI. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Read about  Tesla, U.S. machinery companies,  airlines,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Thursday Recap: Tariff Wipeout",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "GOOGL",
        "title": "Why Earnings Expectations Are Too High",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "GOOGL",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Apple’s Margins Are Still a Big Risk in Trade War Roller Coaster: Heard on the Street",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Rent the Runway, Xiaomi , Telecom Italia, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "GOOGL",
        "title": "BYD Guides for Strong Earnings in Move to Shore Up Market Confidence",
        "date": "2025-04-08",
        "summary": "China’s biggest automaker forecast strong first-quarter earnings in rare early guidance, a move aimed at restoring confidence among investors."
    },
    {
        "company": "GOOGL",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Sainsbury’s Profit Beat Market Views",
        "date": "2025-04-17",
        "summary": "Sainsbury’s beat profit expectations for the full fiscal year, as the company focuses on supporting sales volumes by lowering prices."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Galaxy Digital Settles with NYAG for $200 Million Over Luna Ties",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Volkswagen Earnings Miss Hopes on Higher Costs, Including Tariff Hit",
        "date": "2025-04-10",
        "summary": "First-quarter earnings missed expectations after taking a hit from one-off items including some early impact from U.S. import tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Volkswagen Earnings Miss Hopes on Higher Costs, Including Tariff Hit",
        "date": "2025-04-10",
        "summary": "First-quarter earnings missed expectations after taking a hit from one-off items including some early impact from U.S. import tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Netflix and Spotify Are Resilient, but Not Recession-Proof",
        "date": "2025-04-15",
        "summary": "Streaming giants are better positioned than rivals for a recession, but pricey stocks also depend on growth from new ventures."
    },
    {
        "company": "GOOGL",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "GOOGL",
        "title": "Stocks Fall After President Trump Unveils New Tariffs on Auto Imports",
        "date": "2025-03-27",
        "summary": "Shares in all of the Big Three U.S. automakers dropped after the announcement, but Tesla stock ticked up. Plus: GameStop plunged after saying it would issue $1.3 billion of convertible bonds to buy bitcoin. And Dollar Tree shares jumped after announcing the sale of its Family Dollar business. Danny Lewis hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Global Equities Tumble on Sweeping U.S. Tariffs",
        "date": "2025-04-03",
        "summary": "European stocks tumbled at the open, following Asia and U.S. stock futures lower in the wake of worse-than-expected U.S. tariffs that raised concerns about a global economic slowdown."
    },
    {
        "company": "GOOGL",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "GOOGL",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Dow Falls More Than 1,000 Points, Nasdaq Loses 4% in Another Volatile Day",
        "date": "2025-04-10",
        "summary": "Plus: President Trump says he is open to Japan’s Nippon Steel investing in U.S. Steel but not owning it. CarMax misses its quarterly earnings estimates. And Modelo owner Constellation Brands cuts its annual outlook. Anthony Bansie hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Trump Administration Investigating Pharmaceutical and Semiconductor Tariffs",
        "date": "2025-04-15",
        "summary": "Plus, South Korea says it’s preparing roughly $23 billion in government support for the chip sector amid tariff uncertainty. And Netflix aims for a $1trillion market capitalization. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Tuesday Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Bunzl Shares Hit 4-Year Lows on Guidance Cut, Share-Buyback Pause",
        "date": "2025-04-16",
        "summary": "Bunzl cut its guidance for the year and paused its share-buyback program given the uncertain macro environment and resulting margin pressure in its North American business."
    },
    {
        "company": "GOOGL",
        "title": "Wells Fargo Profit Rises, Boosted by Lower Expenses",
        "date": "2025-04-11",
        "summary": "Wells Fargo booked a bigger profit in the first quarter, as lower expenses helped offset a decline in net interest income."
    },
    {
        "company": "GOOGL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on TotalEnergies, BP, Viva Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "GOOGL",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "GOOGL",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Tariff Scramble",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "GOOGL",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Bank Trading Desks Are Minting Money From Trump’s Tariff Chaos",
        "date": "2025-04-15",
        "summary": "Goldman Sachs, JPMorgan and Morgan Stanley all saw huge jumps in trading revenue."
    },
    {
        "company": "GOOGL",
        "title": "See How Government Spending Is Up Even as Musk Touts Savings",
        "date": "2025-04-11",
        "summary": "DOGE’s estimated $150 billion in savings has barely made a dent in $6.8 trillion of federal spending, a WSJ analysis finds."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: Lululemon, General Motors, Deutsche Bank",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks End Lower After Tariffs Rattle Carmakers",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Uniqlo Owner Boosts Earnings Forecast",
        "date": "2025-04-10",
        "summary": "Fast Retailing boosted its annual earnings forecast despite tariff uncertainties, expecting another year of record profit as revenue continued to grow across regions."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Gold Is Green",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "GOOGL",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "GOOGL",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "GOOGL",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "GOOGL",
        "title": "Stocks Tumble Again in Brutal Week on Wall Street",
        "date": "2025-04-04",
        "summary": "The U.S. stock market lost $6.6 trillion in market cap in two days as China retaliated against President Trump’s wide-ranging tariffs. Plus: Shares of companies that make goods in Vietnam rise after Trump said the country wants to negotiate, while chip stocks fell. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "Inflation, Consumer Fears Fuel Stock Selloff",
        "date": "2025-03-28",
        "summary": "The Dow fell more than 700 points, while gold hit a record and bonds climbed. The anticipation of tariff developments next week also weighed on stocks."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Global Markets Drop on Fears of Escalating U.S.-China Trade Tensions",
        "date": "2025-04-16",
        "summary": "European and Asian stock indexes were down, along with U.S. futures, as investor confidence soured on signs of worsening trade tensions between the world’s two largest economies."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks Post Gains Ahead of Trump Tariff Announcement",
        "date": "2025-04-02",
        "summary": "Investors hope clarity on trade will help markets recover."
    },
    {
        "company": "GOOGL",
        "title": "Ericsson Posts Rise in North American Spending Ahead of Tariffs",
        "date": "2025-04-15",
        "summary": "The network business reported a 6% rise in sales, with strong growth in North America as customers moved forward investments ahead of planned U.S. tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Ericsson Posts Rise in North American Spending Ahead of Tariffs",
        "date": "2025-04-15",
        "summary": "The network business reported a 6% rise in sales, with strong growth in North America as customers moved forward investments ahead of planned U.S. tariffs."
    },
    {
        "company": "GOOGL",
        "title": "Omnicom Gives More Cautious 2025 Outlook As Tariffs Create Uncertainty about Ad Spending ",
        "date": "2025-04-15",
        "summary": "Advertising giant hasn’t seen any specific instances of marketer clients pulling back thus far, executives say."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Wednesday Recap: Brake Lights",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Recap: Tariff Scramble",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "GOOGL",
        "title": "Tariff Pause Sends Tech Stocks Soaring",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "MicroStrategy Expects to Post Loss After Bitcoin Price Slumps",
        "date": "2025-04-07",
        "summary": "The software company said it notched $5.91 billion in unrealized losses on its digital assets for the quarter ended March 31."
    },
    {
        "company": "GOOGL",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Tumble as Trade-War Jitters Return",
        "date": "2025-04-10",
        "summary": "The Dow industrials and S&P 500 give back some gains from Wednesday’s historic rally."
    },
    {
        "company": "GOOGL",
        "title": "Bitcoin Price Falls to About $78,000",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ashmore, Goldman Sachs and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Fall, Wiping Out More Than $3 Trillion in Market Value",
        "date": "2025-04-03",
        "summary": "P.M. Edition for April 3. U.S. markets experience their s"
    },
    {
        "company": "GOOGL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "GOOGL",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "GOOGL",
        "title": "More Than 100 Million Options Contracts Changed Hands on Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks End Tumultuous Week Highe",
        "date": "2025-04-11",
        "summary": "Stocks rose after the White House said it has 15 trade-deal offers on the table and China said set its reciprocal tariffs on U.S. imports at 125%. Plus: Big banks’ stocks rose after posting profits from equities trading revenue. And shares of gold mining companies jumped amid investors’ rush to haven assets. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks End Tumultuous Week Highe",
        "date": "2025-04-11",
        "summary": "Stocks rose after the White House said it has 15 trade-deal offers on the table and China said set its reciprocal tariffs on U.S. imports at 125%. Plus: Big banks’ stocks rose after posting profits from equities trading revenue. And shares of gold mining companies jumped amid investors’ rush to haven assets. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Thursday: General Motors, Jefferies, GameStop, Lululemon",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on CarMax, General Motors, container shipping lines, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Tesco Shares Fall on Profit Warning as Competition Heats Up",
        "date": "2025-04-10",
        "summary": "Shares fell after the U.K.’s largest supermarket said it expects profit to fall as competition intensifies, with rivals such as Asda ramping up efforts to gain market share."
    },
    {
        "company": "GOOGL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "GOOGL",
        "title": "Asian Stock Markets Fall on Tariff Concerns",
        "date": "2025-04-16",
        "summary": "Equity markets in Asia declined as concerns about tariffs again weighed on sentiment, with technology shares hit by uncertainty over how the Trump administration’s trade policies will affect supply chains."
    },
    {
        "company": "GOOGL",
        "title": "Global Markets Rise on Tech Tariff Reprieve ",
        "date": "2025-04-14",
        "summary": "Stocks gained after Trump exempted semiconductor equipment, smartphones and other electronics from tariffs, even though officials later signaled they would be put in their own levy bracket."
    },
    {
        "company": "GOOGL",
        "title": "Asian Stocks Rise Amid Hopes for Trade Talks",
        "date": "2025-04-17",
        "summary": "Equity markets in Asia gained Thursday despite a negative lead from the U.S. overnight as traders weighed tentative hopes for U.S.-China trade talks."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "GOOGL",
        "title": "Albertsons Sales Grow on Boost From Pharmacy Business",
        "date": "2025-04-15",
        "summary": "Albertsons  saw its top-line figure increase in the latest quarter as its pharmacy business powered identical sales growth."
    },
    {
        "company": "GOOGL",
        "title": "Heard on the Street Wednesday Recap: Buy the Yips",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "S&P and Nasdaq Notch Biggest Quarterly Losses Since 2022",
        "date": "2025-03-31",
        "summary": "A mixed session capped a turbulent quarter as investors turned from excitement over President Trump’s tax cuts and deregulation to fears over tariffs and a recession. Plus: Newsmax shares surge on first day of trading. Danny Lewis hosts. "
    },
    {
        "company": "GOOGL",
        "title": "EU Chief Warns Bloc Could Target Digital Services If Talks With U.S. Fail–Report",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "GOOGL",
        "title": "U.S. Bancorp Profit Climbs With Higher Fees, Lower Costs",
        "date": "2025-04-16",
        "summary": "The parent company of U.S. Bank posted a profit of $1.71 billion, or $1.03 a share,  above analysts expectations of 98 cents a share."
    },
    {
        "company": "GOOGL",
        "title": "Inflation Data, Tariff Worries Weigh on Stocks",
        "date": "2025-03-28",
        "summary": "Plus, automaker shares extend losses. And the Coreweave IPO disappoints in a stumble for the market for new public listings. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "Bitcoin Price Rises Toward $80,000 in Crypto Rebound",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Bitcoin Price Rises Toward $80,000 in Crypto Rebound",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "One Tech CEO Expects Tariffs to Hit Growth Prospects ",
        "date": "2025-04-03",
        "summary": "‘I can bet you that the impact of what’s happening on the macro side will be felt in the second half of the year,’ Egnyte Chief Executive Vineet Jain said."
    },
    {
        "company": "GOOGL",
        "title": "Trump’s Tariff Announcement Drives Steepest Decline in U.S. Markets Since 2020",
        "date": "2025-04-03",
        "summary": "The stock market plunged as investors grappled with the threat that Trump’s new import tax plan will set off global retaliation and hurt economic growth. Plus, big tech companies lose hundreds of billions of dollars in value, while regulated utilities got a boost from the recession trade. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "Global Markets Mixed With Trade Talks in Focus",
        "date": "2025-04-17",
        "summary": "Traders weighed tentative hopes for U.S.-China talks, as Asian stock markets closed higher and U.S. stock futures rose following Wednesday’s tech-fueled slump on Wall Street."
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ford, GM, Stellantis, and more in the latest Market Talks covering Auto and Transport."
    },
    {
        "company": "GOOGL",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "GOOGL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Bank of America, Citigroup and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Don’t Blame Trump for All of the Stock Market’s Problems",
        "date": "2025-03-27",
        "summary": "Though the trade war has heightened uncertainty, slower earnings growth and a cooler labor market would likely have impacted the market regardless."
    },
    {
        "company": "GOOGL",
        "title": "WSJ’ s Take On the Week Podcast: What to Watch For This Earnings Season As Trump’s Tariffs Come Into Play",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-31",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "GOOGL",
        "title": "7-Eleven Owner Targets Profit Growth Despite Tariff Uncertainty",
        "date": "2025-04-09",
        "summary": "Seven & i Holding projected a rise in annual profit despite the uncertainty caused by U.S. tariffs, continuing efforts to stave off a takeover attempt by the Canadian owner of Circle K"
    },
    {
        "company": "GOOGL",
        "title": "Nikkei Rises After Trump's Tariff Moves",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "GOOGL",
        "title": "Today's Rally is Nearing Records",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-29",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "GOOGL",
        "title": "Trump: We’re Making a Fortune With Tariffs",
        "date": "2025-04-09",
        "summary": "At the National Republican Congressional Committee dinner, President Trump claimed the U.S. was earning $2 billion a day from tariffs. "
    },
    {
        "company": "GOOGL",
        "title": "Bitcoin Jumps Above $82,000 After Trump Announcement",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "GOOGL",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "GOOGL",
        "title": "China Industrial Profits Remain in Decline",
        "date": "2025-03-27",
        "summary": "Chinese industrial companies’ profit decline slowed in the first two months of the year  suggesting that Beijing’s stimulus is having some effect."
    },
    {
        "company": "GOOGL",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "White House Says Trump Tariffs Tomorrow Will Take Effect ‘Immediately’",
        "date": "2025-04-01",
        "summary": "P.M. Edition for April 1. Trump met with advisers to iron out the final details of his reciprocal tariff plans, as Canada and the EU prepare their responses. Plus, "
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Soar as President Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "P.M. Edition for April 9. U.S. stocks stage a furious rally after Trump "
    },
    {
        "company": "GOOGL",
        "title": "These Stocks are Leading Losses Today",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insights on car prices, Goodyear Tire & Rubber, Volvo Car, and more in the latest Market Talks covering the Automotive and Transportation sectors."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "GOOGL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Read about the U.S. rig count, Canada’s central bank, SSE,  and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "GOOGL",
        "title": "Most Voters Oppose Trump’s Tariffs, But His Supporters Are Still Behind Him",
        "date": "2025-04-04",
        "summary": "P.M. Edition for April 4. "
    },
    {
        "company": "GOOGL",
        "title": "Nike Stock Drop Erases $12 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "GameStop’s Rapid Shrinkage Is Paying Off",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "What Bucked the Stock Selloff? French Fries, Soda, Cigarettes, Utilities and Healthcare",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": " TNB Tech Minute: TikTok Lives On…For Now",
        "date": "2025-04-04",
        "summary": "Plus, the Magnificent Seven continue their stock-market slide. And fintechs put their IPO roadshows on hold. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Leave Apple With Nothing But Hard Choices—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "U.S. Stocks Fall Sharply as Consumer Sentiment Sours in March",
        "date": "2025-03-28",
        "summary": "P.M. Edition for Mar. 28. Stocks sold off after hotter-than-expected inflation data, President Trump's tariff announcements and "
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "GOOGL",
        "title": "Markets Fall, Dollar Sinks as Investors Grapple with Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": "Plus, SunnyD sells to a Guatemalan company for about $1.5 billion. And New York City Mayor Eric Adams forms his own political party to run for re-election. Alex Ossola hosts. "
    },
    {
        "company": "GOOGL",
        "title": "Trump Administration Touts ‘Wins’ After Two-Day Selloff",
        "date": "2025-04-04",
        "summary": null
    }
]