[
    {
        "company": "GOOGL",
        "title": "India Sees a Golden Opportunity in U.S.-China Trade War",
        "date": "2025-04-22",
        "summary": "A.M. Edition for April 22. The U.S. and India agree to broad terms to negotiate a potential trade deal. WSJ’s South Asia bureau chief "
    },
    {
        "company": "GOOGL",
        "title": "Bold Names Season 3",
        "date": "2025-04-25",
        "summary": "WSJ interview series where you hear directly from the leaders of bold-name companies."
    },
    {
        "company": "GOOGL",
        "title": "JD Vance Sees an India That America Can Work With",
        "date": "2025-04-22",
        "summary": "The vice president says India and the U.S. are making progress in trade talks."
    },
    {
        "company": "GOOGL",
        "title": "Fiction: ‘Major Arcana’ by John Pistelli",
        "date": "2025-04-23",
        "summary": "Plus Vijay Khurana’s “The Passenger Seat” and Osamu Dazai’s “No One Knows.”"
    },
    {
        "company": "GOOGL",
        "title": "Corrections & Amplifications",
        "date": "2025-04-21",
        "summary": "Corrections & Amplifications for the edition of April 22, 2025"
    },
    {
        "company": "GOOGL",
        "title": "U.S. Targets Chinese Solar-Panel Supply Chain With Steep Tariffs",
        "date": "2025-04-22",
        "summary": "Plus, The U.S. and India agree to broad terms of negotiation for a potential bilateral trade deal. And pharma giant Roche pledges to invest $50 billion in the U.S. Luke Vargas hosts."
    },
    {
        "company": "GOOGL",
        "title": "World’s Newest Country Teeters on Edge of Civil War",
        "date": "2025-04-06",
        "summary": "A standoff between the president and his deputy is threatening to tip South Sudan back into ethnic conflict."
    },
    {
        "company": "GOOGL",
        "title": "Why AI Might Not Take All Our Jobs ",
        "date": "2025-04-14",
        "summary": "MIT economics professor Sendhil Mullainathan says it is in humans’ power to put artificial intelligence on a path to help us rather than replace us."
    },
    {
        "company": "GOOGL",
        "title": "The Business Moguls Who Turn to Astrologists for Big Decisions",
        "date": "2025-04-13",
        "summary": "Executives in South Asia make sure the stars and planets are aligned for success before choosing the location of offices or launching new ventures."
    },
    {
        "company": "GOOGL",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "U.S. Tariffs Spark Hopes for Big-Bang Reforms in India",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "We Should Measure Prices in Time",
        "date": "2025-04-16",
        "summary": "The consumer-price index tells us nothing about changes in affordability. We need another measure."
    },
    {
        "company": "GOOGL",
        "title": "Marketers Are Putting More Content and Quality Control in the Hands of AI",
        "date": "2025-04-17",
        "summary": "The arrival of marketing campaigns generated entirely by artificial intelligence is inevitable, consultants say."
    },
    {
        "company": "GOOGL",
        "title": "Anatomy of a Trade Deal",
        "date": "2025-04-16",
        "summary": "What’s the likelihood of Team Trump landing 90 trade deals in 90 days? Consider the complexities of just one: India."
    },
    {
        "company": "GOOGL",
        "title": "Consumer Spending Under Tariffs: Pimco Manager on What Investors Can Watch For",
        "date": "2025-04-13",
        "summary": "On WSJ’s Take On the Week, co-hosts Gunjan Banerji and Telis Demos talk about the markets' reaction to the latest developments in President Trump’s tariffs policies. They talk about the “buy the dip” trade and weigh in on “the stock market isn’t the economy” debate. The hosts also discuss what’s going on with Treasurys."
    },
    {
        "company": "GOOGL",
        "title": "India Erases Islamic and Colonial History",
        "date": "2025-03-26",
        "summary": "Battling sectarians have a long history of behaving in the manner of American leftists after George Floyd’s killing in 2020."
    },
    {
        "company": "GOOGL",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "GOOGL",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "GOOGL",
        "title": "Week Ahead for FX, Bonds: Investors to Watch U.S. Inflation, Sentiment Data as Tariff Clouds Loom",
        "date": "2025-04-04",
        "summary": "Focus will center on the University of Michigan’s consumer sentiment survey, while inflation data could offer clues on prospects of interest-rate cuts to support the economy. Federal Reserve minutes will also be released."
    },
    {
        "company": "GOOGL",
        "title": "Can Pepsi Make a Comeback? ",
        "date": "2025-04-11",
        "summary": "After decades of fighting Coca-Cola to be the nation’s favorite soda, Pepsi dropped to third place, after Dr Pepper. Now "
    },
    {
        "company": "GOOGL",
        "title": "The Inside Story of Sam Altman’s Firing–and Rehiring–at OpenAI",
        "date": "2025-04-07",
        "summary": "WSJ reporter Keach Hagey gives us a behind-the-scenes look into one of the "
    },
    {
        "company": "GOOGL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on oil futures, Sidara, S-Oil,  and more in the latest Market Talks on Energy and Utilities."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "When Beijing’s Bullies Come to Town",
        "date": "2025-03-27",
        "summary": "I’ve learned firsthand that China will seek to snuff out my activism wherever I live."
    },
    {
        "company": "GOOGL",
        "title": "How Is SoftBank Funding Its Mega Investment in OpenAI? A Lot of Debt",
        "date": "2025-04-01",
        "summary": "The Japanese investment firm is entwining its fortunes with a company that expects to lose billions of dollars for years to come, in the hope that it will emerge as the leader in AI."
    },
    {
        "company": "GOOGL",
        "title": "Maine State Pension Lawsuit Highlights Private-Markets Disclosure Debate",
        "date": "2025-04-16",
        "summary": "A former farming executive is suing the pension manager for information on an investment in Prima Wawona, once the largest stone fruit grower in the U.S."
    },
    {
        "company": "GOOGL",
        "title": "Russian Strike on Ukraine’s Sumy Kills Over 30",
        "date": "2025-04-14",
        "summary": "President Trump described the Russian ballistic-missile strike that killed dozens of people in the northern Ukrainian city of Sumy as “a mistake.”"
    },
    {
        "company": "GOOGL",
        "title": "The Billionaire Caught Between Trump and China",
        "date": "2025-04-15",
        "summary": "The Hong Kong-based company CK Hutchinson, led by "
    },
    {
        "company": "GOOGL",
        "title": "The Secrets and Misdirection Behind Sam Altman’s Firing From OpenAI",
        "date": "2025-03-28",
        "summary": "The inside story of how the CEO of the hottest tech company was ousted and, just as quickly, resurrected."
    },
    {
        "company": "GOOGL",
        "title": "PNC Names Former BlackRock Star Mark Wiedman as President",
        "date": "2025-04-07",
        "summary": "Once an heir apparent for Larry Fink, Wiedman now tops the list of potential successors to PNC chief Bill Demchak."
    },
    {
        "company": "GOOGL",
        "title": "Coming Soon: Bold Names Season Three",
        "date": "2025-04-11",
        "summary": "Every day, Wall Street Journal reporters talk with the most powerful, influential and interesting people. On the next season of WSJ’s Bold Names podcast, columnists "
    },
    {
        "company": "GOOGL",
        "title": "‘The Thinking Machine’: From Denny’s to Dominance",
        "date": "2025-04-07",
        "summary": "Nvidia’s chief executive is not an easy boss, but he recognized that the company’s chips could power innovations in artificial intelligence."
    },
    {
        "company": "GOOGL",
        "title": "The Clock Is Ticking Loudly for Intel’s New Boss",
        "date": "2025-04-01",
        "summary": "Lip-Bu Tan isn’t yet signaling a major departure from Intel’s past strategy, but expectations for change are high."
    },
    {
        "company": "GOOGL",
        "title": "Catastrophic Earthquakes Test Myanmar Junta’s Grip on Power",
        "date": "2025-03-30",
        "summary": "The military-led regime has been weakened by a yearslong civil war. Now millions are counting on it to allow emergency aid."
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Can the Democrats Make a Comeback During Trump 2.0?",
        "date": "2025-03-27",
        "summary": "Recent polls have shown approval ratings for Democrats are reaching all-time lows, with voters voicing their dissatisfaction with the way major cities are being run and implementation of liberal initiatives. So what can the party do after some self-reflection? On this episode of Potomac Watch, political scientist Ruy Teixeira tells Paul Gigot what changes Democrats need to make and why the party seems to embrace dysfunction instead of reform. "
    },
    {
        "company": "GOOGL",
        "title": "This Former USAID Head Has Advice for Elon Musk and DOGE",
        "date": "2025-04-18",
        "summary": "Rajiv Shah"
    }
]