[
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on Tesla, Italian asset managers, the U.S. airline market, and more in the latest Market Talks covering Auto and Transport."
    },
    {
        "company": "GOOGL",
        "title": "California Coastal Commission Unites Musk and Newsom",
        "date": "2025-04-18",
        "summary": "It stands in the way of both rebuilding fire-ravaged Los Angeles and SpaceX launches at Vandenberg."
    },
    {
        "company": "GOOGL",
        "title": "Wes Moore Makes an EV U-Turn",
        "date": "2025-04-22",
        "summary": "The Maryland Governor withdraws his state from California’s mandate penalties."
    },
    {
        "company": "GOOGL",
        "title": "A Side Hustle for Friends of Musk: Selling Access to Stakes in His Private Companies",
        "date": "2025-04-25",
        "summary": "Lucrative stock deals have allowed SpaceX to avoid public scrutiny even as it has grown into one of the largest companies in the U.S."
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Tesla, BYD, Volvo, and more in the latest Market Talks covering the auto and transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk Is Stepping Back From DOGE. Can He Really Stay Away?",
        "date": "2025-04-25",
        "summary": "Elon Musk says he’s going to spend less time in Washington and more time running Tesla. WSJ columnist and Musk-watcher Tim Higgins unpacks what that plan might look like in reality. Also, the WSJ’s Isabelle Bousquette takes us inside "
    },
    {
        "company": "GOOGL",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "GOOGL",
        "title": "I Really Like Electric Cars. These Technologies Would Make Me Love Them.",
        "date": "2025-04-20",
        "summary": "I’ve been buying EVs for more than 10 years. But innovations on the horizon will make a big difference to me—and lots of other skeptical consumers."
    },
    {
        "company": "GOOGL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on oil futures, Woodside Energy and more in the latest Market Talks covering the Energy & Utilities sector."
    },
    {
        "company": "GOOGL",
        "title": "Washington State’s Tax on Tesla",
        "date": "2025-04-20",
        "summary": "Olympia designs a tax targeting Elon Musk and his company’s carbon emissions credits."
    },
    {
        "company": "GOOGL",
        "title": "The Oil Patch’s ‘Manhattan Project’: How to Fix Its Gargantuan Water Problem",
        "date": "2025-04-21",
        "summary": "Oil companies wrestling with huge amounts of wastewater have bold plans to turn the nuisance into a valuable product."
    },
    {
        "company": "GOOGL",
        "title": "Five-Minute EV Charging Is Here, but Not for U.S.-Made Cars",
        "date": "2025-04-23",
        "summary": "CATL and BYD have unveiled advances underscoring how far China has extended its global dominance over next-generation technologies."
    },
    {
        "company": "GOOGL",
        "title": "This Bridge Promised to Boost U.S.-Canada Trade—Then Tariffs Arrived",
        "date": "2025-04-22",
        "summary": "The $4.6 billion Gordie Howe bridge linking Detroit and Windsor, Ontario, is nearing completion. But with tariffs rising and trade slowing, its vision of stronger U.S.-Canada ties may be unraveling. "
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: Uber Sued Over Cancellation Practices",
        "date": "2025-04-21",
        "summary": "Plus: The Justice Department asks a federal judge to force Google to sell its Chrome web browser. And crypto firms swoop in on the banking world with applications for charters. Katie Deighton hosts."
    },
    {
        "company": "GOOGL",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "GOOGL",
        "title": "It’s Not a Bird, or a Plane: It’s Your Walmart Delivery",
        "date": "2025-03-28",
        "summary": "Drone-delivery company Zipline aims to safely—and quietly—drop packages to consumers. Plus, WSJ columnist Tim Higgins tells us about the latest in the duality of Elon Musk the "
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "GOOGL",
        "title": "E-Bikes Overtake the Horse and Buggy in Amish Country",
        "date": "2025-04-11",
        "summary": "Battery-powered bikes have spread in an Ohio Amish community, along with the fear they will "
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Canada’s auto industry, Delta, Mercedes-Benz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk’s Mr. Fix-It Takes Center Stage During a Really Bad Week",
        "date": "2025-04-05",
        "summary": "Antonio Gracias made a rare public appearance alongside his friend as he helps with DOGE."
    },
    {
        "company": "GOOGL",
        "title": "General Motors to Suspend Production, Lay Off 500 at Electric Vehicle Plant in Ontario",
        "date": "2025-04-11",
        "summary": "General Motors has temporarily halted production of its BrightDrop electric delivery van as the automaker will initiate temporary layoffs starting April 14 and workers will return in May for limited production."
    },
    {
        "company": "GOOGL",
        "title": "New Mexico Man Arrested for ‘Hurling Firebombs’ at Teslas",
        "date": "2025-04-15",
        "summary": "Attorney General Pam Bondi says she is seeking up to 40 years in prison."
    },
    {
        "company": "GOOGL",
        "title": "The Panicked Voice on the Phone Sounded Like Her Daughter. It Wasn’t.",
        "date": "2025-04-05",
        "summary": "An alleged abduction, a demand for money and a tense drive to Walmart."
    },
    {
        "company": "GOOGL",
        "title": "Self-Driving Truck Startup Kodiak to Go Public in $2.5 Billion SPAC Deal",
        "date": "2025-04-14",
        "summary": "Deal comes amid slow market for U.S. IPOs as several firms work—and sometimes struggle—to automate long-haul trucking."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Read about airline spending, DHL, Daimler Truck, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "The Drone-Delivery Service Beating Amazon to Your Front Door",
        "date": "2025-03-29",
        "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables."
    },
    {
        "company": "GOOGL",
        "title": "The $40 Billion Startup Mystery Shaking Up Silicon Valley",
        "date": "2025-04-09",
        "summary": "The founder says Figure AI has created autonomous robots, setting off an investor frenzy in private markets."
    },
    {
        "company": "GOOGL",
        "title": "The AI Data-Center Boom Is Coming to Rural America",
        "date": "2025-03-30",
        "summary": "Meta Platforms and other tech companies are looking for huge swaths of flat land and plentiful power."
    },
    {
        "company": "GOOGL",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "GOOGL",
        "title": "NASA Astronauts Get Used to Life on Earth After Orbital Saga ",
        "date": "2025-03-31",
        "summary": "Barry Wilmore said that astronauts, NASA and Boeing need to spend time analyzing the Starliner mission to improve future flights."
    },
    {
        "company": "GOOGL",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Read about March U.S. retail sales, United Airlines, BMW,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk’s Mission to Take Over NASA—and Mars",
        "date": "2025-03-30",
        "summary": "The billionaire is in position to speed up plans for a voyage to the planet, with a potentially huge impact on SpaceX."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Four Takeaways From a Senate Hearing on the D.C. Plane Crash",
        "date": "2025-03-28",
        "summary": "The acting FAA chief and others faced questions from senators following the midair collision in January that took 67 lives."
    },
    {
        "company": "GOOGL",
        "title": "Humanoid Robots Are Lousy Co-Workers. China Wants to Be First to Change That.",
        "date": "2025-03-30",
        "summary": "The U.S. and China are racing to build a truly useful humanoid worker. Whoever wins could gain an edge in countless labor-intensive industries."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "In Secret Meeting, China Acknowledged Role in U.S. Infrastructure Hacks",
        "date": "2025-04-10",
        "summary": "A senior Chinese official linked intrusions to escalating U.S. support for Taiwan."
    },
    {
        "company": "GOOGL",
        "title": "Why Even U.S.-Made Trucks Aren’t Safe From Tariffs",
        "date": "2025-04-03",
        "summary": "Trump says cars made in the U.S. will face “absolutely no tariff,” but it’s not so simple. No vehicle is built from 100% U.S. parts—not even the U.S.-made pickup. WSJ takes a look inside a Ford F-150 to understand how automakers will be affected."
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Uber, Hertz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Peter Navarro on Musk Calling Him a Moron: 'I've Been Called Worse’",
        "date": "2025-04-13",
        "summary": "Peter Navarro said on NBC’s “Meet the Press” program that his relationship with Elon Musk is good, despite Musk calling the White House trade adviser a “moron” on X."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "GOOGL",
        "title": "Stocks to Watch Friday: JPMorgan, Wells Fargo, BlackRock, Newmont",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Create Opening for ‘Made in America’ Ads—With Carefully Chosen Words",
        "date": "2025-04-08",
        "summary": "Ford Motor Company released an ad campaign this month titled “Committed to America,” stating that it assembles more vehicles in the U.S. and employs more hourly workers in the country than any other automaker."
    },
    {
        "company": "GOOGL",
        "title": "The AI Arms Race Is Coming to Rural America",
        "date": "2025-04-08",
        "summary": "Mark Zuckerberg’s Meta plans to build a "
    },
    {
        "company": "GOOGL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on Tesla, BlackBerry and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "GM Halts Production of EV Van at Canada Plant",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Democrats Fear Trump’s Crypto Entity Poses Regulatory Conflict",
        "date": "2025-03-28",
        "summary": "Senators wrote to financial watchdogs to ask how they plan to oversee the Trump family’s cryptocurrency activities."
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "Elon Musk Brings His Vision for Mars to NASA",
        "date": "2025-04-09",
        "summary": "The SpaceX founder has backed a friend to lead the space agency and make a Mars mission a priority. Wall Street Journal reporters Emily Glazer and Micah Maidenberg talk about Musk’s "
    },
    {
        "company": "GOOGL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "GOOGL",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "GOOGL",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "GOOGL",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "GOOGL",
        "title": "TNB Tech Minute: OpenAI’s $40 Billion Funding Round Has a Catch",
        "date": "2025-03-28",
        "summary": "Plus, CoreWeave’s much-anticipated IPO flounders. And, President Trump adds Nikola’s founder to his raft of pardons. Victoria Craig hosts."
    },
    {
        "company": "GOOGL",
        "title": "Thousands of Anti-Trump Protesters Gathered Around the World",
        "date": "2025-04-05",
        "summary": "Massive protests against President Trump took place across the U.S. and in different parts of the world. "
    },
    {
        "company": "GOOGL",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "GOOGL",
        "title": "Trump's 25% Tariffs on Cars / The Rest of the Houthi Signal Chat",
        "date": "2025-03-28",
        "summary": "Citing national security, Donald Trump puts 25% tariffs on automobiles, adding to his protectionist experiment, as he pushes U.S. taxes on imports to the highest in 75 years. Plus, the White House's effort to play down its use of Signal to discuss U.S. military actions results in the release of more messages, including one giving specific timing for \"F-18s LAUNCH (1st strike package).\""
    },
    {
        "company": "GOOGL",
        "title": "Trump's 25% Tariffs on Cars / The Rest of the Houthi Signal Chat",
        "date": "2025-03-28",
        "summary": "Citing national security, Donald Trump puts 25% tariffs on automobiles, adding to his protectionist experiment, as he pushes U.S. taxes on imports to the highest in 75 years. Plus, the White House's effort to play down its use of Signal to discuss U.S. military actions results in the release of more messages, including one giving specific timing for \"F-18s LAUNCH (1st strike package).\""
    },
    {
        "company": "GOOGL",
        "title": "Surrender or Resist? The Dilemma Facing Allies Caught in Trump’s Trade War",
        "date": "2025-03-26",
        "summary": "P.M. Edition for Mar. 26. When confronted with President Trump’s plan to impose tariffs, governments are still figuring out "
    },
    {
        "company": "GOOGL",
        "title": "Does Meta Have a Social Media Monopoly?",
        "date": "2025-04-17",
        "summary": "Mark Zuckerberg is in court defending Meta against a "
    },
    {
        "company": "GOOGL",
        "title": "What Happened to the Once-Great State of California?",
        "date": "2025-03-31",
        "summary": "Governor Gavin Newsom has turned California into a prime example of everything that can go wrong under Democratic leadership, piling on green initiatives that stifle business and raise prices, while allowing crime and homelessness to explode. What will it take for the Golden State to make a comeback? On this episode of All Things, political commentator and possible gubernatorial candidate Steve Hilton explains how California got into this mess, how to fix it, and his new book, “Califailure: Reversing the Ruin of America's Worst-Run State.”  "
    }
]