[
    {
        "company": "GOOGL",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "GOOGL",
        "title": "A Spooky Mask Made Him a Rock Star. Here’s Why He Took it Off",
        "date": "2025-04-23",
        "summary": "Musician Charley Yang became a TikTok phenomenon with millions of followers. Nobody knew it was him. This was good, then bad."
    },
    {
        "company": "GOOGL",
        "title": "Video: Trump Says He May Call Powell About Interest Rates",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Utah Takes Action to Protect Child Internet Stars",
        "date": "2025-03-31",
        "summary": "The daughter of a former influencer and the state of Utah have taken on the dark side of mommy bloggers. We talk to reporter Zusha Elinson about how the Ruby Franke scandal "
    },
    {
        "company": "GOOGL",
        "title": "How to Find Internet Fame in 2025: Talk Tariffs",
        "date": "2025-04-01",
        "summary": "The relatively prosaic world of import duties has become a surprise social-media hit, driving millions of views for some internet personalities and trade experts."
    },
    {
        "company": "GOOGL",
        "title": "Tariffs Are Giving These TikTokers an Unlikely Career Boost",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "‘What’s Opera, Doc?’ and Other TV Classics",
        "date": "2025-04-09",
        "summary": "When classical music jumped onto another screen."
    },
    {
        "company": "GOOGL",
        "title": "How ‘A Minecraft Movie’ Won With Memes and Deliberate Stupidity ",
        "date": "2025-04-14",
        "summary": "The video-game adaptation succeeded at both things cinema struggles to do consistently: sell gobs of tickets and get young people into theaters."
    },
    {
        "company": "GOOGL",
        "title": "The Dude Digs Mozart",
        "date": "2025-04-02",
        "summary": "When I hear classical music, my mind goes to the movies."
    },
    {
        "company": "GOOGL",
        "title": "Voice of America Is Broken and Can’t Be Reformed",
        "date": "2025-03-31",
        "summary": "The U.S. international broadcaster is politically biased, confused and ineffective. Tear it down."
    },
    {
        "company": "GOOGL",
        "title": "Video: Our Washington Coverage Chief Answers Your Questions About Tariffs",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "GOOGL",
        "title": "Cell Phone Video Shows Moment Emergency Workers Attacked in Gaza",
        "date": "2025-04-05",
        "summary": "The Israeli military said that the incident on March 23, 2025, which resulted in the deaths of 15 paramedics and first responders, “is under thorough examination process.”"
    },
    {
        "company": "GOOGL",
        "title": "Does Meta Have a Social Media Monopoly?",
        "date": "2025-04-17",
        "summary": "Mark Zuckerberg is in court defending Meta against a "
    }
]