[
    {
        "company": "AAPL",
        "title": "It’s OK for the AP to ‘Parrot’",
        "date": "2025-04-18",
        "summary": "The press should repeat what it hears and leave the thinking to the opinion pages and readers."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about airline credit cards, BNP Paribas, Oversea-Chinese Banking Corp. and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Read about AJ Bell, Worldline and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "AAPL",
        "title": "American Airlines Pulls Full-Year Outlook on Concerns Over Travel Demand",
        "date": "2025-04-24",
        "summary": "American Chief Executive Robert Isom says he is confident the airline can withstand uncertainty in the economy."
    },
    {
        "company": "AAPL",
        "title": "American Airlines Doesn’t Want Tariff-Fueled Prices Increases on Planes",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "UPS to Buy Canada’s Andlauer Healthcare for $1.6 Billion",
        "date": "2025-04-24",
        "summary": "United Parcel Service agreed to buy Canada’s Andlauer Healthcare Group for roughly $1.6 billion in an effort to grow in healthcare transportation and logistics."
    },
    {
        "company": "AAPL",
        "title": "U.S. House Committee Urges Two U.S. Banks to Withdraw From CATL’s Listing",
        "date": "2025-04-18",
        "summary": "A U.S. congressional committee has urged two U.S. banks to pull out of working on Chinese battery giant Contemporary Amperex Technology’s planned listing in Hong Kong, expressing “significant concerns” over their involvement in the process."
    },
    {
        "company": "AAPL",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "AAPL",
        "title": "ASML Warns on Tariff Uncertainty, Logs Weak Orders",
        "date": "2025-04-16",
        "summary": "Orders for the Dutch company’s semiconductor-making equipment came in below forecasts."
    },
    {
        "company": "AAPL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about West Fraser Timber, Resolute Mining, South32 and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "AAPL",
        "title": "AI and Nuclear Power and ‘Wizard of Oz,’ Oh My!",
        "date": "2025-04-21",
        "summary": "Google used artificial intelligence to re-imagine “The Wizard of Oz” for an immersive experience at the Las Vegas Sphere, and WSJ CIO Journal reporter Isabelle Bousquette got "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump Takes Aim at Democratic Fundraising Apparatus",
        "date": "2025-04-24",
        "summary": "The president signed a memo directing the Justice Department to investigate ActBlue, the Democratic Party’s fundraising platform."
    },
    {
        "company": "AAPL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Read about West Fraser Timber, Peabody and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Read about Airports of Thailand, HD Korea Shipbuilding & Offshore Engineering and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Alaska Air Withholds Full-Year Outlook as Second-Quarter Forecast Misses Estimates",
        "date": "2025-04-23",
        "summary": "The outlook came as the airline posted a wider loss and lower-than-expected revenue in the first quarter. Shares fell after-hours."
    },
    {
        "company": "AAPL",
        "title": "Why This Startup Airline Is Turning to Deportation Flights",
        "date": "2025-04-23",
        "summary": "Avelo is slated to begin flights for Immigration and Customs Enforcement, though critics are panning a move the company said is critical to its financial future."
    },
    {
        "company": "AAPL",
        "title": "Gold Bull Kaplan Lands ‘Holy Grail’ Deposit as Precious Metal Hits Records",
        "date": "2025-04-24",
        "summary": "Billionaire investor Thomas Kaplan is nearing a long-held ambition: control of a big gold deposit in Alaska."
    },
    {
        "company": "AAPL",
        "title": "U.S. Needs More Power for AI—but Critical Equipment Is Pricey and Scarce",
        "date": "2025-04-24",
        "summary": "A backlog of renewable energy projects is waiting to connect to the U.S. power grid. Tariffs on steel, aluminum, solar panels and battery components are adding to costs and delays."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about Canadian railway cargo, Kuehne + Nagel, Renault and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "WPP CEO Sees Client Unease Amid Tariff Uncertainty, But No Spending Cuts",
        "date": "2025-04-25",
        "summary": "EXCLUSIVE: “The bigger question is what happens longer term, how this impacts the economy. I don’t think we’ll see that in the U.S. until May,” the head of the advertising company said in an interview."
    },
    {
        "company": "AAPL",
        "title": "Airbus Executive: Tariffs Could Unravel Aerospace Supply Chain’s Post-Covid Recovery",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tariffs Won’t Stop Companies Buying ASML’s Machines—Heard on the Street",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Google Faces Its Monopoly Reckoning",
        "date": "2025-04-20",
        "summary": "The Justice Department’s proposal that the company share data, shed its Chrome browser, and cease exclusionary contracts deserves broad support. "
    },
    {
        "company": "AAPL",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "AAPL",
        "title": "Base Metal Prices Rise But Aluminum’s Upward Trend Could Come Under Pressure",
        "date": "2025-04-25",
        "summary": "Aluminum was up, and demand remained resilient, but suppliers were selling at high prices and spot premiums were pulling back quickly, and as uncertainty over consumption grows it could be difficult to sustain an upward trend."
    },
    {
        "company": "AAPL",
        "title": "ASML Illustrates the Hidden Costs of Tariffs—Heard on the Street",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump’s Policies Boost Left-Leaning World Leaders",
        "date": "2025-04-25",
        "summary": "Support for out-of-favor politicians in Australia, the U.K. and Canada has increased with the president’s tariff actions."
    },
    {
        "company": "AAPL",
        "title": "Airline Results Suggest Less Wealthy Americans Are Already Feeling Tariffs",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on oil prices, Woodside Energy, Superloop and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on oil futures, Woodside Energy and more in the latest Market Talks covering the Energy & Utilities sector."
    },
    {
        "company": "AAPL",
        "title": "ASML Warns on Tariffs and Posts Weak Orders; Stock Slides",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tariffs or No, Alcoa Isn't Rushing to Make More Aluminum in U.S.",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Auto Industry Groups Unite to Lobby Against 25% Car Parts Tariff",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Boeing to Sell Some of Its Navigation Business in $10.55 Billion Deal",
        "date": "2025-04-22",
        "summary": "The agreement includes the sale of Jeppesen, ForeFlight, AerData and OzRunways assets to software investment firm Thoma Bravo."
    },
    {
        "company": "AAPL",
        "title": "Alcoa to Face Steep Costs From Tariffs Despite Strong Results",
        "date": "2025-04-16",
        "summary": "The aluminum producer said it incurred about $20 million in first-quarter costs stemming from tariffs on imports. Alcoa’s CEO said it would be impractical in the short term to increase U.S. aluminum production."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on American Express, Macquarie and more in the latest Market Talks covering financial services."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Companies Tear Up Forecasts Over Trade-War Uncertainty",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Signs Executive Order Targeting University Accreditors",
        "date": "2025-04-23",
        "summary": "The move is the latest in an effort to remake higher education after the president and other Republicans have long criticized the accreditation process."
    },
    {
        "company": "AAPL",
        "title": "Harvard and the View From Hillsdale",
        "date": "2025-04-18",
        "summary": "The small college doesn’t take federal money. Its president, Larry Arnn, argues higher education would be far better if no one did."
    },
    {
        "company": "AAPL",
        "title": "Argentina’s Milei, a MAGA Superstar, Is Bucking Trump on Trade",
        "date": "2025-04-20",
        "summary": "The libertarian leader’s slash-and-burn approach to tariffs and import restrictions puts him out of step with the U.S."
    },
    {
        "company": "AAPL",
        "title": " ‘Sell America’ Trade Picks Up After New Trump Threats on Fed",
        "date": "2025-04-21",
        "summary": "P.M. Edition for April 21. U.S. markets were on edge about President Trump's tariff war as well as his threats to fire Federal Reserve chief Jerome Powell. Stocks fell, the dollar hit fresh multiyear lows against major currencies, and yields on longer-term Treasurys rose. Plus, U.S. megabanks are built for business from all corners of the globe. Heard on the Street columnist "
    },
    {
        "company": "AAPL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Uber, Hertz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Harvard’s Timing Reveals Its Priorities",
        "date": "2025-04-20",
        "summary": "It answers money threats with alacrity but took months to address antisemitism."
    },
    {
        "company": "AAPL",
        "title": "Gov. Greg Abbott's Texas-Size Victory for School Choice",
        "date": "2025-04-18",
        "summary": "After putting his political capital on the line in GOP primaries, Abbott is close to enacting $10,000 scholarships for 100,000 students, as the bill passes the state House with votes to spare. Plus, New York Sen. Chuck Schumer blocks two of Donald Trump's nominees for federal prosecutor by withholding his \"blue slip,\" but the president says he'll give Jay Clayton an interim appointment"
    },
    {
        "company": "AAPL",
        "title": "Trump’s DEI Crackdown Sparks Resistance at K-12 Schools",
        "date": "2025-04-19",
        "summary": "Several states are challenging the administration’s moves in court."
    },
    {
        "company": "AAPL",
        "title": "Judge Orders Trump Administration to Restore AP’s White House Access ",
        "date": "2025-04-09",
        "summary": "The Trump administration had imposed limits on the Associated Press reporters after the news organization refused to adopt the “Gulf of America” terminology."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Continue Rally for Second Day",
        "date": "2025-04-23",
        "summary": "Plus: The White House says there will be \"no unilateral reduction in tariffs against China.\" And OpenAI CEO Sam Altman says he is stepping down as chairman of the nuclear-energy startup Oklo. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "If Trump Delisted Chinese Stocks, Here’s How It Would Work",
        "date": "2025-04-18",
        "summary": "A delisting would take time and send a serious ripple through global markets."
    },
    {
        "company": "AAPL",
        "title": "Bar Association (Saturday Crossword, April 19)",
        "date": "2025-04-18",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump’s Triple Win at the Supreme Court",
        "date": "2025-04-08",
        "summary": "The Justices tell lower courts to stay in their proper judicial lane."
    },
    {
        "company": "AAPL",
        "title": "ObamaCare at the Supreme Court—Again",
        "date": "2025-04-18",
        "summary": "Can Congress delegate coverage decisions to unaccountable experts?"
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "American Airlines to Provide Free Wi-Fi, Joining Race to Court Connected Travelers",
        "date": "2025-04-15",
        "summary": "The deal with AT&T will provide free in-flight internet to loyalty program members, beginning in January."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on U.S. crude-oil inventories, TotalEnergies, Shell and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "AAPL",
        "title": "Your Credit Report Now Knows When You Buy Stuff With the ‘Pay Later’ Option",
        "date": "2025-04-01",
        "summary": "The lender Affirm is beginning to report pay-in-four-installments loans to the credit bureau Experian."
    },
    {
        "company": "AAPL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on copper prices, Rio Tinto, Anglo American and more in the latest Market Talks covering basic materials."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Triple-Dog Supreme Court Dare",
        "date": "2025-04-10",
        "summary": "Will the justices be comfortable with the president’s wholesale regulatory changes?"
    },
    {
        "company": "AAPL",
        "title": "Nuclear Power Is Back. And This Time, AI Can Help Manage the Reactors.",
        "date": "2025-04-11",
        "summary": "Argonne National Lab has an AI-based tool that can help design and operate nuclear reactors—at a time when AI itself is feeding a power frenzy."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "AppLovin Confirms Indication of Interest in TikTok Purchase",
        "date": "2025-04-03",
        "summary": "The Trump administration’s deadline to sell or shut down TikTok is Saturday."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Big Four Auditing Shortfalls Wane in Latest Inspections After Regulator Push",
        "date": "2025-03-31",
        "summary": "The firms’ U.S. units collectively had a deficiency rate of 20%, down from 26% the previous year."
    },
    {
        "company": "AAPL",
        "title": "Judge Rules Google Operates Illegal Ad Monopoly",
        "date": "2025-04-18",
        "summary": "The tech giant faces multiple legal threats related to how it wields market power."
    },
    {
        "company": "AAPL",
        "title": "First Amendment Prevails in Trump vs. the AP",
        "date": "2025-04-13",
        "summary": "‘All the AP wants, and all it gets, is a level playing field.’"
    },
    {
        "company": "AAPL",
        "title": "The AP’s Freedom of Speech—and Yours",
        "date": "2025-03-26",
        "summary": "A brazen attempt to punish us for using words Trump dislikes."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Dow Drops More Than 500 Points",
        "date": "2025-04-17",
        "summary": "Trump renews attack on Federal Reserve Chair Jerome Powell. Plus, Netflix posts higher-than expected earnings. Eli Lilly stock surges after GLP-1 pill succeeds in a pivotal trial. Ariana Aspuru hosts. "
    },
    {
        "company": "AAPL",
        "title": "The Frontman Selling Trump’s Largest Energy Project to Nervous U.S. Allies",
        "date": "2025-03-28",
        "summary": "Alaska Gov. Mike Dunleavy is on a mission to convince Asian partners a $44 billion natural gas project is worth it."
    },
    {
        "company": "AAPL",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "AAPL",
        "title": "Supreme Court Sanity",
        "date": "2025-04-09",
        "summary": "The high court tells forum-shopping lawyers and overreaching judges to cool it."
    },
    {
        "company": "AAPL",
        "title": "‘Vote Pairing’ Is Better Than Proxy Voting",
        "date": "2025-04-08",
        "summary": "Kudos to Speaker Mike Johnson and Rep. Anna Paulina Luna for a creative solution."
    },
    {
        "company": "AAPL",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Australia Won’t Retaliate Against U.S. Tariffs That ‘Have No Basis in Logic’",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Manufacturing Lobby Split on Tariffs",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "AAPL",
        "title": "The AP-White House Case Is About Separation of Powers",
        "date": "2025-04-09",
        "summary": "The Oval Office, like a judge’s chambers, is off-limits to the other government branches."
    },
    {
        "company": "AAPL",
        "title": "Peabody Reviews Anglo American Coal Deal After Mine Fire",
        "date": "2025-04-09",
        "summary": "Peabody Energy said it is reviewing an up to $3.78 billion deal to buy Anglo American’s steelmaking coal operations following a fire at an Australian mine."
    },
    {
        "company": "AAPL",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "AAPL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on commodity futuresSandfire Resources, BHP and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "School Choice Wins Big in Texas",
        "date": "2025-04-17",
        "summary": "Gov. Abbott’s political gamble pays off as a $1 billion scholarship program passes the House."
    },
    {
        "company": "AAPL",
        "title": "Supreme Court Halts Order Requiring Trump Administration to Reinstate Federal Workers",
        "date": "2025-04-08",
        "summary": "Justices say outside groups have no right to contest federal layoffs."
    },
    {
        "company": "AAPL",
        "title": "The Lucky Fliers Who Got the Best Airline-Lounge Deals Ever",
        "date": "2025-04-03",
        "summary": "Prices are rising for airline lounges, and they are coming with more restrictions—just not for these travelers."
    },
    {
        "company": "AAPL",
        "title": "AMD Closes $4.9 Billion ZT Systems Deal, Targeting Its Piece of the ‘AI Factory’",
        "date": "2025-03-31",
        "summary": "Chip giant CEO Lisa Su says AI is still in its “very early stage” as the company revs up competition with Nvidia."
    },
    {
        "company": "AAPL",
        "title": "The AP Cries Wolf About Trump’s ‘Censorship’",
        "date": "2025-03-31",
        "summary": "The White House hasn’t restricted it ‘from covering presidential events.’"
    },
    {
        "company": "AAPL",
        "title": "Anthropic Scores Win in AI Copyright Dispute With Record Labels",
        "date": "2025-03-26",
        "summary": "Anthropic scored a win this week after a U.S. court denied an injunction that Universal Music Group and other record labels had sought to prevent the artificial-intelligence company from using copyrighted lyrics to train its AI models."
    },
    {
        "company": "AAPL",
        "title": "Intel to Sell Majority Stake of Altera to Private Equity Firm Silver Lake",
        "date": "2025-04-14",
        "summary": "Intel will sell a majority stake of its programmable-chip unit to private-equity firm Silver Lake."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Intel to Sell Majority Stake of Altera to Private Equity Firm Silver Lake",
        "date": "2025-04-14",
        "summary": "Intel will sell a majority stake of its programmable-chip unit to private-equity firm Silver Lake."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Canada’s oil-rich province of Alberta, PTT Exploration and Production, Santos, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "AAPL",
        "title": "Vintage Trump",
        "date": "2025-04-15",
        "summary": "Reciprocal agreements for zero tariffs will enable his promised golden age for Americans."
    },
    {
        "company": "AAPL",
        "title": "Four Takeaways From a Senate Hearing on the D.C. Plane Crash",
        "date": "2025-03-28",
        "summary": "The acting FAA chief and others faced questions from senators following the midair collision in January that took 67 lives."
    },
    {
        "company": "AAPL",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Find insight on Shell, Ampol, Viva Energy and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "AAPL",
        "title": "Utah Hands Parents the Keys to the App Store",
        "date": "2025-04-11",
        "summary": "A new law allows families to take legal action when deceptive age and content ratings lead to harm."
    },
    {
        "company": "AAPL",
        "title": "WPP Buys InfoSum in AI Push",
        "date": "2025-04-03",
        "summary": "The London-listed ad group said that InfoSum—which will join its media investment group GroupM—will help it create marketing solutions that are enhanced by AI."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Airlines, used vehicles, Hyundai Mobis, Chinese auto and EV makers and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Big Office Landlord Made $4 Million in Previously Undisclosed Payouts to Its CEO",
        "date": "2025-04-05",
        "summary": "Paramount Group recently revealed that it made payments to the chief executive’s jet company as well as for his personal accounting services."
    },
    {
        "company": "AAPL",
        "title": "AlbaCore Capital Raises Nearly $2 Billion for Direct Lending Fund",
        "date": "2025-03-27",
        "summary": "The firm will use the capital to back sectors such as business services and software across Europe."
    },
    {
        "company": "AAPL",
        "title": "The China Foe Storming State Capitols",
        "date": "2025-04-07",
        "summary": "Michael Lucci, a 40-year-old lobbyist, is making patriotic appeals to advance anti-Beijing laws across the U.S."
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Caterpillar, Shell, OMV and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "AAPL",
        "title": "Is Chinese AI All It’s Cracked Up to Be?",
        "date": "2025-04-16",
        "summary": "Beijing is pushing a tech challenge to the U.S., but Washington can counter it with smart policies."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Find insights on U.S. homebuyer’s monthly payments, UniCredit, Banco BPM, and more in the latest Market Talks covering the Financial Services sector."
    },
    {
        "company": "AAPL",
        "title": "Lawmakers Grill U.S. Trade Representative Over Trump’s Tariff Plan",
        "date": "2025-04-08",
        "summary": "U.S. Trade Representative Jamieson Greer testified before the Senate Finance Committee on President Trump’s trade policies, where senators across the aisle raised skepticism over Trump’s tariff plan. "
    },
    {
        "company": "AAPL",
        "title": "Emboldened Trump Squeezes Traditional Media ",
        "date": "2025-03-29",
        "summary": "News organizations were used to public criticism by President Trump in his first term. Now, with emerging news formats like podcasts getting more popular, legacy organizations’ perceived missteps come at a cost."
    },
    {
        "company": "AAPL",
        "title": "Planned Parenthood Is Latest Target in Trump’s Washington",
        "date": "2025-04-02",
        "summary": "Legal, political and financial threats are pressuring the abortion-rights juggernaut."
    },
    {
        "company": "AAPL",
        "title": "Marketers Are Putting More Content and Quality Control in the Hands of AI",
        "date": "2025-04-17",
        "summary": "The arrival of marketing campaigns generated entirely by artificial intelligence is inevitable, consultants say."
    },
    {
        "company": "AAPL",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "AAPL",
        "title": "The Task Force Taking On American Universities",
        "date": "2025-04-15",
        "summary": "P.M. Edition for April 15. The Task Force to Combat Anti-Semitism is a cross-government group with "
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Read about airline spending, DHL, Daimler Truck, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on gold, JPMorgan Chase, Wells Fargo and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "AAPL",
        "title": "Everyone Loses From Slapping Tariffs on Aircraft—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Sweepstakes Company Publishers Clearing House Files for Bankruptcy  ",
        "date": "2025-04-10",
        "summary": "The direct-mail company’s Prize Patrol gained fame delivering oversize checks with TV cameras running."
    },
    {
        "company": "AAPL",
        "title": "U.S. Employers Boost Hiring, Bucking Trade Turmoil, ADP Report Says",
        "date": "2025-04-02",
        "summary": "Hiring in the private sector picked up pace in the U.S., driven by a rebound in manufacturing and despite uncertainty around trade tariffs, according to a monthly survey."
    },
    {
        "company": "AAPL",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Read about sustainable aviation fuels, Cheniere Energy, European oil stocks, Dialog Group, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "AAPL",
        "title": "Colorado’s New Tack on Gun Control: Make It Harder to Reload",
        "date": "2025-04-13",
        "summary": "The first-of-its-kind legislation could reshape the national gun-control debate as gun-rights groups say it will ban America’s most popular firearms."
    },
    {
        "company": "AAPL",
        "title": "Private Equity World Engulfed by Perfect Storm",
        "date": "2025-04-18",
        "summary": "Tariff-related market turmoil dashes investors’ hopes for payouts​ as dealmaking grinds to a near standstill."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "The AI Arms Race Is Coming to Rural America",
        "date": "2025-04-08",
        "summary": "Mark Zuckerberg’s Meta plans to build a "
    },
    {
        "company": "AAPL",
        "title": "AI Can’t Predict the Impact of Tariffs—but It Will Try",
        "date": "2025-04-15",
        "summary": "Companies are looking to technology to help navigate supply-chain uncertainty."
    },
    {
        "company": "AAPL",
        "title": "Rio Tinto Braces for Investor Vote on Review of London Listing",
        "date": "2025-04-02",
        "summary": "Thursday’s vote in London at Rio Tinto’s annual shareholder meeting will test support for a change that has been championed by activist investor Palliser Capital."
    },
    {
        "company": "AAPL",
        "title": "Australian Prime Minister Albanese Calls Election for May 3",
        "date": "2025-03-28",
        "summary": "Economic and global issues are likely to be key campaign topics, with polls showing that the election will be closely fought."
    },
    {
        "company": "AAPL",
        "title": "The Secrets and Misdirection Behind Sam Altman’s Firing From OpenAI",
        "date": "2025-03-28",
        "summary": "The inside story of how the CEO of the hottest tech company was ousted and, just as quickly, resurrected."
    },
    {
        "company": "AAPL",
        "title": "Albany’s Sleight of Hand on School Attendance",
        "date": "2025-04-06",
        "summary": "Focusing on overall attendance will distract from the high number of students who miss more than 10% of a year’s school days."
    },
    {
        "company": "AAPL",
        "title": "This Financial Firm Can Give Investment Advice in Gen Z Slang, No Cap",
        "date": "2025-04-01",
        "summary": "Arta, a wealth-management startup, is using mobile apps and AI tools to reach young millionaires."
    },
    {
        "company": "AAPL",
        "title": "This Financial Firm Can Give Investment Advice in Gen Z Slang, No Cap",
        "date": "2025-04-01",
        "summary": "Arta, a wealth-management startup, is using mobile apps and AI tools to reach young millionaires."
    },
    {
        "company": "AAPL",
        "title": "Anthropic, Databricks Team Up in Scramble for AI Revenue",
        "date": "2025-03-26",
        "summary": "Anthropic and Databricks struck a five year, $100 million pact to sell artificial intelligence tools to businesses, targeting those seeking to build their own AI agents."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Advice for AP Reporters: Get Back to the Business’s Basics",
        "date": "2025-04-03",
        "summary": "A reader replies to Executive Editor Julie Pace."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration’s El Salvador Deportations Hit by New Legal Challenges",
        "date": "2025-04-09",
        "summary": "Judges in New York and Texas have placed temporary guard rails on the president’s use of a wartime law to deport some alleged gang members to a prison in El Salvador."
    },
    {
        "company": "AAPL",
        "title": "The Ripple Effect Trump’s Tariffs Will Have on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "It isn’t just inflation. Manufacturing and artificial intelligence are at risk, too."
    },
    {
        "company": "AAPL",
        "title": "Trump Takes Tough Approach to Choking Off China’s Access to U.S. Tech",
        "date": "2025-03-26",
        "summary": "The move is the clearest signal yet that the Trump administration intends to further limit what kind of American technology Chinese companies can buy."
    },
    {
        "company": "AAPL",
        "title": "Education That ‘Every Child of God’ Deserves",
        "date": "2025-03-28",
        "summary": "Gov. Josh Shapiro can make good on a school-choice promise."
    },
    {
        "company": "AAPL",
        "title": "Alphabet-Backed Isomorphic Labs Raises $600 Million for AI Drug Development",
        "date": "2025-03-31",
        "summary": "The subsidiary of Google parent Alphabet plans to use its first round of external funding to boost its artificial-intelligence drug design pipeline across multiple therapeutic areas."
    },
    {
        "company": "AAPL",
        "title": "Low Politics Over U.S. Steel",
        "date": "2025-04-06",
        "summary": "Cleveland-Cliffs calls in a hedge fund to get a steel-making monopoly."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Brookfield Asset Management, Generali, Allianz and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "AAPL",
        "title": "ESG Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Gain insight on euro covered bonds, Anglo American Platinum and more in the latest Market Talks covering ESG Impact Investing."
    },
    {
        "company": "AAPL",
        "title": "Oakland Voters: Fund the Police",
        "date": "2025-04-16",
        "summary": "When progressives lose ground in the Bay Area of California…"
    },
    {
        "company": "AAPL",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "Big Law Firms Struck a Truce With Trump—and Set Off a Clash With Recruits",
        "date": "2025-04-04",
        "summary": "Law students at top schools are reconsidering offers at Skadden and other firms while associates are canceling interviews in protest."
    },
    {
        "company": "AAPL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Lundin Mining, Greatland Gold and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "AAPL",
        "title": "Abbott Labs Forecasts Tariff Impact of a ‘Few Hundred Million Dollars’",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Colorado’s Totalitarian Transgenderism Bill",
        "date": "2025-04-17",
        "summary": "HB25-1312 would deem us both child abusers, and it’s an assault on freedom of the press to boot."
    },
    {
        "company": "AAPL",
        "title": "How Right Wing Influencer Laura Loomer Targeted Top Security Officials",
        "date": "2025-04-05",
        "summary": "The conspiracy theorist has been loyal to Trump for a decade. Now, she’s cashing in on her influence."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "AMD Warns of $800 Million Hit From Curbs on Chip Exports",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Bill Ackman’s Fund Lost 12.9% in Early April",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Fed Chair in the Hot Seat",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Consulting Giants Offer Billions in Cuts to Federal Contracts. It Might Not Be Enough.",
        "date": "2025-04-02",
        "summary": "Accenture, Deloitte, IBM and other firms submitted proposed price concessions but are expected to be asked to dig deeper."
    },
    {
        "company": "AAPL",
        "title": "Australian PM Says Trump’s Tariffs Are ‘Not the Act of a Friend’",
        "date": "2025-04-02",
        "summary": "Australian Prime Minister Anthony Albanese said the country would continue to push for President Trump to remove the tariffs he announced earlier in the day. "
    },
    {
        "company": "AAPL",
        "title": "Boeing, Airbus Set to Lose 45-Year Duty-Free Status",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Confusion, Frustration at Produce Industry Meeting",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Temasek-Backed Private-Equity Firm Raises Over $600 Mln in Latest Funding Round",
        "date": "2025-04-14",
        "summary": "Private-equity firm ABC Impact has raised over $600.0 million in its latest funding round, drawing interest from investors, including a multilateral development bank and a sovereign-wealth fund."
    },
    {
        "company": "AAPL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on BlueScope, Rio Tinto and more in the latest Market Talks covering basic materials."
    },
    {
        "company": "AAPL",
        "title": "After Tariff Climbdown, World Asks: Is It Method or Madness?",
        "date": "2025-04-10",
        "summary": "President Trump’s U-turn has left governments around the world pondering how to approach a U.S. that has become nearly impossible to predict."
    },
    {
        "company": "AAPL",
        "title": "Nike and Lululemon Bet Big on Vietnam. They Bet Wrong.",
        "date": "2025-04-04",
        "summary": "Trump’s new tariffs are forcing U.S. apparel and shoe makers to scour the world for new places to manufacture."
    },
    {
        "company": "AAPL",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Caterpillar, China’s new restrictions on rare-earths exports, copper prices and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "AAPL",
        "title": "The California Insurance Safety-Net System That Lost a Million-Dollar Check",
        "date": "2025-04-01",
        "summary": "Customers of the state-chartered Fair Plan face problems including canceled policies, refusals to treat toxins from smoke and dire customer service."
    },
    {
        "company": "AAPL",
        "title": "The Kid Rock-Kamala Coalition",
        "date": "2025-04-02",
        "summary": "Voters rejected Harris, but one of her bad ideas makes a comeback."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "AAPL",
        "title": "Boeing Hit From All Sides in Trump’s Trade War",
        "date": "2025-04-15",
        "summary": "China tells domestic airlines not to place new orders for Boeing jets, adding new pressure to the struggling American plane maker."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "The Amateur Baseball League That Launched the Career of the Man Behind the Torpedo Bat",
        "date": "2025-04-04",
        "summary": "Long before his oddly shaped bat became the talk of baseball, Aaron Leanhardt played in the Boston Metro Baseball League. He wasn’t the only guy on the team to reach the big leagues."
    },
    {
        "company": "AAPL",
        "title": "A Big Coal Plant Was Just Imploded to Make Way for an AI Data Center",
        "date": "2025-04-02",
        "summary": "The country’s largest natural-gas power plant is planned east of Pittsburgh."
    },
    {
        "company": "AAPL",
        "title": "Shipping Tycoons Discuss Separating Panama Ports From Hutchison Deal",
        "date": "2025-04-16",
        "summary": "Mediterranean Shipping Co. explores parallel tracks for contested Panama Canal ports and the rest of the deal with BlackRock."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Read about March U.S. retail sales, United Airlines, BMW,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "The Bitter Pill of Reliance on China ",
        "date": "2025-04-17",
        "summary": "Nearly half of generic active pharmaceutical ingredients consumed in the U.S. originate there."
    },
    {
        "company": "AAPL",
        "title": "Lowe’s to Acquire Artisan Design Group in $1.33 Billion Deal",
        "date": "2025-04-14",
        "summary": "The acquisition is expected to expand the retailer’s total addressable market by about $50 billion, Lowe’s said."
    },
    {
        "company": "AAPL",
        "title": "Give Students Learning Accommodations",
        "date": "2025-04-02",
        "summary": "504 plans are too often denied to those with disabilities."
    },
    {
        "company": "AAPL",
        "title": "Market Losses Wallop Pension Funds",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on American Express, home price growth and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "New Lawsuit Takes Aim at Trump’s ‘Liberation Day’ Tariffs",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "AI Agents Are a Moment of Truth for Tech",
        "date": "2025-03-29",
        "summary": "All emerging technology needs to deliver on its promise, sooner or later. For AI agents, that time is now."
    },
    {
        "company": "AAPL",
        "title": "Mark Klein, a Whistleblower Who Revealed Domestic Spying, Dies at 79",
        "date": "2025-04-11",
        "summary": "The AT&T technician predated Edward Snowden by seven years, but his allegations were never able to achieve traction."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Weighs New Bailout for U.S. Farmers",
        "date": "2025-04-05",
        "summary": "Bracing for trade fallout, agriculture groups are pressing for relief ahead of retaliatory tariffs on American exports."
    },
    {
        "company": "AAPL",
        "title": "Mike Johnson Loses Battle to Limit GOP Rebels’ Power",
        "date": "2025-04-02",
        "summary": "The House speaker failed to kill a proposal allowing proxy voting by House lawmakers who are new parents."
    },
    {
        "company": "AAPL",
        "title": "The Head of the EPA on the Future of the Agency",
        "date": "2025-04-09",
        "summary": "President Trump has a new vision for the Environmental Protection Agency "
    },
    {
        "company": "AAPL",
        "title": "EU Bets on Gigafactories to Catch Up With U.S., China in AI Race",
        "date": "2025-04-09",
        "summary": "The European Union said it would focus on building AI data and computing infrastructure and making it easier for companies to comply with regulation."
    },
    {
        "company": "AAPL",
        "title": "A New Global Trade Order Takes Shape",
        "date": "2025-04-03",
        "summary": "A.M. Edition for April 3. Markets around the world are reeling after yesterday’s unveiling of sweeping new U.S. tariffs. The Journal’s "
    },
    {
        "company": "AAPL",
        "title": "Inside the Law Firm That Decided to Fight Back Against Trump’s Attack",
        "date": "2025-03-28",
        "summary": "Perkins Coie’s biggest clients—including Amazon and Boeing—are staying despite an executive order that targeted the firm, which has Democratic ties."
    },
    {
        "company": "AAPL",
        "title": "Pharma Stocks Slide Further After Trump Reiterates Tariff Threats on Drugs",
        "date": "2025-04-09",
        "summary": "Drugmakers have said they’re still unclear about whether Trump will impose tariffs on finished products or on active pharmaceutical ingredients."
    },
    {
        "company": "AAPL",
        "title": "The Race to Save a Salamander Whose Image Spawned a Global Cottage Industry",
        "date": "2025-03-29",
        "summary": "From TikTok to McDonald’s Happy Meals, Mexico’s ancient axolotl is everywhere, except where it is supposed to be—in the wild."
    },
    {
        "company": "AAPL",
        "title": "Google Offers to Tweak Automotive Services, Maps Contracts to Appease German Regulator",
        "date": "2025-04-09",
        "summary": "The company said it would license the services contained in its Google Automotive Services business as separate stand-alone versions."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "AAPL",
        "title": "Tariff Upheaval Threatens Private Equity’s Exit Recovery Hopes",
        "date": "2025-04-14",
        "summary": "U.S. private-equity exits and their total value rose in the first quarter compared with a year ago, but recent market volatility puts that momentum at risk."
    },
    {
        "company": "AAPL",
        "title": "Agriculture Secretary Promises Aid for Farmers Caught in Trade War",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Billionaire Investor Bill Ackman Calls for 90-Day Pause on Tariffs",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Democrats Who Are Fighting—and Winning—Against Trump in Court",
        "date": "2025-03-31",
        "summary": "State attorneys general have brought 11 lawsuits against the president and his administration. In swing states, the strategy carries political risk."
    },
    {
        "company": "AAPL",
        "title": "Why Paul Weiss Struck a Deal With Trump",
        "date": "2025-03-28",
        "summary": "The executive order put the firm at risk of a catastrophic ‘partner run’ and a death spiral. "
    },
    {
        "company": "AAPL",
        "title": "‘American Oasis’: The Lure of the Desert",
        "date": "2025-04-08",
        "summary": "The Southwest has recently sent left-leaning senators to Washington. As more minorities move there, the region might shift to the right."
    },
    {
        "company": "AAPL",
        "title": "Trump Wanted an Apology. He Got Maine’s No-Nonsense Governor Instead.",
        "date": "2025-03-30",
        "summary": "The White House warns this “will not end well” for Democratic Gov. Janet Mills in an escalating fight over federal education funding."
    },
    {
        "company": "AAPL",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on oil futures, Bank of America, Shell and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "AAPL",
        "title": "A Final Four for Blue Bloods Only",
        "date": "2025-04-02",
        "summary": "The NCAA boxes out the Cinderella stories that made March Madness so much fun."
    },
    {
        "company": "AAPL",
        "title": "Voice of America Is Broken and Can’t Be Reformed",
        "date": "2025-03-31",
        "summary": "The U.S. international broadcaster is politically biased, confused and ineffective. Tear it down."
    },
    {
        "company": "AAPL",
        "title": "OpenAI’s Latest Funding Round Comes With a $20 Billion Catch",
        "date": "2025-03-28",
        "summary": "A stipulation of the funding round, led by SoftBank, is adding pressure to OpenAI’s efforts to convert to a for-profit company."
    },
    {
        "company": "AAPL",
        "title": "White House Mulls Relief for Farmers as Ag Groups Warn of Fallout From Tariff Push",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Maker of Safety Gloves Says It Will Raise Prices in U.S.",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Luxshare to Maintain Vietnam Production Hub to Support U.S. Market",
        "date": "2025-04-09",
        "summary": "Luxshare Precision Industry, a key assembler of the iPhone and other Apple products, said it will maintain large-scale production in Vietnam and continue exports from there to the U.S., responding to President Trump’s tariffs."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs Get a Legal Challenge",
        "date": "2025-04-04",
        "summary": "A Florida company says the President is violating the Supreme Court’s major questions doctrine. It’s a strong case."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Apollo CEO Marc Rowan: ‘We Needed To Reset Our Trade Policy’",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apollo CEO Marc Rowan: ‘We Needed To Reset Our Trade Policy’",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Bonds Sell Off as New U.S. Tariffs Upend Global Trade",
        "date": "2025-04-09",
        "summary": "A.M. Edition for April 9. As U.S. tariffs targeting nearly 100 nations "
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on HSBC, Standard Chartered and more in the latest Market Talks covering financial services."
    },
    {
        "company": "AAPL",
        "title": "What’s at Stake in Trump’s Alien Enemies Act Scheme",
        "date": "2025-04-01",
        "summary": "The president neglects a crucial legal component: due process."
    },
    {
        "company": "AAPL",
        "title": "Renault and Nissan Change Alliance Rules to Open Possibility of Further Share Sales ",
        "date": "2025-03-31",
        "summary": "The deal lowers the minimum required voting stake they must hold in each other to 10%, from 15%."
    },
    {
        "company": "AAPL",
        "title": "RBA Needs to Adjust to Rising Growth Threats",
        "date": "2025-04-03",
        "summary": "For some time now, it’s been evident that the Australian central bank should move beyond its outdated narrative about stubborn inflation and fully grasp the challenges ahead."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: Lululemon, General Motors, Deutsche Bank",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Accused Tech Spy Says Rival CEO Recruited Him With Offer to Be Like James Bond",
        "date": "2025-04-02",
        "summary": "An alleged spying plot in the payroll-services industry involves allegations by a former employee of Rippling that he was recruited to feed the company’s private information to a competitor, Deel."
    },
    {
        "company": "AAPL",
        "title": "Democrats Misunderstand the ‘Abundance’ Movement",
        "date": "2025-04-06",
        "summary": "Time to put away the bureaucrats-know-best mentality."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on Malaysia’s banking sector, DIF, U.S. home prices and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "AAPL",
        "title": "Venture Market Notches Strong Quarter—Thanks Mostly to One Mammoth AI Deal",
        "date": "2025-04-03",
        "summary": "Investors say competition for artificial intelligence startups is fierce, and OpenAI’s $40 billion fundraise proved it."
    },
    {
        "company": "AAPL",
        "title": "Break in Trade Storm Still Leaves Job for RBA",
        "date": "2025-04-10",
        "summary": "Australia’s central bank has the ammunition to respond and should use it, given that China and trading partners elsewhere in Asia are still in the crosshairs of Trump’s tariffs."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Loses Bid to Restart Deportation Flights",
        "date": "2025-03-27",
        "summary": "The decision leaves in place, for now, an order that the White House has strongly criticized as judicial overreach."
    },
    {
        "company": "AAPL",
        "title": "Two Court Rulings on Donald Trump’s Deportations",
        "date": "2025-04-08",
        "summary": "The Supreme Court lifts an order preventing swift removal of alleged gang members under the Alien Enemies Act of 1798. Yet the majority of the Justices take no position on the merits of using that law, while they also emphasize the requirement of due process. Meantime, an appeals court says the White House must seek the return of a man mistakenly sent to a prison in El Salvador."
    },
    {
        "company": "AAPL",
        "title": "China Retaliates With 34% Tariffs, as a Lawsuit Challenges Trump's Trade Wars",
        "date": "2025-04-04",
        "summary": "Donald Trump's big tariffs have now drawn a big response from Beijing, which says it will add 34% duties to U.S. goods, roiling the stock market again on Friday. But a new lawsuit argues that the president's purported \"emergency\" tariffs aren't authorized by law, while a handful of Senate Republicans, including Rand Paul, vote to countermand the U.S. trade war against Canada."
    },
    {
        "company": "AAPL",
        "title": "China Vows to Fight U.S. Tariffs ‘To The End’",
        "date": "2025-04-08",
        "summary": "A.M. Edition for April 8. Beijing "
    },
    {
        "company": "AAPL",
        "title": "The Trump-Saudi Relationship Behind LIV Golf",
        "date": "2025-04-04",
        "summary": "President Trump’s Florida golf course is hosting a tournament for the Saudi-backed tour this weekend."
    },
    {
        "company": "AAPL",
        "title": "Powerful Earthquakes Rock Myanmar, Thailand",
        "date": "2025-03-28",
        "summary": "A.M. Edition for Mar. 28. Rescuers search through rubble in Bangkok and streams of wounded seek treatment in Myanmar’s capital Naypyitaw following "
    },
    {
        "company": "AAPL",
        "title": "The Inside Story of Sam Altman’s Firing–and Rehiring–at OpenAI",
        "date": "2025-04-07",
        "summary": "WSJ reporter Keach Hagey gives us a behind-the-scenes look into one of the "
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Find insight on Novo Nordisk, product-specific tariffs, Pro Medicus and more in the latest Market Talks on Health Care."
    },
    {
        "company": "AAPL",
        "title": "The Academy’s ‘Appeasement’",
        "date": "2025-04-03",
        "summary": "Colleges aren’t simply humoring the president."
    },
    {
        "company": "AAPL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "AAPL",
        "title": "AI Tools Help Alzheimer’s Researchers Dig Into Data",
        "date": "2025-03-27",
        "summary": "The Oxford Drug Discovery Institute uses artificial intelligence-powered databases "
    },
    {
        "company": "AAPL",
        "title": "The Supreme Court's Big Cases on Racial Gerrymandering and Nondelegation",
        "date": "2025-03-26",
        "summary": "The Justices hear two legal disputes that could have lasting consequences. Can Congress lend its taxing power to the executive branch without putting hard limits on its use? That's the question in FCC v. Consumers’ Research. And in a case about Louisiana's redistricting maps, the Court has a chance to say that racial gerrymandering isn't required and isn't even permitted."
    },
    {
        "company": "AAPL",
        "title": "Hegseth’s Other Signal Chat / The Supreme Court’s Deportation Order",
        "date": "2025-04-22",
        "summary": "Defense Secretary Pete Hegseth faces more scrutiny, after an ouster of top aides and news reports about a second Signal chat group. But Donald Trump says he stands by Hegseth, amid rumors that the White House wants a replacement. Plus, the Supreme Court issues a midnight order halting deportations under the Alien Enemies Act, with a sharp dissent by Justice Samuel Alito.  "
    },
    {
        "company": "AAPL",
        "title": "The Supreme Court's Cases on Gender Storybooks and ObamaCare",
        "date": "2025-04-23",
        "summary": "When a public school adds stories with LGBT themes to its elementary reading curriculum, do religious parents have a First Amendment right to opt out? And did ObamaCare evade a constitutional check when it delegated power to the Preventive Services Task Force? The Supreme Court debates those points in Mahmoud v. Taylor and Kennedy v. Braidwood Management."
    },
    {
        "company": "AAPL",
        "title": "A New Dawn for Private Funds",
        "date": "2025-04-03",
        "summary": "Private funds are at a pivotal moment, with shifting dynamics in fundraising, deal activity and investor behavior reshaping the landscape. Philippa Leighton-Jones is joined by Kevin Kuryla, Global Head of Private Funds Group at UBS and Jerry Pascucci, Co-Head of Unified Global Alternatives at UBS to unpack the trends behind this transformation. From fluctuating interest rates and geopolitical uncertainty to the rise of private wealth capital in fundraising and continuation vehicles as a popular exit strategy, this episode examines how private funds are adapting to a new reality—and what it means for investors and sponsors alike. "
    }
]