[
    {
        "company": "AAPL",
        "title": "Apple’s Margins Are Still a Big Risk in Trade War Roller Coaster: Heard on the Street",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With Nothing But Hard Choices—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "AAPL",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Exported More Than $17 Billion of iPhones From India Last Year",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Built iPhone Inventory Ahead of Tariff War, Data Show",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "AAPL",
        "title": "Apple Sales Surged Saturday Due to Tariff-Related Price Hike Fears",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Tesla Profit Slumps",
        "date": "2025-04-22",
        "summary": "Plus: Meta could see a $7 billion pullback from Chinese advertisers over tariffs, research firm says. And Verizon says it won’t cover any handset price increases due to tariffs. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "France Fines Apple $162 Million, Risking Trump’s Ire",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple, Meta Fined by EU, Ordered to Comply With Tech Competition Rules",
        "date": "2025-04-23",
        "summary": "The move risks ratcheting up tensions with the Trump administration as EU officials pursue trade talks."
    },
    {
        "company": "AAPL",
        "title": "Apple Fined $162 Million in France Over App Tracking Transparency ",
        "date": "2025-03-31",
        "summary": "France’s competition regulator fined Apple over concerns the company abused its dominant position in mobile apps through its iPhone and iPad’s operating system."
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Loses Ground in China’s Smartphone Market as Local Rivals Gain",
        "date": "2025-04-18",
        "summary": "Apple lost its top spot in China’s smartphone market, dethroned by local rival Xiaomi as Beijing’s consumption-boosting subsidies help buoy demand for cheaper products."
    },
    {
        "company": "AAPL",
        "title": "What Apple Has at Stake in China",
        "date": "2025-04-12",
        "summary": "The iPhone-maker just received some reprieve from tariffs, but is still heavily reliant on the Chinese manufacturing economy it helped build."
    },
    {
        "company": "AAPL",
        "title": "SAP Posts Higher Revenue, Operating Profit",
        "date": "2025-04-22",
        "summary": "Sales from the business-software company’s core cloud business rose to 4.99 billion euros from 3.93 billion euros while total revenue rose to 9.01 billion euros compared with 8.04 billion euros in the prior-year period."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Warren Buffett Timed His Apple Stock Sale to Perfection. What’s Next?",
        "date": "2025-04-22",
        "summary": "Berkshire Hathaway’s huge cash pile has investors wondering what he will buy and when."
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": "Levies on Chinese goods have created worst three-day rout for iPhone maker in about 25 years."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "SAP Shares Jump After Earnings Beat Forecasts Despite Tariff Uncertainty",
        "date": "2025-04-23",
        "summary": "Shares surged after the business-software group posted operating profit that beat analysts’ expectations and backed its full-year guidance, reassuring investors."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Nokia Flags Earnings Hit From Tariffs",
        "date": "2025-04-24",
        "summary": "The company expects to take an earnings hit in the second quarter from tariffs and said that reaching the high end of its guidance range for the year now looked more challenging."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Apple Stock Needs a Trump Discount: Heard on the Street",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": "This is what Apple pays for components inside its bestselling phone, and how Trump’s China tariffs could raise the bill."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tesla Profit Sinks, Hurt by Backlash Over Elon Musk’s Political Role",
        "date": "2025-04-22",
        "summary": "The chief executive says he will spend significantly less time on DOGE starting in May. First-quarter net income falls 71%."
    },
    {
        "company": "AAPL",
        "title": "STMicroelectronics Expects Lower Sales, but Signals Recovery Is Coming",
        "date": "2025-04-24",
        "summary": "The company projected lower sales as weak demand for some semiconductors used in cars and industrial equipment continued to plague an industry that now faces heightened uncertainty from unpredictable tariff policies."
    },
    {
        "company": "AAPL",
        "title": "Comcast Loses Broadband Customers, Takes Theme-Park Hit From L.A. Fires",
        "date": "2025-04-25",
        "summary": "​The company posted lower quarterly earnings, but found bright spots with its mobile-phone plans and Peacock streaming service."
    },
    {
        "company": "AAPL",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Meta Could Be Facing $7 Billion in Lost Revenue From China",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "AT&T Adds More Subscribers, Sees Tariffs Spurring Phone Upgrades",
        "date": "2025-04-23",
        "summary": "The telecom company said that tariffs triggered an acceleration in consumers upgrading their mobile phones."
    },
    {
        "company": "AAPL",
        "title": "Renault Revenue Drops; Backs Full-Year Guidance",
        "date": "2025-04-24",
        "summary": "Renault posted a drop in revenue for both its car division and the overall group despite an uptick in sales, and backed its full-year guidance."
    },
    {
        "company": "AAPL",
        "title": "To Navigate Trump’s Tariffs, Apple and Nintendo Take Different Paths",
        "date": "2025-04-15",
        "summary": "Apple CEO "
    },
    {
        "company": "AAPL",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tesla, Boeing Earnings; Home Sales: What to Watch This Week",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "AAPL",
        "title": "Huawei Posts Profit Drop But Revenue Signals Solid Comeback",
        "date": "2025-03-31",
        "summary": "The Chinese technology giant’s net profit fell in 2024 as higher expenses weighed, but solid revenue growth signals that the company is making a comeback after years of heavy U.S. sanctions that have affected its businesses."
    },
    {
        "company": "AAPL",
        "title": "Tesla’s Net Income Sinks 71% in First Quarter",
        "date": "2025-04-22",
        "summary": "Plus: stocks rally on optimism from White House on tariff negotiations. And Verizon says it won’t pay for the costs of tariffs on smartphones, but shoppers will. Anthony Bansie hosts. "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Intel Cuts Outlook, Says Layoffs Are in Store",
        "date": "2025-04-24",
        "summary": "The American chip-making giant’s stock fell after it said an overhaul is under way and that macro conditions would prove challenging."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "IBM Set to Benefit From Focus on AI, Automation as Clients Seek Efficiency in Uncertain Economy, CFO Says",
        "date": "2025-04-23",
        "summary": "For the second-quarter, IBM guided for sales between $16.4 billion and $16.75 billion, ahead of the $16.31 billion expected by analysts."
    },
    {
        "company": "AAPL",
        "title": "Shares of Apple Suppliers in Asia Regain Ground",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "How Many Trillions Do Americans Spend Complying With Federal Rules?",
        "date": "2025-04-24",
        "summary": "The regulatory tax rivals the income tax."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Hasbro Beats Estimates as Profitability Improves",
        "date": "2025-04-24",
        "summary": "The toymaker said the global tariff war hadn’t impacted first-quarter results, adding that the company wouldn’t touch the guidance it gave in February given the level of uncertainty in the trade environment."
    },
    {
        "company": "AAPL",
        "title": "Tesla, Boeing and Alphabet Earnings: What to Watch for This Week",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Accor Shares Rise After Sales Grow on Sustained Demand",
        "date": "2025-04-25",
        "summary": "Shares jumped after the hotel company reported an increase in revenue for the on sustained demand, beating analysts’ views."
    },
    {
        "company": "AAPL",
        "title": "Merck Cuts 2025 Outlook on Tariffs, Charges",
        "date": "2025-04-24",
        "summary": "Merck’s first-quarter net income increased as sales of its Keytruda cancer drug rose, but the Big Pharma company cut its 2025 adjusted earnings projection, partly to account for recently imposed tariffs."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-07",
        "summary": "Customers said they aren’t waiting to see if iPhone costs increase."
    },
    {
        "company": "AAPL",
        "title": "WPP CEO Sees Client Unease Amid Tariff Uncertainty, But No Spending Cuts",
        "date": "2025-04-25",
        "summary": "EXCLUSIVE: “The bigger question is what happens longer term, how this impacts the economy. I don’t think we’ll see that in the U.S. until May,” the head of the advertising company said in an interview."
    },
    {
        "company": "AAPL",
        "title": "Intel Sees ‘Probability of a Recession’ From Tariffs",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "Nestle Sales Get Boost From Coffee, Chocolate Price Hikes",
        "date": "2025-04-24",
        "summary": "Nestle posted higher sales that beat analysts’ expectations, with broad-based growth across all markets and categories."
    },
    {
        "company": "AAPL",
        "title": "The Score: UnitedHealth, Netflix, Eli Lilly and More Stocks That Defined the Week",
        "date": "2025-04-18",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news"
    },
    {
        "company": "AAPL",
        "title": "Netflix, Unscathed by Tariffs, Posts Record Profit",
        "date": "2025-04-17",
        "summary": "The streamer forecasts stronger revenue growth in the second quarter."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "AAPL",
        "title": "Netflix, Unscathed by Tariffs, Posts Record Profit",
        "date": "2025-04-17",
        "summary": "The streamer forecasts stronger revenue growth in the second quarter."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "AAPL",
        "title": "Boeing Earnings; PMI Surveys; Home Sales: What to Watch Wednesday Onward This Week",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "LG Electronics Posts Earnings Beat, Plans to Relocate Some Production to U.S.",
        "date": "2025-04-24",
        "summary": "The South Korean consumer-electronics giant reiterated plans to relocate some production to the U.S. in response to President Trump’s recent tariff action."
    },
    {
        "company": "AAPL",
        "title": "Adidas Posts Better-Than-Expected Results Despite Tariff Threat",
        "date": "2025-04-23",
        "summary": "Operating profit rose to €610 million from €336 million previously, the German sporting-goods company said."
    },
    {
        "company": "AAPL",
        "title": "Apple-Linked Tech Stocks Are Hard-Hit in Asia",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "AAPL",
        "title": "Sanofi Sales, Profit Beat Expectations on Higher Demand for Skin, Asthma Drug",
        "date": "2025-04-24",
        "summary": "The pharmaceutical company said the profit was driven by a higher gross margin and slower operating expense growth."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Relief Rally, Day Three",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "AAPL",
        "title": "American Airlines Pulls Full-Year Outlook on Concerns Over Travel Demand",
        "date": "2025-04-24",
        "summary": "American Chief Executive Robert Isom says he is confident the airline can withstand uncertainty in the economy."
    },
    {
        "company": "AAPL",
        "title": "Some iPhone Users Upgrade, Fearing Tariff-Induced Price Hike",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "Verizon Earnings Top Views; Reports Wider Post-Paid Phones Losses",
        "date": "2025-04-22",
        "summary": "Verizon Communications reported a rise in first-quarter earnings but postpaid phone losses increased. Verizon said it is still on course to meet its yearly goals."
    },
    {
        "company": "AAPL",
        "title": "The Ripple Effect Trump’s Tariffs Will Have on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "It isn’t just inflation. Manufacturing and artificial intelligence are at risk, too."
    },
    {
        "company": "AAPL",
        "title": "Procter & Gamble Cuts Fiscal-Year Guidance",
        "date": "2025-04-24",
        "summary": "Procter & Gamble lowered its fiscal-year outlook after posting lower sales in the third quarter amid a challenging consumer environment."
    },
    {
        "company": "AAPL",
        "title": "SK Hynix Posts Strong First Quarter Earnings on AI Chip Demand",
        "date": "2025-04-23",
        "summary": "The South Korean memory chip maker posted stronger-than-expected earnings for the first quarter on brisk demand for artificial-intelligence chips amid uncertainty about sweeping U.S. tariffs."
    },
    {
        "company": "AAPL",
        "title": "Gucci Owner Kering Logs Weak Sales as Slowdown in Luxury Spending Persists",
        "date": "2025-04-23",
        "summary": "After years of strong results fueled by a rise in demand for luxury goods after the pandemic, customers dialed back on spending amid inflation and high interest rates."
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "India Saw a Surge in Smartphone Exports Ahead of Tariffs",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Russia Attacks Kyiv, Killing Nine",
        "date": "2025-04-24",
        "summary": "Plus, Tesla’s sales in Europe fall for a third consecutive month. And President Trump rejects a tax hike on millionaires. Kate Bullivant hosts."
    },
    {
        "company": "AAPL",
        "title": "Marketers Are ‘Scenario Planning’ in an Uncertain Economy, Ad Giant IPG Says",
        "date": "2025-04-24",
        "summary": "Interpublic Group reiterated its 2025 organic revenue guidance and tried to assure analysts that it’s capable of handling any potential downturn."
    },
    {
        "company": "AAPL",
        "title": "Safran Posts Revenue Beat, Lifted by Civil Aftermarket Services",
        "date": "2025-04-25",
        "summary": "The aerospace-industry supplier’s adjusted revenue rose 17% in reported terms and 14% organically."
    },
    {
        "company": "AAPL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "EU Delayed Punishing Apple, Meta Just Before Trade Talks Started",
        "date": "2025-04-18",
        "summary": "The bloc postponed penalties, temporarily avoiding a conflict with the Trump administration during a week in which it ramped up its push for a trade deal with the U.S."
    },
    {
        "company": "AAPL",
        "title": "Visa Offers Apple Roughly $100 Million to Take Over Credit Card From Mastercard",
        "date": "2025-04-01",
        "summary": "Visa, Amex and Mastercard are all competing to be the network for the tech giant’s credit card."
    },
    {
        "company": "AAPL",
        "title": "Pepsi and Mountain Dew Depend on Imports. PepsiCo Says Tariffs Will Hurt Earnings.",
        "date": "2025-04-24",
        "summary": "The maker of Doritos and Cheetos also cited a drop in consumer confidence caused by inflation and the global trade war."
    },
    {
        "company": "AAPL",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "PepsiCo Says Tariff Costs Will Contribute to Earnings Decline this Year",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "AAPL",
        "title": "Russia Launches Major Assault on Kyiv",
        "date": "2025-04-24",
        "summary": "A.M. Edition for April 24. Moscow has "
    },
    {
        "company": "AAPL",
        "title": "Traders Wager on a Rocky Earnings Season",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Roche Sales Gain on Boost From Key Drugs Amid U.S. Production Push",
        "date": "2025-04-24",
        "summary": "Roche posted higher-than-expected first-quarter sales, driven by robust demand for its key drugs, as the company takes active steps to preempt looming U.S. import tariffs."
    },
    {
        "company": "AAPL",
        "title": "GE Aerospace Profit Climbs on Gains in Commercial Services, Defense",
        "date": "2025-04-22",
        "summary": "The maker of jet engines reported higher earnings for the first quarter on revenue gains from its defense businesses and commercial engines and services unit."
    },
    {
        "company": "AAPL",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "AAPL",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about Merck, EssilorLuxottica, Wuxi Biologics and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "AAPL",
        "title": "Tesla Stock Jumps After Musk Says He Will Spend Less Time on DOGE",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Merck, Sanofi and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "AAPL",
        "title": "BYD First-Quarter Profit Doubled on Strong EV Sales",
        "date": "2025-04-25",
        "summary": "Chinese auto giant BYD continued to outpace Tesla in the first quarter, reporting a doubling in net profit on robust growth in its electric-vehicle business."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "AAPL",
        "title": "Stocks Rally on New Hopes of Tariffs Easing",
        "date": "2025-04-22",
        "summary": "The Dow industrials surged more than 1,000 points after Monday’s selloff."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Tesla, BYD, Volvo, and more in the latest Market Talks covering the auto and transport sector."
    },
    {
        "company": "AAPL",
        "title": "Britain Taxes Away Its Rich",
        "date": "2025-04-23",
        "summary": "Falling revenue shows the folly of raising rates on the mobile wealthy."
    },
    {
        "company": "AAPL",
        "title": "How Live Nation Became the Most Powerful Company in the Concert Business",
        "date": "2025-04-24",
        "summary": "Live Nation's “flywheel” business model fueled its rise to become the most powerful company in live music. But that strategy could become its downfall after the Department of Justice sued the company over its dominance."
    },
    {
        "company": "AAPL",
        "title": "The Lessons of Trump’s Tariff Exemptions",
        "date": "2025-04-13",
        "summary": "It’s good to be Apple’s Tim Cook but not to be a small manufacturer that can’t afford a K Street lobbyist."
    },
    {
        "company": "AAPL",
        "title": "Hyundai Profit Steady but Tariff Hit Looms",
        "date": "2025-04-24",
        "summary": "South Korea’s largest carmaker reported steady profit despite headwinds from overall sluggish electric-vehicle demand, but President Trump’s new sweeping tariffs threaten to put a brake on growth."
    },
    {
        "company": "AAPL",
        "title": "Tesla Has a Deep Hole to Pull Out Of",
        "date": "2025-04-23",
        "summary": "Elon Musk promises more attention on the EV maker, but brand damage from his political activities won’t be easy to repair."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Tariff Wipeout",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Home Sales in March Post Biggest Drop Since 2022 ",
        "date": "2025-04-24",
        "summary": "Plus: Pepsi no longer projects growth this year because of tariffs. And President Trump rebukes Vladimir Putin after Russian strikes on Kyiv. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "ServiceNow Bumps Up Annual Guidance as Government Business Grows",
        "date": "2025-04-23",
        "summary": "Chief Executive Bill McDermott said the platform is operating in a best-case-scenario environment as companies look to optimize their supply chains amid recent tariff announcements and federal clients aim to boost efficiency amid government spending cuts."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Markets Tumble as Donald Trump’s Tariff ‘Liberation Day’ Finally Arrives",
        "date": "2025-04-03",
        "summary": "Donald Trump delivers on his promise of sweeping tariffs, causing markets to plunge in response. The White House says the long-term gain will be worth the short-term pain, but how will the American consumer and the world at large be affected?  "
    },
    {
        "company": "AAPL",
        "title": "Reckitt Says Market Conditions Might Delay Home-Care Exit",
        "date": "2025-04-23",
        "summary": "The consumer-goods company’s plan to exit a portfolio of household brands could be delayed on market volatility, the latest sign of the aftershock effects of U.S. tariff plans."
    },
    {
        "company": "AAPL",
        "title": "India Has a Golden Opportunity to Capture U.S. Business From China",
        "date": "2025-04-19",
        "summary": "The world’s most populous nation has long trailed not just China but also smaller countries with nimbler governments."
    },
    {
        "company": "AAPL",
        "title": "Boeing Leans on Backlog, Looks for Alternatives to China Trade",
        "date": "2025-04-23",
        "summary": "The airplane maker reported a narrower first-quarter loss as CEO Kelly Ortberg said the company’s higher backlog has provided some flexibility amid the trade war."
    },
    {
        "company": "AAPL",
        "title": "Danone Sticks to Guidance After Sales, Volumes Growth",
        "date": "2025-04-23",
        "summary": "The company behind Activia yogurt and Evian water expects like-for-like sales growth of between 3% and 5% for the whole year."
    },
    {
        "company": "AAPL",
        "title": "China Bets Trump Will Cave on Tariffs",
        "date": "2025-04-24",
        "summary": "P.M. Edition for April 24. Chinese officials call for full repeal of levies and dismiss suggestions that trade talks with Washington have begun. WSJ Asia economic reporter Jason Douglas says President Trump’s apparent softening on tariffs against China strengthens "
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-13",
        "summary": "The CEO managed to help the iPhone avoid another U.S. battle with China."
    },
    {
        "company": "AAPL",
        "title": "Whirlpool Sales Slide as Tariff Fears Hit Results",
        "date": "2025-04-24",
        "summary": "Whirlpool sales dropped in the latest quarter, with business taking a hit as tariffs prompted Asia-based appliance manufacturers to ramp up shipments into the U.S. and put a chill on its business in Canada and Europe."
    },
    {
        "company": "AAPL",
        "title": "U.S. Could Pause Ukraine Talks If Progress Isn’t Made Soon",
        "date": "2025-04-18",
        "summary": "A.M. Edition for April 18. Secretary of State Marco Rubio says Washington has presented Kyiv and Moscow with a framework deal to end their war, but that "
    },
    {
        "company": "AAPL",
        "title": "By the Numbers: How Bad Was This Week in the Stock Market?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Samsung Guides for Softer First-Quarter Profit But Still Beats Consensus",
        "date": "2025-04-08",
        "summary": "Samsung Electronics guided for softer first-quarter operating profit amid few signs of an immediate recovery in its flagship semiconductor business."
    },
    {
        "company": "AAPL",
        "title": "China Vows to Retaliate After Trump’s Latest Tariff Threat",
        "date": "2025-04-08",
        "summary": "Plus, Apple is planning to send more iPhones to the U.S. from India to offset the high cost of China tariffs. And global equities are regaining ground after yesterday’s market whiplash. Kate Bullivant hosts."
    },
    {
        "company": "AAPL",
        "title": "Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": "WSJ Heard on the Street columnist Dan Gallagher breaks down why Tesla stock is on the rise even after the electric car company posted a 71% drop in net income during its most recent quarter. "
    },
    {
        "company": "AAPL",
        "title": "Watch: Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tesla’s EU Sales Slump Again ",
        "date": "2025-04-24",
        "summary": "Sales plunged for the third consecutive month, a setback for Elon Musk’s EV maker even as demand for battery-electric vehicles grew in the bloc."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on CarMax, Tesla and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Tuesday Recap: Another Wild Swing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "From Ken Griffin to Robinhood: The Donors Who Funded Trump’s Inauguration Revealed",
        "date": "2025-04-18",
        "summary": "President Trump’s inaugural committee raised almost $250 million from Corporate America, more than doubling the previous record."
    },
    {
        "company": "AAPL",
        "title": "Abbott Labs Bracing for Tariffs as Profits Rise",
        "date": "2025-04-16",
        "summary": "Abbott Labs boosted its earnings in the first quarter and hinted that its full-year guidance might have gotten a lift were it not for looming cost hikes from the recent tariff war."
    },
    {
        "company": "AAPL",
        "title": "3M Keeps Guidance but Adds Tariff Hazards",
        "date": "2025-04-22",
        "summary": "The company says Trump’s tariff campaign could knock down adjusted earnings per share by 20 cents to 40 cents this year."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TSMC Maintains Solid 2025 Outlook Despite Tariff Worries",
        "date": "2025-04-17",
        "summary": "The world’s largest contract chip maker remains confident that it can post solid sales growth this year."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Read about  Tesla, U.S. machinery companies,  airlines,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Amazon Is Better Prepared for the Trade War Than Investors Think",
        "date": "2025-04-18",
        "summary": "The company’s size and global reach give it muscles to flex even in a sour economy."
    },
    {
        "company": "AAPL",
        "title": "An American-Made iPhone: Just Expensive or Completely Impossible?",
        "date": "2025-04-09",
        "summary": "Trump’s tariffs aim to bring manufacturing back to the U.S. So what—besides magic—would it take to make iPhones here?"
    },
    {
        "company": "AAPL",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Says It Intends to Export From Vietnam Even With Tariffs",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Why We Don’t Have a Made-in-America iPhone",
        "date": "2025-04-08",
        "summary": "President Trump’s tariffs aim to bring manufacturing back to the U.S.—including iPhones. WSJ’s Joanna Stern breaks down exactly how tough it would be to build iPhones here, and how tariffs could affect the price of your next phone."
    },
    {
        "company": "AAPL",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tariff Uncertainty Clobbers Earnings Optimism",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Luxury Empire LVMH Posts Revenue Below Views Amid Global Trade War Threat",
        "date": "2025-04-14",
        "summary": "French luxury behemoth LVMH said it booked revenue of €20.31 billion for the first three months of the year, 3% lower organically than in the prior-year period."
    },
    {
        "company": "AAPL",
        "title": "IMF Warns Tariffs Will Slow Global Economic Growth and Hit U.S. Economy",
        "date": "2025-04-22",
        "summary": "Plus, Gold surges to $3500 in intraday trading. And defense stocks fall after some of the biggest industry names report their earnings. Anthony Bansie hosts. "
    },
    {
        "company": "AAPL",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Here’s One Estimate for How Much Revenue the U.S. Government Will Raise With Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Rent the Runway, Xiaomi , Telecom Italia, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "AAPL",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "AAPL",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "LG Electronics Expects Lower Quarterly Operating Profit",
        "date": "2025-04-07",
        "summary": "The South Korean consumer-electronics giant forecast a 5.7% drop in first-quarter operating profit, though it sustained steady revenue growth."
    },
    {
        "company": "AAPL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "AAPL",
        "title": "Publicis Confirms Outlook After Organic Growth Beats Expectations",
        "date": "2025-04-15",
        "summary": "The advertising and marketing-services group confirmed its outlook for the year after first-quarter organic growth beat expectations, saying new business wins can make up for potential cuts to client spending due to tariff uncertainty."
    },
    {
        "company": "AAPL",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "AAPL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "AAPL",
        "title": "India Made a Big Push for Smartphone Exports. Now What?",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "AAPL",
        "title": "Levi Strauss Posts Revenue Growth, Backs Guidance Amid ‘Uncertain Environment’",
        "date": "2025-04-07",
        "summary": "Levi Strauss said fiscal first-quarter revenue rose, boosted by the U.S. market, and kept its outlook for the year unchanged but excluded the impact of higher tariffs from its guidance."
    },
    {
        "company": "AAPL",
        "title": "The Businesses Adding an Extra Charge With Trump’s Name On It",
        "date": "2025-04-18",
        "summary": "P.M. Edition for April 18. Some U.S. businesses are tacking an extra fee onto customer orders—and attributing them specifically to the man in the Oval Office. WSJ business reporter "
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Fall Sharply as Global Economic Outlook Remains Uncertain",
        "date": "2025-04-10",
        "summary": "P.M. Edition for April 10. Yesterday’s market rally gave way to "
    },
    {
        "company": "AAPL",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Even Disney Is Exposed to Tariffs",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Luxshare to Maintain Vietnam Production Hub to Support U.S. Market",
        "date": "2025-04-09",
        "summary": "Luxshare Precision Industry, a key assembler of the iPhone and other Apple products, said it will maintain large-scale production in Vietnam and continue exports from there to the U.S., responding to President Trump’s tariffs."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Investigating Pharmaceutical and Semiconductor Tariffs",
        "date": "2025-04-15",
        "summary": "Plus, South Korea says it’s preparing roughly $23 billion in government support for the chip sector amid tariff uncertainty. And Netflix aims for a $1trillion market capitalization. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Electronics Exemption Trims U.S. Tariff Rate",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
        "date": "2025-04-14",
        "summary": "The chip maker’s plan to build AI tech in Texas comes on the heels of a new tariff threat."
    },
    {
        "company": "AAPL",
        "title": "Brunello Cucinelli Reports Revenue Growth, Confirms Guidance",
        "date": "2025-04-16",
        "summary": "The Italian luxury-fashion firm said its results were in line with expectations, and that revenue continued on a solid upward trend in the first half of April."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Bang & Olufsen to Increase Prices in Response to Tariffs",
        "date": "2025-04-09",
        "summary": "The Danish consumer-electronics company implemented modest price increases on selected products in January, but further price increases will be made by May 1 partly due to the recent tariffs."
    },
    {
        "company": "AAPL",
        "title": "Deliveroo Revenue Rises on Strong Growth, Backs Guidance",
        "date": "2025-04-17",
        "summary": "The food delivery company reported higher revenue for the first quarter, boosted by robust gross transaction value growth in key markets."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on Tesla, BlackBerry and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Now Streaming on Netflix: A Show Where Profits Trump the Trade War",
        "date": "2025-04-18",
        "summary": "The streaming giant sticks by its full-year forecast in a rare show of resilience in a tumultuous market."
    },
    {
        "company": "AAPL",
        "title": "Amazon Rallies as Investors See More Resilience",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Ericsson Posts Rise in North American Spending Ahead of Tariffs",
        "date": "2025-04-15",
        "summary": "The network business reported a 6% rise in sales, with strong growth in North America as customers moved forward investments ahead of planned U.S. tariffs."
    },
    {
        "company": "AAPL",
        "title": "Spotify, Netflix Prove Bright Spots Within Broader Market Selloff",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Canada’s auto industry, Delta, Mercedes-Benz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "AAPL",
        "title": "Meta’s Ad Business Relies a Lot on China. Tariffs Could Hurt It, Warns Analyst.",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Nike Stock Drop Erases $12 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "AAPL",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "AAPL",
        "title": "Dollar Tree Attracts More Shoppers As Recession Fears Loom",
        "date": "2025-03-26",
        "summary": "Dollar Tree said more customers across incomes shopped at its stores in the latest quarter, a sign that concerns about the economy are giving the discount retailer a boost."
    },
    {
        "company": "AAPL",
        "title": "Citigroup Reports Jump in Profit, Revenue",
        "date": "2025-04-15",
        "summary": "Citigroup reported a jump in profit and revenue in the first quarter of 2025 that beat analysts’ expectations, thanks in part to market volatility that generated higher fees for its trading business."
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariff Announcement Drives Steepest Decline in U.S. Markets Since 2020",
        "date": "2025-04-03",
        "summary": "The stock market plunged as investors grappled with the threat that Trump’s new import tax plan will set off global retaliation and hurt economic growth. Plus, big tech companies lose hundreds of billions of dollars in value, while regulated utilities got a boost from the recession trade. Danny Lewis hosts."
    },
    {
        "company": "AAPL",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heineken Tops Revenue View, Reaffirms Outlook Amid Tariff Concerns",
        "date": "2025-04-16",
        "summary": "The Dutch brewer backed its full-year guidance after quarterly performance beat market expectations, but warned that the consumer and geopolitical backdrop remains volatile."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Scrambles to Finalize ‘Liberation Day’ Tariff Plans",
        "date": "2025-03-31",
        "summary": "Plus, President Trump expresses anger at Russia’s Vladimir Putin with little progress made on Ukraine ceasefire talks. And Apple and Elon Musk’s SpaceX are feuding over satellite service as they race to eliminate cellphone dead spots. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-31",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Uniqlo Owner Boosts Earnings Forecast",
        "date": "2025-04-10",
        "summary": "Fast Retailing boosted its annual earnings forecast despite tariff uncertainties, expecting another year of record profit as revenue continued to grow across regions."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs Could Blow Up Big Pharma’s Tax Shelter",
        "date": "2025-04-02",
        "summary": "Major pharmaceutical companies reap most of their profits in the U.S. but shift their tax burdens to low-tax havens such as Ireland."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "Video: What Tariffs Will Do to Your iPhone",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Netflix and Spotify Are Resilient, but Not Recession-Proof",
        "date": "2025-04-15",
        "summary": "Streaming giants are better positioned than rivals for a recession, but pricey stocks also depend on growth from new ventures."
    },
    {
        "company": "AAPL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "AAPL",
        "title": "Powell, Global Rate Moves, Retail Sales: What to Watch This Week in Markets",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Looks at Tariff Pause for Some Autos",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "L’Oreal Sales Rise as Europe Growth Offsets U.S. Weakness",
        "date": "2025-04-17",
        "summary": "L’Oréal Chief Executive Nicolas Hieronimus told analysts the beauty market is now more likely to grow this year at the lower end of the 4% to 4.5% range he predicted in February."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Exceptional Tariff Weekend",
        "date": "2025-04-13",
        "summary": "His Customs office announced tariff-rate exceptions on electronics on Friday that he renounced on Sunday. "
    },
    {
        "company": "AAPL",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "ABB Posts Increase in Earnings, Plans Robotics Business Spinoff",
        "date": "2025-04-17",
        "summary": "First-quarter net profit rose above analysts’ expectations to $1.10 billion at ABB, which intends to spin off its robotics division through a share distribution."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Fall, Wiping Out More Than $3 Trillion in Market Value",
        "date": "2025-04-03",
        "summary": "P.M. Edition for April 3. U.S. markets experience their s"
    },
    {
        "company": "AAPL",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "AAPL",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "AAPL",
        "title": "Semiconductor Sector Under Pressure After China Counters in Trump’s Tariff War",
        "date": "2025-04-04",
        "summary": "Shares of Nvidia and other semiconductor companies slid amid a flurry of tariffs between the U.S. and Asian countries that could subdue electronics demand and hinder Big Tech’s artificial-intelligence infrastructure buildout."
    },
    {
        "company": "AAPL",
        "title": "Silicon Valley CEO Says U.S. Tech Dominance in Peril Because of Tariffs",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "AAPL",
        "title": "Omnicom Gives More Cautious 2025 Outlook As Tariffs Create Uncertainty about Ad Spending ",
        "date": "2025-04-15",
        "summary": "Advertising giant hasn’t seen any specific instances of marketer clients pulling back thus far, executives say."
    },
    {
        "company": "AAPL",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "AAPL",
        "title": "How Nintendo Is Navigating Tariff Chaos With Secret Shipments and New Factories",
        "date": "2025-04-11",
        "summary": "Preorders for its much-anticipated Switch 2 will happen soon, but later than originally promised"
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "Morgan Stanley’s Profit Surged on Trading Revenue",
        "date": "2025-04-11",
        "summary": "The bank’s profit increased to $4.32 billion in the first three months of the year, or $2.60 per share, surpassing the $2.18 per share analysts expected."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Morgan Stanley’s Profit Surged on Trading Revenue",
        "date": "2025-04-11",
        "summary": "The bank’s profit increased to $4.32 billion in the first three months of the year, or $2.60 per share, surpassing the $2.18 per share analysts expected."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Chip Stocks Pressured as Tariff Rout Intensifies",
        "date": "2025-04-07",
        "summary": "Global semiconductor stocks opened sharply lower, extending losses from last week as investors digest the extent of U.S. tariffs on chip-making hubs such as Taiwan."
    },
    {
        "company": "AAPL",
        "title": "J&J Boosts Outlook Despite Incoming Tariff Costs",
        "date": "2025-04-15",
        "summary": "New tariffs, primarily on medical technology products, are projected to add $400 million in costs this year, Chief Financial Officer Joseph Wolk said."
    },
    {
        "company": "AAPL",
        "title": "Sainsbury’s Profit Beat Market Views",
        "date": "2025-04-17",
        "summary": "Sainsbury’s beat profit expectations for the full fiscal year, as the company focuses on supporting sales volumes by lowering prices."
    },
    {
        "company": "AAPL",
        "title": "ASML Warns on Tariff Uncertainty, Logs Weak Orders",
        "date": "2025-04-16",
        "summary": "Orders for the Dutch company’s semiconductor-making equipment came in below forecasts."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs Wipe Out Over $6 Trillion on Wall Street in Epic Two-Day Rout",
        "date": "2025-04-04",
        "summary": "The selloff capped the worst week since 2020, as fears of a recession mount"
    },
    {
        "company": "AAPL",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "AAPL",
        "title": "Trade Wars Can Discourage Domestic Production",
        "date": "2025-04-14",
        "summary": "Companies that sell products internationally may find it advantageous to avoid tariffs by building factories closer to their customers."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Tuesday Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "7-Eleven Owner Targets Profit Growth Despite Tariff Uncertainty",
        "date": "2025-04-09",
        "summary": "Seven & i Holding projected a rise in annual profit despite the uncertainty caused by U.S. tariffs, continuing efforts to stave off a takeover attempt by the Canadian owner of Circle K"
    },
    {
        "company": "AAPL",
        "title": "Retail Sales Likely Rose in March, With Shoppers Trying to Get Ahead of Tariffs",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "AAPL",
        "title": "Dow Drops More Than 500 Points",
        "date": "2025-04-17",
        "summary": "Trump renews attack on Federal Reserve Chair Jerome Powell. Plus, Netflix posts higher-than expected earnings. Eli Lilly stock surges after GLP-1 pill succeeds in a pivotal trial. Ariana Aspuru hosts. "
    },
    {
        "company": "AAPL",
        "title": "Moncler Beats Views but Signals Unstable Macroeconomic Environment",
        "date": "2025-04-16",
        "summary": "Moncler’s update comes days after luxury bellwether LVMH reported lackluster results for the start of the year, setting a negative tone for the reporting season."
    },
    {
        "company": "AAPL",
        "title": "Hermes to Raise Prices in the U.S. to Mitigate Tariff Hit",
        "date": "2025-04-17",
        "summary": "Hermes reported higher revenue for the first quarter, but growth slowed amid an uncertain environment for the industry due to waning demand and the threat of U.S. tariffs."
    },
    {
        "company": "AAPL",
        "title": "Volkswagen Earnings Miss Hopes on Higher Costs, Including Tariff Hit",
        "date": "2025-04-10",
        "summary": "First-quarter earnings missed expectations after taking a hit from one-off items including some early impact from U.S. import tariffs."
    },
    {
        "company": "AAPL",
        "title": "Don’t Blame Trump for All of the Stock Market’s Problems",
        "date": "2025-03-27",
        "summary": "Though the trade war has heightened uncertainty, slower earnings growth and a cooler labor market would likely have impacted the market regardless."
    },
    {
        "company": "AAPL",
        "title": "Wall Street’s Trading Revenue Powered by Tariff Uncertainty",
        "date": "2025-04-14",
        "summary": "Goldman Sachs is the latest big bank to report that increased trading fueled its quarterly profit."
    },
    {
        "company": "AAPL",
        "title": "Wall Street’s Trading Revenue Powered by Tariff Uncertainty",
        "date": "2025-04-14",
        "summary": "Goldman Sachs is the latest big bank to report that increased trading fueled its quarterly profit."
    },
    {
        "company": "AAPL",
        "title": "Retail Sales, Powell Speech, Rate Decisions: What to Watch This Week in Markets",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Bessent Says Tariff Revenue Could Reach $600 Billion Annually",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "EU Competition Chief Goes to Washington, With Tech Rulings Looming",
        "date": "2025-04-01",
        "summary": "Teresa Ribera’s trip comes as her department wraps up investigations into Apple and Meta under the Digital Markets Act — the European Union’s digital antitrust law."
    },
    {
        "company": "AAPL",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "AAPL",
        "title": "Q&A: What Can We Learn From Tariff Exemptions in Trump’s First Term?",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Wall Street Faces Toughest Test in Years ",
        "date": "2025-04-03",
        "summary": "U.S. stocks fall sharply as investors wrestle with President Trump’s sweeping tariff plans."
    },
    {
        "company": "AAPL",
        "title": "Abbott Labs Forecasts Tariff Impact of a ‘Few Hundred Million Dollars’",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "AAPL",
        "title": "Here’s What’s Worth Buying During Apple’s Trade-In Promo",
        "date": "2025-04-16",
        "summary": "And what you should buy from Amazon instead."
    },
    {
        "company": "AAPL",
        "title": "Recession Risk Prompts Bleak Forecast for Ad Spending",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "AAPL",
        "title": "Despite the Trade War, Chip Maker TSMC Remains Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": "Plus, Japan and Italy try to find common ground with the White House on trade. And Trump officials have requested that the IRS start the process of revoking Harvard’s tax-exempt status. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Pernod Ricard Backs Guidance as Trade Headwinds Brew",
        "date": "2025-04-17",
        "summary": "Pernod Ricard confirmed it expects sales to fall for the current fiscal year as the Absolut Vodka owner grapples with trade turmoil and a downturn in demand."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Trade War Deepens Threat to U.S. Brands in China",
        "date": "2025-04-15",
        "summary": "The tariff fight is deepening Chinese consumers’ preference for domestic goods."
    },
    {
        "company": "AAPL",
        "title": "Tesla’s Global Vehicle Deliveries Sank 13% in First Quarter",
        "date": "2025-04-02",
        "summary": "The decline is further evidence that a growing consumer backlash against the brand and CEO Elon Musk is hurting the automaker’s business."
    },
    {
        "company": "AAPL",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "AAPL",
        "title": "Tesla’s Global Vehicle Deliveries Sank 13% in First Quarter",
        "date": "2025-04-02",
        "summary": "The decline is further evidence that a growing consumer backlash against the brand and CEO Elon Musk is hurting the automaker’s business."
    },
    {
        "company": "AAPL",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "AAPL",
        "title": "Nintendo Ups Its Game With Launch of the New Switch 2",
        "date": "2025-04-02",
        "summary": "The launch of a pricier console during a trade war carries risk, but pent-up demand should carry the day."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "AAPL",
        "title": "Retail Sales Jumped 1.4% in March",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tesco Shares Fall on Profit Warning as Competition Heats Up",
        "date": "2025-04-10",
        "summary": "Shares fell after the U.K.’s largest supermarket said it expects profit to fall as competition intensifies, with rivals such as Asda ramping up efforts to gain market share."
    },
    {
        "company": "AAPL",
        "title": "Which Exemption Requests Were Granted vs. Denied During Trump’s First Term?",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Where Did the Republican Free-Traders Go?",
        "date": "2025-04-09",
        "summary": "Donald Trump's trade wars are roiling global business and financial markets, with China and the EU moving to retaliate. Yet only a handful of Republicans in Congress are pushing back, despite the GOP's past support for an open economy. Plus, the disruption raises pressure on Capitol Hill to pass a tax bill, and listeners write in with questions about the president's tariff strategy."
    },
    {
        "company": "AAPL",
        "title": "Even AI-Infrastructure Spending Is at Risk",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Walgreens Sales Rise on U.S. Retail Pharmacy Segment Growth",
        "date": "2025-04-08",
        "summary": "Walgreens Boots Alliance posted higher sales in its latest quarter on growth in retail-pharmacy sales in the U.S., in one of the last quarterly reports the company will publicly file ahead of its transition to a private company."
    },
    {
        "company": "AAPL",
        "title": "Trump: We’re Making a Fortune With Tariffs",
        "date": "2025-04-09",
        "summary": "At the National Republican Congressional Committee dinner, President Trump claimed the U.S. was earning $2 billion a day from tariffs. "
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "AAPL",
        "title": "United Airlines Tops Expectations Despite Travel Demand Worries",
        "date": "2025-04-15",
        "summary": "The airline offered two sets of profit guidance depending on whether the U.S. enters a recession or not as it reported quarterly results that beat Wall Street expectations."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Announces 10% Baseline Tariff, Reciprocal Tariffs on Some Nations",
        "date": "2025-04-02",
        "summary": "President Trump announced a slate of reciprocal tariffs against certain nations and a 10% across-the-board tariff, at a Rose Garden event he’s called “Liberation Day.” "
    },
    {
        "company": "AAPL",
        "title": "What to Know About Trump’s Latest Tariffs",
        "date": "2025-04-16",
        "summary": "President Trump unveiled a new tariff regime, including 10% across-the-board tariffs on all imports and even higher rates for some countries. Here’s the latest."
    },
    {
        "company": "AAPL",
        "title": "Tariffs Would Raise $1.8 Trillion Over Decade, Lower Income by 2.1%, Study Says",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "‘Fewer Choices and Higher Prices’: The Supply Chain of the Future",
        "date": "2025-04-05",
        "summary": "Tariff increases are likely to be passed on to consumers while companies look for cheaper locations."
    },
    {
        "company": "AAPL",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ford, GM, Stellantis, and more in the latest Market Talks covering Auto and Transport."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ford, GM, Stellantis, and more in the latest Market Talks covering Auto and Transport."
    },
    {
        "company": "AAPL",
        "title": "The AI Arms Race Is Coming to Rural America",
        "date": "2025-04-08",
        "summary": "Mark Zuckerberg’s Meta plans to build a "
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Higher U.S. Taxes Are an AI Win for China",
        "date": "2025-04-09",
        "summary": "Congress must keep corporate rates low, or businesses may shift valuable IP offshore. "
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Read about March U.S. retail sales, United Airlines, BMW,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Ubisoft Shares Climb After Tencent Backs Assassin’s Creed Carveout",
        "date": "2025-03-28",
        "summary": "Stock climbed on plans to carve out a unit that will house key franchises including Assassin’s Creed with the backing of Chinese tech giant Tencent."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "The Art of the 90-Day Tariff Pause",
        "date": "2025-04-09",
        "summary": "This chaos has been bad for everyone. Can the master negotiator now turn it around?"
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on CarMax, General Motors, container shipping lines, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "China Vows to Fight U.S. Tariffs ‘To The End’",
        "date": "2025-04-08",
        "summary": "A.M. Edition for April 8. Beijing "
    },
    {
        "company": "AAPL",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Leavitt Defends Lutnick Claim That Americans Will Make iPhones",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Edge Lower While Investors Wait for Signs on Tariff Talks",
        "date": "2025-04-15",
        "summary": "The Dow Industrials and the S&P 500 slid fractionally; bank stocks gained on strong earnings reports."
    },
    {
        "company": "AAPL",
        "title": "Economic Outlook Dives Just Three Months Into Trump’s Term",
        "date": "2025-04-13",
        "summary": "The probability of a recession has leapt while the growth outlook has slumped, a survey of economists has found."
    },
    {
        "company": "AAPL",
        "title": "Harvard Hit With $2 Billion Government Funding Freeze",
        "date": "2025-04-15",
        "summary": "A.M. Edition for April 15. The Trump administration "
    },
    {
        "company": "AAPL",
        "title": "Stocks Fall After President Trump Unveils New Tariffs on Auto Imports",
        "date": "2025-03-27",
        "summary": "Shares in all of the Big Three U.S. automakers dropped after the announcement, but Tesla stock ticked up. Plus: GameStop plunged after saying it would issue $1.3 billion of convertible bonds to buy bitcoin. And Dollar Tree shares jumped after announcing the sale of its Family Dollar business. Danny Lewis hosts. "
    },
    {
        "company": "AAPL",
        "title": "Logitech Withdraws FY26 Outlook Amid Tariff Uncertainty",
        "date": "2025-04-10",
        "summary": "he company’s move comes a day after President Trump placed a 90-day pause on most of his across-the-board reciprocal tariffs."
    },
    {
        "company": "AAPL",
        "title": "Individual Investors Brave Tariff Turmoil, Just in Time for a 6% Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Tariffs Aim to Bring Down Curtain on Era of Globalization",
        "date": "2025-04-03",
        "summary": "The president wants companies to return production to the U.S., but it won’t be easy."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Temu Is No Longer the No.1 Shopping App in the U.S.",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Impact of Trump’s Tariffs on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "P.M. Edition for April 7. "
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Bank Shots",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What Trade War? Chip Maker TSMC Is Still Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Barry Callebaut Shares Plunge After Cocoa-Price Volatility Clouds Outlook",
        "date": "2025-04-10",
        "summary": "The stock dropped 18% to levels last seen more than a decade ago, despite a broad-based market rally, after it cut its sales guidance."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stock Meltdown Gives Way to Global Rout",
        "date": "2025-04-07",
        "summary": "The turmoil in financial markets spread worldwide, as Trump’s challenge to world trade intensified stock losses from Hong Kong to France. Japan’s Nikkei 225 logged its biggest drop since last August."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Airlines, used vehicles, Hyundai Mobis, Chinese auto and EV makers and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "Judge Rules Google Operates Illegal Ad Monopoly",
        "date": "2025-04-18",
        "summary": "The tech giant faces multiple legal threats related to how it wields market power."
    },
    {
        "company": "AAPL",
        "title": "Stocks Tumble Again in Brutal Week on Wall Street",
        "date": "2025-04-04",
        "summary": "The U.S. stock market lost $6.6 trillion in market cap in two days as China retaliated against President Trump’s wide-ranging tariffs. Plus: Shares of companies that make goods in Vietnam rise after Trump said the country wants to negotiate, while chip stocks fell. Danny Lewis hosts."
    },
    {
        "company": "AAPL",
        "title": "China Readies Its Trade-War Arsenal",
        "date": "2025-04-10",
        "summary": "A.M. Edition for April 10. "
    },
    {
        "company": "AAPL",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "AAPL",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "AAPL",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "AAPL",
        "title": "Bitcoin Jumps Above $82,000 After Trump Announcement",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What Tech Exemptions Were Released Friday?",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "China Cites Apple, Tesla and Soybeans in Argument Against Trade War",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump’s Trade Math Ignores a Major Export: American Services",
        "date": "2025-04-10",
        "summary": "Trade wars are heightening overseas risk for U.S. companies. “When you generate bad will, it’s harder to sell stuff.”"
    },
    {
        "company": "AAPL",
        "title": "J&J Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Customs Duties Increase by $1.1 Billion in March, Treasury Reports",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Banks Warn of Risk to U.S. Economy Because of Tariffs",
        "date": "2025-04-11",
        "summary": "P.M. Edition for April 11. In earnings calls today, executives warned that President Trump’s tariffs were "
    },
    {
        "company": "AAPL",
        "title": "Banks Warn of Risk to U.S. Economy Because of Tariffs",
        "date": "2025-04-11",
        "summary": "P.M. Edition for April 11. In earnings calls today, executives warned that President Trump’s tariffs were "
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Brake Lights",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Wednesday Recap: Buy the Yips",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "AAPL",
        "title": "AppLovin Confirms Indication of Interest in TikTok Purchase",
        "date": "2025-04-03",
        "summary": "The Trump administration’s deadline to sell or shut down TikTok is Saturday."
    },
    {
        "company": "AAPL",
        "title": "What to Watch For This Earnings Season As Trump’s Tariffs Come Into Play",
        "date": "2025-04-05",
        "summary": "EARLY DROP!!! We know tariffs and markets are on your mind so we're dropping this episode ahead of time to give you even more time to plot out how to take on your week! "
    },
    {
        "company": "AAPL",
        "title": "Welcome to Trump’s Reality",
        "date": "2025-04-11",
        "summary": "The difference between the president and Steve Jobs."
    },
    {
        "company": "AAPL",
        "title": "MicroStrategy Expects to Post Loss After Bitcoin Price Slumps",
        "date": "2025-04-07",
        "summary": "The software company said it notched $5.91 billion in unrealized losses on its digital assets for the quarter ended March 31."
    },
    {
        "company": "AAPL",
        "title": "EU Chief Warns Bloc Could Target Digital Services If Talks With U.S. Fail–Report",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump and His ‘Little Disturbance’ From Tariffs",
        "date": "2025-04-03",
        "summary": "The effective U.S. tariff rate is now higher than after Smoot-Hawley."
    },
    {
        "company": "AAPL",
        "title": "Google Faces Potential $6.6 Billion U.K. Antitrust Lawsuit Over Search Advertising",
        "date": "2025-04-16",
        "summary": "The lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services."
    },
    {
        "company": "AAPL",
        "title": "Louis Vuitton’s Owner Looks Down-at-Heel Even Before Tariffs Hit: Heard on the Street",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Global Markets Rise on Tech Tariff Reprieve ",
        "date": "2025-04-14",
        "summary": "Stocks gained after Trump exempted semiconductor equipment, smartphones and other electronics from tariffs, even though officials later signaled they would be put in their own levy bracket."
    },
    {
        "company": "AAPL",
        "title": "Small Sellers of Fireworks, Ski Apparel and Other Imports Can’t Escape Tariff War",
        "date": "2025-04-11",
        "summary": "Uncertainty about President Trump’s tariffs is leading many small businesses to interrupt or halt production because they can’t absorb price hikes and lack leverage to negotiate."
    },
    {
        "company": "AAPL",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "AAPL",
        "title": "Tech Products Will Face Separate Tariffs Soon, Commerce Secretary Says",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Asian Stocks Mostly Fall After Trump's Tariffs Take Effect",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Most Voters Oppose Trump’s Tariffs, But His Supporters Are Still Behind Him",
        "date": "2025-04-04",
        "summary": "P.M. Edition for April 4. "
    },
    {
        "company": "AAPL",
        "title": "One Tech CEO Expects Tariffs to Hit Growth Prospects ",
        "date": "2025-04-03",
        "summary": "‘I can bet you that the impact of what’s happening on the macro side will be felt in the second half of the year,’ Egnyte Chief Executive Vineet Jain said."
    },
    {
        "company": "AAPL",
        "title": "Most Voters Oppose Trump’s Tariffs, But His Supporters Are Still Behind Him",
        "date": "2025-04-04",
        "summary": "P.M. Edition for April 4. "
    },
    {
        "company": "AAPL",
        "title": "One Tech CEO Expects Tariffs to Hit Growth Prospects ",
        "date": "2025-04-03",
        "summary": "‘I can bet you that the impact of what’s happening on the macro side will be felt in the second half of the year,’ Egnyte Chief Executive Vineet Jain said."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Stocks Post Gains Ahead of Trump Tariff Announcement",
        "date": "2025-04-02",
        "summary": "Investors hope clarity on trade will help markets recover."
    },
    {
        "company": "AAPL",
        "title": "Exempt or Not, the Chip Industry Won’t Escape Tariffs",
        "date": "2025-04-03",
        "summary": "Higher prices for the many products that contain chips threaten to hit demand."
    },
    {
        "company": "AAPL",
        "title": "Feeling Ripped Off by $1,000 Phones? The Secondhand Market Is Taking Off",
        "date": "2025-03-28",
        "summary": "While most buyers still want a new device, those looking for an alternative will find that mobile carriers, retailers and even Apple and Samsung themselves are stepping up their used-phone offerings."
    },
    {
        "company": "AAPL",
        "title": "Albertsons Sales Grow on Boost From Pharmacy Business",
        "date": "2025-04-15",
        "summary": "Albertsons  saw its top-line figure increase in the latest quarter as its pharmacy business powered identical sales growth."
    },
    {
        "company": "AAPL",
        "title": "Wells Fargo Profit Rises, Boosted by Lower Expenses",
        "date": "2025-04-11",
        "summary": "Wells Fargo booked a bigger profit in the first quarter, as lower expenses helped offset a decline in net interest income."
    },
    {
        "company": "AAPL",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Find insight on Novo Nordisk, product-specific tariffs, Pro Medicus and more in the latest Market Talks on Health Care."
    },
    {
        "company": "AAPL",
        "title": "BlackRock’s Assets Hit Record as Net Income Falls",
        "date": "2025-04-11",
        "summary": "BlackRock’s quarterly net income fell slightly from a year earlier, while the investment firm’s assets under management edged higher to a record $11.6 trillion."
    },
    {
        "company": "AAPL",
        "title": "The Day Trump’s Tariffs Shook Corporate America",
        "date": "2025-04-03",
        "summary": "Executives scrambled to grasp the scope and size of the president’s trade barriers."
    },
    {
        "company": "AAPL",
        "title": "This Recession Trade Is Happening in Property Stocks: Heard on the Street",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Tumble as Trade-War Jitters Return",
        "date": "2025-04-10",
        "summary": "The Dow industrials and S&P 500 give back some gains from Wednesday’s historic rally."
    },
    {
        "company": "AAPL",
        "title": "White House Says Trump Tariffs Tomorrow Will Take Effect ‘Immediately’",
        "date": "2025-04-01",
        "summary": "P.M. Edition for April 1. Trump met with advisers to iron out the final details of his reciprocal tariff plans, as Canada and the EU prepare their responses. Plus, "
    },
    {
        "company": "AAPL",
        "title": "S&P 500 Futures Fall 2.2% During Tariff Announcement",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Retail Sales Growth Expected to Slow, in Part Because of Tariffs",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Says Europe’s Tech Rules Are a Trade Barrier",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Why Earnings Expectations Are Too High",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Soar as President Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "P.M. Edition for April 9. U.S. stocks stage a furious rally after Trump "
    },
    {
        "company": "AAPL",
        "title": "Pharma Stocks Slide Further After Trump Reiterates Tariff Threats on Drugs",
        "date": "2025-04-09",
        "summary": "Drugmakers have said they’re still unclear about whether Trump will impose tariffs on finished products or on active pharmaceutical ingredients."
    },
    {
        "company": "AAPL",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "Aditya Bhave, a Bank of America senior U.S. economist, discusses with co-hosts Telis Demos and Miriam Gottfried what we can expect from the forthcoming jobs report and how it will offer a big clue to where the economy is heading. "
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs Are Unique in History",
        "date": "2025-04-11",
        "summary": "U.S. trade policy went through three eras, focused on ‘revenue, restriction and reciprocity,’ economist Douglas Irwin says. The 47th president likes all three Rs, and a fourth, ‘retribution.’"
    },
    {
        "company": "AAPL",
        "title": "The Gadgets That Will—and May Not—Be Spared From Trump’s Tariffs",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s Behind Donald Trump’s Tariff Pause?",
        "date": "2025-04-10",
        "summary": "Donald Trump places a 90-day pause on the so-called reciprocal tariffs levied on countries around the world, but hits China with an even higher rate.  What is his strategy for dealing with Xi Jinping, and what will he demand from friends and foes during negotiations? "
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Latest Tariff Exemptions, By the Numbers",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "AAPL",
        "title": "Nikkei Rises After Trump's Tariff Moves",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Republicans for Higher Tax Rates",
        "date": "2025-04-01",
        "summary": "Individual and corporate income tax-rate hikes are on the table as the GOP negotiates its reconciliation bill."
    },
    {
        "company": "AAPL",
        "title": "More Than 100 Million Options Contracts Changed Hands on Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Hardest-Hit Stocks in Asia: Tech, Japanese Banks and a Nike Supplier",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Bitcoin Price Falls Below $82,000, Crypto Stocks Slide After Tariff Plans",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Lululemon Outlook Misses as Consumer Confidence Falls",
        "date": "2025-03-27",
        "summary": "The activewear company said it expects sales of $11.15 billion to $11.3 billion for its fiscal 2025, the high-end of which is in line with analyst views."
    },
    {
        "company": "AAPL",
        "title": "President Trump Announces 10% Across-the-Board Tariff on All Imports",
        "date": "2025-04-02",
        "summary": "P.M. Edition for April 2. President Trump said that the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations, in a series of moves he declared \"Liberation Day\" for U.S. trade policy. Plus, the U.S. tariffs send a message to companies that the era of globalization is over. Reporter "
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Fall Sharply as Consumer Sentiment Sours in March",
        "date": "2025-03-28",
        "summary": "P.M. Edition for Mar. 28. Stocks sold off after hotter-than-expected inflation data, President Trump's tariff announcements and "
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Auto Industry Braces for Major Pain From Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": "Vehicle prices will surge $5,000 to $10,000 and tariffs will wreak havoc on auto demand, analysts say."
    },
    {
        "company": "AAPL",
        "title": "GameStop’s Rapid Shrinkage Is Paying Off",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Auto Industry Braces for Major Pain From Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": "Vehicle prices will surge $5,000 to $10,000 and tariffs will wreak havoc on auto demand, analysts say."
    },
    {
        "company": "AAPL",
        "title": "GameStop’s Rapid Shrinkage Is Paying Off",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Inflation Data, Tariff Worries Weigh on Stocks",
        "date": "2025-03-28",
        "summary": "Plus, automaker shares extend losses. And the Coreweave IPO disappoints in a stumble for the market for new public listings. Danny Lewis hosts."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Adds Tougher Limits on China’s Access to U.S. Technology",
        "date": "2025-03-26",
        "summary": "Plus, AI startup Anthropic wins in court over copyrighted music. And, Gamestop’s play in bitcoin boosts its stock. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Does Meta Have a Social Media Monopoly?",
        "date": "2025-04-17",
        "summary": "Mark Zuckerberg is in court defending Meta against a "
    },
    {
        "company": "AAPL",
        "title": "China Retaliates With 34% Tariffs, as a Lawsuit Challenges Trump's Trade Wars",
        "date": "2025-04-04",
        "summary": "Donald Trump's big tariffs have now drawn a big response from Beijing, which says it will add 34% duties to U.S. goods, roiling the stock market again on Friday. But a new lawsuit argues that the president's purported \"emergency\" tariffs aren't authorized by law, while a handful of Senate Republicans, including Rand Paul, vote to countermand the U.S. trade war against Canada."
    },
    {
        "company": "AAPL",
        "title": "Trade Historian Douglas Irwin on Trump's Unprecedented Tariff Shock",
        "date": "2025-04-14",
        "summary": "Paul Gigot interviews Dartmouth economist Douglas Irwin on why Trump's tariffs are unlike any other in U.S. history, how they will change the global trading system, and what to do about the special case of China."
    }
]