[
    {
        "company": "AAPL",
        "title": "Apple, Meta Fined by EU, Ordered to Comply With Tech Competition Rules",
        "date": "2025-04-23",
        "summary": "The move risks ratcheting up tensions with the Trump administration as EU officials pursue trade talks."
    },
    {
        "company": "AAPL",
        "title": "Apple Fined $162 Million in France Over App Tracking Transparency ",
        "date": "2025-03-31",
        "summary": "France’s competition regulator fined Apple over concerns the company abused its dominant position in mobile apps through its iPhone and iPad’s operating system."
    },
    {
        "company": "AAPL",
        "title": "France Fines Apple $162 Million, Risking Trump’s Ire",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Loses Ground in China’s Smartphone Market as Local Rivals Gain",
        "date": "2025-04-18",
        "summary": "Apple lost its top spot in China’s smartphone market, dethroned by local rival Xiaomi as Beijing’s consumption-boosting subsidies help buoy demand for cheaper products."
    },
    {
        "company": "AAPL",
        "title": "EU Delayed Punishing Apple, Meta Just Before Trade Talks Started",
        "date": "2025-04-18",
        "summary": "The bloc postponed penalties, temporarily avoiding a conflict with the Trump administration during a week in which it ramped up its push for a trade deal with the U.S."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "AAPL",
        "title": "Apple Built iPhone Inventory Ahead of Tariff War, Data Show",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "AAPL",
        "title": "To Navigate Trump’s Tariffs, Apple and Nintendo Take Different Paths",
        "date": "2025-04-15",
        "summary": "Apple CEO "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": "Levies on Chinese goods have created worst three-day rout for iPhone maker in about 25 years."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-07",
        "summary": "Customers said they aren’t waiting to see if iPhone costs increase."
    },
    {
        "company": "AAPL",
        "title": "Apple Exported More Than $17 Billion of iPhones From India Last Year",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "AAPL",
        "title": "Some iPhone Users Upgrade, Fearing Tariff-Induced Price Hike",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What Apple Has at Stake in China",
        "date": "2025-04-12",
        "summary": "The iPhone-maker just received some reprieve from tariffs, but is still heavily reliant on the Chinese manufacturing economy it helped build."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "India Has a Golden Opportunity to Capture U.S. Business From China",
        "date": "2025-04-19",
        "summary": "The world’s most populous nation has long trailed not just China but also smaller countries with nimbler governments."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "AAPL",
        "title": "Visa Offers Apple Roughly $100 Million to Take Over Credit Card From Mastercard",
        "date": "2025-04-01",
        "summary": "Visa, Amex and Mastercard are all competing to be the network for the tech giant’s credit card."
    },
    {
        "company": "AAPL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "AAPL",
        "title": "Apple Sales Surged Saturday Due to Tariff-Related Price Hike Fears",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": "This is what Apple pays for components inside its bestselling phone, and how Trump’s China tariffs could raise the bill."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "India Saw a Surge in Smartphone Exports Ahead of Tariffs",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Video: What Tariffs Will Do to Your iPhone",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "AAPL",
        "title": "An American-Made iPhone: Just Expensive or Completely Impossible?",
        "date": "2025-04-09",
        "summary": "Trump’s tariffs aim to bring manufacturing back to the U.S. So what—besides magic—would it take to make iPhones here?"
    },
    {
        "company": "AAPL",
        "title": "Apple-Linked Tech Stocks Are Hard-Hit in Asia",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Shares of Apple Suppliers in Asia Regain Ground",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Utah Hands Parents the Keys to the App Store",
        "date": "2025-04-11",
        "summary": "A new law allows families to take legal action when deceptive age and content ratings lead to harm."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "India Made a Big Push for Smartphone Exports. Now What?",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Stock Needs a Trump Discount: Heard on the Street",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-13",
        "summary": "The CEO managed to help the iPhone avoid another U.S. battle with China."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Says It Intends to Export From Vietnam Even With Tariffs",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With Nothing But Hard Choices—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Luxshare to Maintain Vietnam Production Hub to Support U.S. Market",
        "date": "2025-04-09",
        "summary": "Luxshare Precision Industry, a key assembler of the iPhone and other Apple products, said it will maintain large-scale production in Vietnam and continue exports from there to the U.S., responding to President Trump’s tariffs."
    },
    {
        "company": "AAPL",
        "title": "Apple’s Margins Are Still a Big Risk in Trade War Roller Coaster: Heard on the Street",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Lessons of Trump’s Tariff Exemptions",
        "date": "2025-04-13",
        "summary": "It’s good to be Apple’s Tim Cook but not to be a small manufacturer that can’t afford a K Street lobbyist."
    },
    {
        "company": "AAPL",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "AAPL",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "AAPL",
        "title": "Why We Don’t Have a Made-in-America iPhone",
        "date": "2025-04-08",
        "summary": "President Trump’s tariffs aim to bring manufacturing back to the U.S.—including iPhones. WSJ’s Joanna Stern breaks down exactly how tough it would be to build iPhones here, and how tariffs could affect the price of your next phone."
    },
    {
        "company": "AAPL",
        "title": "AppLovin Confirms Indication of Interest in TikTok Purchase",
        "date": "2025-04-03",
        "summary": "The Trump administration’s deadline to sell or shut down TikTok is Saturday."
    },
    {
        "company": "AAPL",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Chatbot Confidential: When AI at Work Is Risky Business",
        "date": "2025-04-06",
        "summary": "Gen AI chatbots have changed how we work. Today, we bring you the second installment of Tech News Briefing’s special series “Chatbot Confidential,” where WSJ personal tech columnist Nicole Nguyen details best practices for using the chatbots while protecting your privacy. In this episode, we dive into an area where the temptation to tap generative AI tools is very strong: work! We’ll tell you about the risks your new helper brings and how not to give away company secrets while using them."
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Ripple Effect Trump’s Tariffs Will Have on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "It isn’t just inflation. Manufacturing and artificial intelligence are at risk, too."
    },
    {
        "company": "AAPL",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "Temu Is No Longer the No.1 Shopping App in the U.S.",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Gadgets That Will—and May Not—Be Spared From Trump’s Tariffs",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "China Vows to Retaliate After Trump’s Latest Tariff Threat",
        "date": "2025-04-08",
        "summary": "Plus, Apple is planning to send more iPhones to the U.S. from India to offset the high cost of China tariffs. And global equities are regaining ground after yesterday’s market whiplash. Kate Bullivant hosts."
    },
    {
        "company": "AAPL",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Meta Fights to Keep Instagram and WhatsApp, as Antitrust Trial Begins",
        "date": "2025-04-14",
        "summary": "The Federal Trade Commission says Meta has monopolized the social-media market—and should be broken up."
    },
    {
        "company": "AAPL",
        "title": "Here’s What’s Worth Buying During Apple’s Trade-In Promo",
        "date": "2025-04-16",
        "summary": "And what you should buy from Amazon instead."
    },
    {
        "company": "AAPL",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Viral Videos, Trade Tensions Drive U.S. Shoppers to Chinese App",
        "date": "2025-04-16",
        "summary": "The popularity of a Chinese e-commerce app has surged in the U.S., driven by a spate of viral TikTok videos amid the trade war between the world’s two largest economies."
    },
    {
        "company": "AAPL",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Scrambles to Finalize ‘Liberation Day’ Tariff Plans",
        "date": "2025-03-31",
        "summary": "Plus, President Trump expresses anger at Russia’s Vladimir Putin with little progress made on Ukraine ceasefire talks. And Apple and Elon Musk’s SpaceX are feuding over satellite service as they race to eliminate cellphone dead spots. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "AAPL",
        "title": "Welcome to Trump’s Reality",
        "date": "2025-04-11",
        "summary": "The difference between the president and Steve Jobs."
    },
    {
        "company": "AAPL",
        "title": "Electronics Exemption Trims U.S. Tariff Rate",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Zuckerberg, on Witness Stand, Rebuffs Claims Meta Monopolizes Social-Media Market",
        "date": "2025-04-15",
        "summary": "The Meta Platforms CEO testified that his company had legitimate business reasons for acquiring Instagram more than a decade ago."
    },
    {
        "company": "AAPL",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Looks at Tariff Pause for Some Autos",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "AAPL",
        "title": "Markets Tumble as Donald Trump’s Tariff ‘Liberation Day’ Finally Arrives",
        "date": "2025-04-03",
        "summary": "Donald Trump delivers on his promise of sweeping tariffs, causing markets to plunge in response. The White House says the long-term gain will be worth the short-term pain, but how will the American consumer and the world at large be affected?  "
    },
    {
        "company": "AAPL",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "AAPL",
        "title": "Leavitt Defends Lutnick Claim That Americans Will Make iPhones",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What Tech Exemptions Were Released Friday?",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Feeling Ripped Off by $1,000 Phones? The Secondhand Market Is Taking Off",
        "date": "2025-03-28",
        "summary": "While most buyers still want a new device, those looking for an alternative will find that mobile carriers, retailers and even Apple and Samsung themselves are stepping up their used-phone offerings."
    },
    {
        "company": "AAPL",
        "title": "Tech Group Urges ‘Thorough, Fact-Based’ Tariff Investigation Into Semiconductors",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "How Signal Became Washington’s Favorite Messaging App",
        "date": "2025-03-28",
        "summary": "Downloads of the app surged in the past week after the Atlantic published White House officials’ texts about a military strike."
    },
    {
        "company": "AAPL",
        "title": "AI ‘Impostor’ Voice Scams Are On the Rise. How to Protect Yourself?",
        "date": "2025-04-16",
        "summary": "A new type of phone "
    },
    {
        "company": "AAPL",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "AAPL",
        "title": "EU Competition Chief Goes to Washington, With Tech Rulings Looming",
        "date": "2025-04-01",
        "summary": "Teresa Ribera’s trip comes as her department wraps up investigations into Apple and Meta under the Digital Markets Act — the European Union’s digital antitrust law."
    },
    {
        "company": "AAPL",
        "title": "Macron Suggests Retaliation Against U.S. Tech Services For Trump Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "Trade Historian Douglas Irwin on Trump's Unprecedented Tariff Shock",
        "date": "2025-04-14",
        "summary": "Paul Gigot interviews Dartmouth economist Douglas Irwin on why Trump's tariffs are unlike any other in U.S. history, how they will change the global trading system, and what to do about the special case of China."
    }
]