[
    {
        "company": "AAPL",
        "title": "Apple Built iPhone Inventory Ahead of Tariff War, Data Show",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": "Levies on Chinese goods have created worst three-day rout for iPhone maker in about 25 years."
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-07",
        "summary": "Customers said they aren’t waiting to see if iPhone costs increase."
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": "This is what Apple pays for components inside its bestselling phone, and how Trump’s China tariffs could raise the bill."
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Exported More Than $17 Billion of iPhones From India Last Year",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Some iPhone Users Upgrade, Fearing Tariff-Induced Price Hike",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "AAPL",
        "title": "Apple Loses Ground in China’s Smartphone Market as Local Rivals Gain",
        "date": "2025-04-18",
        "summary": "Apple lost its top spot in China’s smartphone market, dethroned by local rival Xiaomi as Beijing’s consumption-boosting subsidies help buoy demand for cheaper products."
    },
    {
        "company": "AAPL",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "AAPL",
        "title": "What Apple Has at Stake in China",
        "date": "2025-04-12",
        "summary": "The iPhone-maker just received some reprieve from tariffs, but is still heavily reliant on the Chinese manufacturing economy it helped build."
    },
    {
        "company": "AAPL",
        "title": "Watch: What Tariffs Will Do to Your iPhone",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Apple Sales Surged Saturday Due to Tariff-Related Price Hike Fears",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "An American-Made iPhone: Just Expensive or Completely Impossible?",
        "date": "2025-04-09",
        "summary": "Trump’s tariffs aim to bring manufacturing back to the U.S. So what—besides magic—would it take to make iPhones here?"
    },
    {
        "company": "AAPL",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "India Saw a Surge in Smartphone Exports Ahead of Tariffs",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Why We Don’t Have a Made-in-America iPhone",
        "date": "2025-04-08",
        "summary": "President Trump’s tariffs aim to bring manufacturing back to the U.S.—including iPhones. WSJ’s Joanna Stern breaks down exactly how tough it would be to build iPhones here, and how tariffs could affect the price of your next phone."
    },
    {
        "company": "AAPL",
        "title": "Apple, Meta Fined by EU, Ordered to Comply With Tech Competition Rules",
        "date": "2025-04-23",
        "summary": "The move risks ratcheting up tensions with the Trump administration as EU officials pursue trade talks."
    },
    {
        "company": "AAPL",
        "title": "India Made a Big Push for Smartphone Exports. Now What?",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "AAPL",
        "title": "Feeling Ripped Off by $1,000 Phones? The Secondhand Market Is Taking Off",
        "date": "2025-03-28",
        "summary": "While most buyers still want a new device, those looking for an alternative will find that mobile carriers, retailers and even Apple and Samsung themselves are stepping up their used-phone offerings."
    },
    {
        "company": "AAPL",
        "title": "Apple Stock Needs a Trump Discount: Heard on the Street",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "China Vows to Retaliate After Trump’s Latest Tariff Threat",
        "date": "2025-04-08",
        "summary": "Plus, Apple is planning to send more iPhones to the U.S. from India to offset the high cost of China tariffs. And global equities are regaining ground after yesterday’s market whiplash. Kate Bullivant hosts."
    },
    {
        "company": "AAPL",
        "title": "AT&T Adds More Subscribers, Sees Tariffs Spurring Phone Upgrades",
        "date": "2025-04-23",
        "summary": "The telecom company said that tariffs triggered an acceleration in consumers upgrading their mobile phones."
    },
    {
        "company": "AAPL",
        "title": "India Has a Golden Opportunity to Capture U.S. Business From China",
        "date": "2025-04-19",
        "summary": "The world’s most populous nation has long trailed not just China but also smaller countries with nimbler governments."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Nokia Flags Earnings Hit From Tariffs",
        "date": "2025-04-24",
        "summary": "The company expects to take an earnings hit in the second quarter from tariffs and said that reaching the high end of its guidance range for the year now looked more challenging."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "The Lessons of Trump’s Tariff Exemptions",
        "date": "2025-04-13",
        "summary": "It’s good to be Apple’s Tim Cook but not to be a small manufacturer that can’t afford a K Street lobbyist."
    },
    {
        "company": "AAPL",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "AAPL",
        "title": "Warren Buffett Timed His Apple Stock Sale to Perfection. What’s Next?",
        "date": "2025-04-22",
        "summary": "Berkshire Hathaway’s huge cash pile has investors wondering what he will buy and when."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "AAPL",
        "title": "France Fines Apple $162 Million, Risking Trump’s Ire",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-13",
        "summary": "The CEO managed to help the iPhone avoid another U.S. battle with China."
    },
    {
        "company": "AAPL",
        "title": "EU Delayed Punishing Apple, Meta Just Before Trade Talks Started",
        "date": "2025-04-18",
        "summary": "The bloc postponed penalties, temporarily avoiding a conflict with the Trump administration during a week in which it ramped up its push for a trade deal with the U.S."
    },
    {
        "company": "AAPL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Says It Intends to Export From Vietnam Even With Tariffs",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Leavitt Defends Lutnick Claim That Americans Will Make iPhones",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Scrambles to Finalize ‘Liberation Day’ Tariff Plans",
        "date": "2025-03-31",
        "summary": "Plus, President Trump expresses anger at Russia’s Vladimir Putin with little progress made on Ukraine ceasefire talks. And Apple and Elon Musk’s SpaceX are feuding over satellite service as they race to eliminate cellphone dead spots. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple’s Margins Are Still a Big Risk in Trade War Roller Coaster: Heard on the Street",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Fined $162 Million in France Over App Tracking Transparency ",
        "date": "2025-03-31",
        "summary": "France’s competition regulator fined Apple over concerns the company abused its dominant position in mobile apps through its iPhone and iPad’s operating system."
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Luxshare to Maintain Vietnam Production Hub to Support U.S. Market",
        "date": "2025-04-09",
        "summary": "Luxshare Precision Industry, a key assembler of the iPhone and other Apple products, said it will maintain large-scale production in Vietnam and continue exports from there to the U.S., responding to President Trump’s tariffs."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "To Navigate Trump’s Tariffs, Apple and Nintendo Take Different Paths",
        "date": "2025-04-15",
        "summary": "Apple CEO "
    },
    {
        "company": "AAPL",
        "title": "Shares of Apple Suppliers in Asia Regain Ground",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Gadgets That Will—and May Not—Be Spared From Trump’s Tariffs",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Don’t Ask Us to Pick Up the Smartphone Tariff Tab, Verizon Warns",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple-Linked Tech Stocks Are Hard-Hit in Asia",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The 27 Best Deals to Shop Online Right Now",
        "date": "2025-04-24",
        "summary": "These are tested and vetted markdowns you won’t want to miss."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With Nothing But Hard Choices—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Ripple Effect Trump’s Tariffs Will Have on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "It isn’t just inflation. Manufacturing and artificial intelligence are at risk, too."
    },
    {
        "company": "AAPL",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "AAPL",
        "title": "Ditch the Wallet! These iPhone Cases Carry Everything You Need",
        "date": "2025-03-26",
        "summary": "Five great-looking, unisex iPhone cases with built-in slots for cards."
    },
    {
        "company": "AAPL",
        "title": "The Score: UnitedHealth, Netflix, Eli Lilly and More Stocks That Defined the Week",
        "date": "2025-04-18",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news"
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Visa Offers Apple Roughly $100 Million to Take Over Credit Card From Mastercard",
        "date": "2025-04-01",
        "summary": "Visa, Amex and Mastercard are all competing to be the network for the tech giant’s credit card."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Visa Offers Apple Roughly $100 Million to Take Over Credit Card From Mastercard",
        "date": "2025-04-01",
        "summary": "Visa, Amex and Mastercard are all competing to be the network for the tech giant’s credit card."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Here’s What’s Worth Buying During Apple’s Trade-In Promo",
        "date": "2025-04-16",
        "summary": "And what you should buy from Amazon instead."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "No More Cellphones in Virginia Classrooms",
        "date": "2025-04-20",
        "summary": "Gov. Youngkin will soon sign the measure he proposed last year."
    },
    {
        "company": "AAPL",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "Markets Tumble as Donald Trump’s Tariff ‘Liberation Day’ Finally Arrives",
        "date": "2025-04-03",
        "summary": "Donald Trump delivers on his promise of sweeping tariffs, causing markets to plunge in response. The White House says the long-term gain will be worth the short-term pain, but how will the American consumer and the world at large be affected?  "
    },
    {
        "company": "AAPL",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Why It’s So Difficult for Robots to Make Your Nike Sneakers",
        "date": "2025-04-21",
        "summary": "The shoe giant’s effort to find alternatives to Asian factories that churn out a dazzling variety of its sneakers is a cautionary tale."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "Welcome to Trump’s Reality",
        "date": "2025-04-11",
        "summary": "The difference between the president and Steve Jobs."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Fall Sharply as Global Economic Outlook Remains Uncertain",
        "date": "2025-04-10",
        "summary": "P.M. Edition for April 10. Yesterday’s market rally gave way to "
    },
    {
        "company": "AAPL",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "AAPL",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "AAPL",
        "title": "Our Capitulation Nation",
        "date": "2025-04-20",
        "summary": "Everybody’s folding, from Trump and Democrats to law firms and universities."
    },
    {
        "company": "AAPL",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Tesla Profit Slumps",
        "date": "2025-04-22",
        "summary": "Plus: Meta could see a $7 billion pullback from Chinese advertisers over tariffs, research firm says. And Verizon says it won’t cover any handset price increases due to tariffs. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "What Tech Exemptions Were Released Friday?",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Looks at Tariff Pause for Some Autos",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Exceptional Tariff Weekend",
        "date": "2025-04-13",
        "summary": "His Customs office announced tariff-rate exceptions on electronics on Friday that he renounced on Sunday. "
    },
    {
        "company": "AAPL",
        "title": "Electronics Exemption Trims U.S. Tariff Rate",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "China Vows to Fight U.S. Tariffs ‘To The End’",
        "date": "2025-04-08",
        "summary": "A.M. Edition for April 8. Beijing "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
        "date": "2025-04-14",
        "summary": "The chip maker’s plan to build AI tech in Texas comes on the heels of a new tariff threat."
    },
    {
        "company": "AAPL",
        "title": "Which Exemption Requests Were Granted vs. Denied During Trump’s First Term?",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Considers Tariff Exemptions for Tech, Car Companies",
        "date": "2025-04-14",
        "summary": "President Trump said he was considering short-term tariff exemptions for auto companies in the Oval Office on Monday. He said he exempted smartphones from recent tariffs. "
    },
    {
        "company": "AAPL",
        "title": "My Daughter Is Ready for Her First Smartphone. I’m Not Ready to Give It to Her.",
        "date": "2025-04-10",
        "summary": "At 11, she still goes bike-riding with me and lets me hold her hand. Why would I want her to hold a phone instead?"
    },
    {
        "company": "AAPL",
        "title": "What’s Behind Donald Trump’s Tariff Pause?",
        "date": "2025-04-10",
        "summary": "Donald Trump places a 90-day pause on the so-called reciprocal tariffs levied on countries around the world, but hits China with an even higher rate.  What is his strategy for dealing with Xi Jinping, and what will he demand from friends and foes during negotiations? "
    },
    {
        "company": "AAPL",
        "title": "More Democrats Call It “Corruption” When Talking About Trump’s Trade War",
        "date": "2025-04-13",
        "summary": "Sen. Elizabeth Warren and Kentucky Gov. Andy Beshear criticized President Trump’s tariff policies, calling the trade war “corruption.”"
    },
    {
        "company": "AAPL",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "AAPL",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "AAPL",
        "title": "Q&A: What Can We Learn From Tariff Exemptions in Trump’s First Term?",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Rent the Runway, Xiaomi , Telecom Italia, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "AAPL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "AAPL",
        "title": "Trump Exempts Some Electronics, Including Smartphones, From Tariffs on China",
        "date": "2025-04-12",
        "summary": "President Trump’s tariff exemptions on some electronics are the latest twist in U.S. trade policy and could benefit companies such as Apple, Microsoft, Dell, Samsung and others that manufacture some products abroad. "
    },
    {
        "company": "AAPL",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "AAPL",
        "title": "Nikkei Rises After Trump's Tariff Moves",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "AAPL",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "AAPL",
        "title": "Meta Fights to Keep Instagram and WhatsApp, as Antitrust Trial Begins",
        "date": "2025-04-14",
        "summary": "The Federal Trade Commission says Meta has monopolized the social-media market—and should be broken up."
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "AAPL",
        "title": "India Indicates It Has No Plans to Retaliate to Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-31",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "This Recession Trade Is Happening in Property Stocks: Heard on the Street",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "AAPL",
        "title": "Temu Is No Longer the No.1 Shopping App in the U.S.",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "AppLovin Confirms Indication of Interest in TikTok Purchase",
        "date": "2025-04-03",
        "summary": "The Trump administration’s deadline to sell or shut down TikTok is Saturday."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "Does Meta Have a Social Media Monopoly?",
        "date": "2025-04-17",
        "summary": "Mark Zuckerberg is in court defending Meta against a "
    },
    {
        "company": "AAPL",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "AI ‘Impostor’ Voice Scams Are On the Rise. How to Protect Yourself?",
        "date": "2025-04-16",
        "summary": "A new type of phone "
    },
    {
        "company": "AAPL",
        "title": "Ericsson Posts Rise in North American Spending Ahead of Tariffs",
        "date": "2025-04-15",
        "summary": "The network business reported a 6% rise in sales, with strong growth in North America as customers moved forward investments ahead of planned U.S. tariffs."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "They Went to the Masters. They Ditched Their Cellphones. Then the Markets Went Completely Crazy.",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "White House on Trade Deals: The Phones Are Ringing off the Hooks",
        "date": "2025-04-11",
        "summary": "White House Press Secretary Karoline Leavitt said more than 75 countries are eager to negotiate tariff deals with President Trump."
    },
    {
        "company": "AAPL",
        "title": "Auto Stocks Drop as Trump Plans 25% Tariff on Car Imports",
        "date": "2025-03-27",
        "summary": "A.M. Edition for Mar. 27. Shares in global carmakers are sliding after President Trump said he’d "
    },
    {
        "company": "AAPL",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Samsung Guides for Softer First-Quarter Profit But Still Beats Consensus",
        "date": "2025-04-08",
        "summary": "Samsung Electronics guided for softer first-quarter operating profit amid few signs of an immediate recovery in its flagship semiconductor business."
    },
    {
        "company": "AAPL",
        "title": "How Signal Became Washington’s Favorite Messaging App",
        "date": "2025-03-28",
        "summary": "Downloads of the app surged in the past week after the Atlantic published White House officials’ texts about a military strike."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Brazil’s Stagnant Economy Is the Poster Child for High Tariffs",
        "date": "2025-04-12",
        "summary": "While high tariffs keep some jobs in the country, they have also driven up costs for consumers and helped make Brazilian industry inefficient."
    },
    {
        "company": "AAPL",
        "title": "EU Competition Chief Goes to Washington, With Tech Rulings Looming",
        "date": "2025-04-01",
        "summary": "Teresa Ribera’s trip comes as her department wraps up investigations into Apple and Meta under the Digital Markets Act — the European Union’s digital antitrust law."
    },
    {
        "company": "AAPL",
        "title": "Tech Products Will Face Separate Tariffs Soon, Commerce Secretary Says",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "How Bad Was This Week in the Stock Market?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Commerce Secretary Lutnick: Electronics Will Face Separate Tariffs Soon",
        "date": "2025-04-13",
        "summary": "Commerce Secretary Howard Lutnick told ABC News the upcoming tariffs for electronics are based on Section 232, which allows President Trump to adjust imports that pose a threat to national security."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Tariff Wipeout",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Verizon Offers 3-Year Price Lock for Wireless Customers",
        "date": "2025-04-03",
        "summary": "Subscribers on the telecom company’s myPlan and myHome bundles automatically gain a price-lock guarantee for three years."
    },
    {
        "company": "AAPL",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech Group Urges ‘Thorough, Fact-Based’ Tariff Investigation Into Semiconductors",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Final Day to Shop Amazon Big Spring Sale Tech Deals",
        "date": "2025-04-03",
        "summary": "Don’t miss these deals to keep your phone, tablet or laptop going all day and beyond."
    },
    {
        "company": "AAPL",
        "title": "Hardest-Hit Stocks in Asia: Tech, Japanese Banks and a Nike Supplier",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Shein’s Bargain-App Formula Crumbles Under Trump",
        "date": "2025-04-11",
        "summary": "The fashion giant faces a double whammy of steep U.S. tariffs and an end to its duty-free shipping to America."
    },
    {
        "company": "AAPL",
        "title": "Asian Stocks Mostly Fall After Trump's Tariffs Take Effect",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Japan Regulator Orders Google to Stop Anticompetitive Practices",
        "date": "2025-04-15",
        "summary": "Japan’s antitrust regulator instructed Alphabet’s Google to stop what it said are anticompetitive practices involving mobile search services, its first order against a U.S. technology giant."
    },
    {
        "company": "AAPL",
        "title": "Chatbot Confidential: When AI at Work Is Risky Business",
        "date": "2025-04-06",
        "summary": "Gen AI chatbots have changed how we work. Today, we bring you the second installment of Tech News Briefing’s special series “Chatbot Confidential,” where WSJ personal tech columnist Nicole Nguyen details best practices for using the chatbots while protecting your privacy. In this episode, we dive into an area where the temptation to tap generative AI tools is very strong: work! We’ll tell you about the risks your new helper brings and how not to give away company secrets while using them."
    },
    {
        "company": "AAPL",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The White House Protests on Signal",
        "date": "2025-03-26",
        "summary": "Steve Witkoff explains his security protocols while in Russia."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "What to Know About Trump’s Latest Tariffs",
        "date": "2025-04-16",
        "summary": "President Trump unveiled a new tariff regime, including 10% across-the-board tariffs on all imports and even higher rates for some countries. Here’s the latest."
    },
    {
        "company": "AAPL",
        "title": "Macron Suggests Retaliation Against U.S. Tech Services For Trump Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Viral Videos, Trade Tensions Drive U.S. Shoppers to Chinese App",
        "date": "2025-04-16",
        "summary": "The popularity of a Chinese e-commerce app has surged in the U.S., driven by a spate of viral TikTok videos amid the trade war between the world’s two largest economies."
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Buy the Yips",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Audi and Porsche Recall Thousands of U.S. Cars on Software Issues",
        "date": "2025-04-14",
        "summary": "Some 2021 model year Audi cars were affected by the problem, which could cause the virtual cockpit instrument cluster to shut down."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs: Where Things Stand",
        "date": "2025-04-15",
        "summary": "The basics on the president’s far-reaching protectionist agenda."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "They Went to the Masters. They Ditched Their Cellphones. Then the Markets Went Completely Crazy.",
        "date": "2025-04-10",
        "summary": "Augusta National is one of the last places on Earth where fans are forced to disconnect, leaving finance bros in the dark about Wednesday’s market drama."
    },
    {
        "company": "AAPL",
        "title": "The Latest Tariff Exemptions, By the Numbers",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Takes Tough Approach to Choking Off China’s Access to U.S. Tech",
        "date": "2025-03-26",
        "summary": "The move is the clearest signal yet that the Trump administration intends to further limit what kind of American technology Chinese companies can buy."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "AAPL",
        "title": "China Cites Apple, Tesla and Soybeans in Argument Against Trade War",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Global Markets Rise on Tech Tariff Reprieve ",
        "date": "2025-04-14",
        "summary": "Stocks gained after Trump exempted semiconductor equipment, smartphones and other electronics from tariffs, even though officials later signaled they would be put in their own levy bracket."
    },
    {
        "company": "AAPL",
        "title": "Accused Tech Spy Says Rival CEO Recruited Him With Offer to Be Like James Bond",
        "date": "2025-04-02",
        "summary": "An alleged spying plot in the payroll-services industry involves allegations by a former employee of Rippling that he was recruited to feed the company’s private information to a competitor, Deel."
    },
    {
        "company": "AAPL",
        "title": "Trade Wars Can Discourage Domestic Production",
        "date": "2025-04-14",
        "summary": "Companies that sell products internationally may find it advantageous to avoid tariffs by building factories closer to their customers."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Trade War Deepens Threat to U.S. Brands in China",
        "date": "2025-04-15",
        "summary": "The tariff fight is deepening Chinese consumers’ preference for domestic goods."
    },
    {
        "company": "AAPL",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Huawei Posts Profit Drop But Revenue Signals Solid Comeback",
        "date": "2025-03-31",
        "summary": "The Chinese technology giant’s net profit fell in 2024 as higher expenses weighed, but solid revenue growth signals that the company is making a comeback after years of heavy U.S. sanctions that have affected its businesses."
    },
    {
        "company": "AAPL",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "AAPL",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "AAPL",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "‘Fewer Choices and Higher Prices’: The Supply Chain of the Future",
        "date": "2025-04-05",
        "summary": "Tariff increases are likely to be passed on to consumers while companies look for cheaper locations."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Mark Klein, a Whistleblower Who Revealed Domestic Spying, Dies at 79",
        "date": "2025-04-11",
        "summary": "The AT&T technician predated Edward Snowden by seven years, but his allegations were never able to achieve traction."
    },
    {
        "company": "AAPL",
        "title": "Telus Exploring Tower-Network-Stake Sale to Support Deleveraging Plan, CFO Says",
        "date": "2025-03-26",
        "summary": "The Canadian telecommunications company has been actively working on its deleveraging plan, which includes exploring the sale of a stake in its cell-phone tower network and divesting its real estate and copper assets."
    },
    {
        "company": "AAPL",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "AAPL",
        "title": "AI Tools Help Alzheimer’s Researchers Dig Into Data",
        "date": "2025-03-27",
        "summary": "The Oxford Drug Discovery Institute uses artificial intelligence-powered databases "
    },
    {
        "company": "AAPL",
        "title": "Trade Historian Douglas Irwin on Trump's Unprecedented Tariff Shock",
        "date": "2025-04-14",
        "summary": "Paul Gigot interviews Dartmouth economist Douglas Irwin on why Trump's tariffs are unlike any other in U.S. history, how they will change the global trading system, and what to do about the special case of China."
    }
]