[
    {
        "company": "AAPL",
        "title": "The 27 Best Deals to Shop Online Right Now",
        "date": "2025-04-24",
        "summary": "These are tested and vetted markdowns you won’t want to miss."
    },
    {
        "company": "AAPL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "AAPL",
        "title": "Warren Buffett Timed His Apple Stock Sale to Perfection. What’s Next?",
        "date": "2025-04-22",
        "summary": "Berkshire Hathaway’s huge cash pile has investors wondering what he will buy and when."
    },
    {
        "company": "AAPL",
        "title": "Apple, Meta Fined by EU, Ordered to Comply With Tech Competition Rules",
        "date": "2025-04-23",
        "summary": "The move risks ratcheting up tensions with the Trump administration as EU officials pursue trade talks."
    },
    {
        "company": "AAPL",
        "title": "Here’s What’s Worth Buying During Apple’s Trade-In Promo",
        "date": "2025-04-16",
        "summary": "And what you should buy from Amazon instead."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With Nothing But Hard Choices—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple-Linked Tech Stocks Are Hard-Hit in Asia",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Sales Surged Saturday Due to Tariff-Related Price Hike Fears",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Can Robots Make Sneakers? Just Ask Nike.",
        "date": "2025-04-22",
        "summary": "President Trump wants more products to be made in the U.S., pushing some companies toward robotics in a bid to avoid high labor costs. But WSJ reporter Jon Emont says "
    },
    {
        "company": "AAPL",
        "title": "EU Delayed Punishing Apple, Meta Just Before Trade Talks Started",
        "date": "2025-04-18",
        "summary": "The bloc postponed penalties, temporarily avoiding a conflict with the Trump administration during a week in which it ramped up its push for a trade deal with the U.S."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Why Airbus’s Plans for a Green Jet Remain Grounded",
        "date": "2025-04-23",
        "summary": "Airbus’s"
    },
    {
        "company": "AAPL",
        "title": "Visa Offers Apple Roughly $100 Million to Take Over Credit Card From Mastercard",
        "date": "2025-04-01",
        "summary": "Visa, Amex and Mastercard are all competing to be the network for the tech giant’s credit card."
    },
    {
        "company": "AAPL",
        "title": "From Ken Griffin to Robinhood: The Donors Who Funded Trump’s Inauguration Revealed",
        "date": "2025-04-18",
        "summary": "President Trump’s inaugural committee raised almost $250 million from Corporate America, more than doubling the previous record."
    },
    {
        "company": "AAPL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "AAPL",
        "title": "Trump Presses Harvard to Turn Over Foreign Funding Records",
        "date": "2025-04-18",
        "summary": "Plus: The EU postpones punishing Apple and Meta. And the U.S. accuses China of aiding the Houthis in Yemen.  Zoe Kuhlkin hosts. "
    },
    {
        "company": "AAPL",
        "title": "What Apple Has at Stake in China",
        "date": "2025-04-12",
        "summary": "The iPhone-maker just received some reprieve from tariffs, but is still heavily reliant on the Chinese manufacturing economy it helped build."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "AAPL",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "AAPL",
        "title": "Shares of Apple Suppliers in Asia Regain Ground",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "The Lessons of Trump’s Tariff Exemptions",
        "date": "2025-04-13",
        "summary": "It’s good to be Apple’s Tim Cook but not to be a small manufacturer that can’t afford a K Street lobbyist."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Stock Needs a Trump Discount: Heard on the Street",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple’s Margins Are Still a Big Risk in Trade War Roller Coaster: Heard on the Street",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Built iPhone Inventory Ahead of Tariff War, Data Show",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "To Navigate Trump’s Tariffs, Apple and Nintendo Take Different Paths",
        "date": "2025-04-15",
        "summary": "Apple CEO "
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-13",
        "summary": "The CEO managed to help the iPhone avoid another U.S. battle with China."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Some iPhone Users Upgrade, Fearing Tariff-Induced Price Hike",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Says It Intends to Export From Vietnam Even With Tariffs",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "How Bad Was This Week in the Stock Market?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "AAPL",
        "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
        "date": "2025-04-14",
        "summary": "The chip maker’s plan to build AI tech in Texas comes on the heels of a new tariff threat."
    },
    {
        "company": "AAPL",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": "Levies on Chinese goods have created worst three-day rout for iPhone maker in about 25 years."
    },
    {
        "company": "AAPL",
        "title": "Despite the Trade War, Chip Maker TSMC Remains Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": "Plus, Japan and Italy try to find common ground with the White House on trade. And Trump officials have requested that the IRS start the process of revoking Harvard’s tax-exempt status. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Exceptional Tariff Weekend",
        "date": "2025-04-13",
        "summary": "His Customs office announced tariff-rate exceptions on electronics on Friday that he renounced on Sunday. "
    },
    {
        "company": "AAPL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "AAPL",
        "title": "Why We Don’t Have a Made-in-America iPhone",
        "date": "2025-04-08",
        "summary": "President Trump’s tariffs aim to bring manufacturing back to the U.S.—including iPhones. WSJ’s Joanna Stern breaks down exactly how tough it would be to build iPhones here, and how tariffs could affect the price of your next phone."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-07",
        "summary": "Customers said they aren’t waiting to see if iPhone costs increase."
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "France Fines Apple $162 Million, Risking Trump’s Ire",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple Loses Ground in China’s Smartphone Market as Local Rivals Gain",
        "date": "2025-04-18",
        "summary": "Apple lost its top spot in China’s smartphone market, dethroned by local rival Xiaomi as Beijing’s consumption-boosting subsidies help buoy demand for cheaper products."
    },
    {
        "company": "AAPL",
        "title": "Apple Fined $162 Million in France Over App Tracking Transparency ",
        "date": "2025-03-31",
        "summary": "France’s competition regulator fined Apple over concerns the company abused its dominant position in mobile apps through its iPhone and iPad’s operating system."
    },
    {
        "company": "AAPL",
        "title": "The Ripple Effect Trump’s Tariffs Will Have on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "It isn’t just inflation. Manufacturing and artificial intelligence are at risk, too."
    },
    {
        "company": "AAPL",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Supplier Luxshare to Maintain Vietnam Production Hub to Support U.S. Market",
        "date": "2025-04-09",
        "summary": "Luxshare Precision Industry, a key assembler of the iPhone and other Apple products, said it will maintain large-scale production in Vietnam and continue exports from there to the U.S., responding to President Trump’s tariffs."
    },
    {
        "company": "AAPL",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "AAPL",
        "title": "TSMC Maintains Solid 2025 Outlook Despite Tariff Worries",
        "date": "2025-04-17",
        "summary": "The world’s largest contract chip maker remains confident that it can post solid sales growth this year."
    },
    {
        "company": "AAPL",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "AAPL",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Canada’s auto industry, Delta, Mercedes-Benz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "AAPL",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What Tech Exemptions Were Released Friday?",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "An American-Made iPhone: Just Expensive or Completely Impossible?",
        "date": "2025-04-09",
        "summary": "Trump’s tariffs aim to bring manufacturing back to the U.S. So what—besides magic—would it take to make iPhones here?"
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": "This is what Apple pays for components inside its bestselling phone, and how Trump’s China tariffs could raise the bill."
    },
    {
        "company": "AAPL",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-31",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "All-Purpose Makeup Is Everywhere. Do 5-in-1 Products Really Work?",
        "date": "2025-04-11",
        "summary": "Too busy to fuss with a bag full of makeup? Today’s products are promising multiuse benefits to streamline your morning. We put two to the test."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Looks at Tariff Pause for Some Autos",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Which Exemption Requests Were Granted vs. Denied During Trump’s First Term?",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Exported More Than $17 Billion of iPhones From India Last Year",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Markets Tumble as Donald Trump’s Tariff ‘Liberation Day’ Finally Arrives",
        "date": "2025-04-03",
        "summary": "Donald Trump delivers on his promise of sweeping tariffs, causing markets to plunge in response. The White House says the long-term gain will be worth the short-term pain, but how will the American consumer and the world at large be affected?  "
    },
    {
        "company": "AAPL",
        "title": "Q&A: What Can We Learn From Tariff Exemptions in Trump’s First Term?",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "‘McAtlas’: McNuggets the World Over",
        "date": "2025-04-04",
        "summary": "Part of the global appeal of McDonald’s is its cultural flexibility. Meatless burgers are offered in India, while Czech diners can order a beer to go with a Big Mac."
    },
    {
        "company": "AAPL",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "AAPL",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "AAPL",
        "title": "Apple Users Rush to Upgrade iPhones Ahead of Potential Tariffs-Related Price Hikes",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Recap: Tariff Wipeout",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "AAPL",
        "title": "Meet Elon Musk’s ‘Dark MAGA’ Acolytes",
        "date": "2025-03-31",
        "summary": "The billionaire CEO’s army of supporters wears black caps, jeans and slogan T-shirts."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Scrambles to Finalize ‘Liberation Day’ Tariff Plans",
        "date": "2025-03-31",
        "summary": "Plus, President Trump expresses anger at Russia’s Vladimir Putin with little progress made on Ukraine ceasefire talks. And Apple and Elon Musk’s SpaceX are feuding over satellite service as they race to eliminate cellphone dead spots. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Black Monday? The S&P 500 is Crashing Like It's 1987",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "AAPL",
        "title": "Chatbot Confidential: When AI at Work Is Risky Business",
        "date": "2025-04-06",
        "summary": "Gen AI chatbots have changed how we work. Today, we bring you the second installment of Tech News Briefing’s special series “Chatbot Confidential,” where WSJ personal tech columnist Nicole Nguyen details best practices for using the chatbots while protecting your privacy. In this episode, we dive into an area where the temptation to tap generative AI tools is very strong: work! We’ll tell you about the risks your new helper brings and how not to give away company secrets while using them."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Adds Tougher Limits on China’s Access to U.S. Technology",
        "date": "2025-03-26",
        "summary": "Plus, AI startup Anthropic wins in court over copyrighted music. And, Gamestop’s play in bitcoin boosts its stock. Victoria Craig hosts."
    }
]