[
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-13",
        "summary": "The CEO managed to help the iPhone avoid another U.S. battle with China."
    },
    {
        "company": "AAPL",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "To Navigate Trump’s Tariffs, Apple and Nintendo Take Different Paths",
        "date": "2025-04-15",
        "summary": "Apple CEO "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "What Apple Has at Stake in China",
        "date": "2025-04-12",
        "summary": "The iPhone-maker just received some reprieve from tariffs, but is still heavily reliant on the Chinese manufacturing economy it helped build."
    },
    {
        "company": "AAPL",
        "title": "The Lessons of Trump’s Tariff Exemptions",
        "date": "2025-04-13",
        "summary": "It’s good to be Apple’s Tim Cook but not to be a small manufacturer that can’t afford a K Street lobbyist."
    },
    {
        "company": "AAPL",
        "title": "From Ken Griffin to Robinhood: The Donors Who Funded Trump’s Inauguration Revealed",
        "date": "2025-04-18",
        "summary": "President Trump’s inaugural committee raised almost $250 million from Corporate America, more than doubling the previous record."
    },
    {
        "company": "AAPL",
        "title": "Intel Cuts Outlook, Says Layoffs Are in Store",
        "date": "2025-04-24",
        "summary": "The American chip-making giant’s stock fell after it said an overhaul is under way and that macro conditions would prove challenging."
    },
    {
        "company": "AAPL",
        "title": "‘Chef’s Table: Legends’ Review: On Netflix, How to Hone a Palate",
        "date": "2025-04-25",
        "summary": "The Netflix series returns with a celebration of Thomas Keller, José Andrés, Jamie Oliver and Alice Waters, all of whom share a devotion to elevating eaters’ expectations."
    },
    {
        "company": "AAPL",
        "title": "Elon Musk Is Stepping Back From DOGE. Can He Really Stay Away?",
        "date": "2025-04-25",
        "summary": "Elon Musk says he’s going to spend less time in Washington and more time running Tesla. WSJ columnist and Musk-watcher Tim Higgins unpacks what that plan might look like in reality. Also, the WSJ’s Isabelle Bousquette takes us inside "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Former Vice President Mike Pence Grades Trump 2.0",
        "date": "2025-04-22",
        "summary": "As the second Donald Trump administration nears its first 100 days, how does it compare to the first? On this episode of All Things, former Vice President Mike Pence shares with Kim Strassel his view on what this Trump team is getting right (hint: China tariffs), as well as what it's getting wrong (hint: broad-based tariffs). He warns Republicans against the “bad politics” of raising taxes, explains the mistake of not enforcing the TikTok ban, and talks about his work as the founder of the conservative advocacy group, Advancing American Freedom."
    },
    {
        "company": "AAPL",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "AAPL",
        "title": "Trump 2.0: Where Is The Economy Headed?",
        "date": "2025-04-25",
        "summary": "President Trump’s "
    },
    {
        "company": "AAPL",
        "title": "Can Robots Make Sneakers? Just Ask Nike.",
        "date": "2025-04-22",
        "summary": "President Trump wants more products to be made in the U.S., pushing some companies toward robotics in a bid to avoid high labor costs. But WSJ reporter Jon Emont says "
    },
    {
        "company": "AAPL",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "AAPL",
        "title": "The Morgan Stanley Star Now Leading Trump’s Invest-in-America Push ",
        "date": "2025-04-24",
        "summary": "Michael Grimes will helm a new initiative brokering investments for the “America First” agenda."
    },
    {
        "company": "AAPL",
        "title": "Trump’s 100-Day Opportunity",
        "date": "2025-04-24",
        "summary": "The president has lost control of the narrative, but he has a chance to retake it."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "AAPL",
        "title": "Our Capitulation Nation",
        "date": "2025-04-20",
        "summary": "Everybody’s folding, from Trump and Democrats to law firms and universities."
    },
    {
        "company": "AAPL",
        "title": "Our Capitulation Nation",
        "date": "2025-04-20",
        "summary": "Everybody’s folding, from Trump and Democrats to law firms and universities."
    },
    {
        "company": "AAPL",
        "title": "Trump Follows but Rebrands Biden’s Semiconductor Policy",
        "date": "2025-04-20",
        "summary": "Whether you call such an effort the Chips Act or the Investment Accelerator, the goal remains the same."
    },
    {
        "company": "AAPL",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "AAPL",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "AAPL",
        "title": "Next Deal for Top Tech Banker: Drive More Investments to the U.S.",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump’s Biggest Meme-Coin Investors Get Invited to Dinner With the President",
        "date": "2025-04-24",
        "summary": "The price of $TRUMP soared on news of a gala for major token holders, raising conflict-of-interest concerns."
    },
    {
        "company": "AAPL",
        "title": "Asian Stocks Buoyed by Hopes of Easing U.S.-China Tensions",
        "date": "2025-04-23",
        "summary": "Hopes for easing trade tensions between the U.S. and China, and President Trump saying he isn’t planning to fire Fed Chair Jerome Powell, lifted stocks in the region."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Pope Francis Leaves Behind a Church That’s More Global—and More Divided",
        "date": "2025-04-22",
        "summary": "The pope transformed the church’s senior leadership, exposing growing differences over teachings. “Once you start opening the door, then there is confusion and also ambiguity in the doctrines,” says one cardinal."
    },
    {
        "company": "AAPL",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "How Chili’s Won When America Raged About Fast-Food Prices",
        "date": "2025-04-25",
        "summary": "Chili’s has turned inflation into a marketing pitch, and when its fried cheese went viral, “it was almost like a spark.”"
    },
    {
        "company": "AAPL",
        "title": "Trump Meets His Match: The Markets",
        "date": "2025-04-24",
        "summary": "The president has softened his economic and trade stances in the midst of market turmoil."
    },
    {
        "company": "AAPL",
        "title": "As Catholic Church Enters New Era, Conservative U.S. Members Push It Right",
        "date": "2025-04-21",
        "summary": "Adherents are reviving old practices and growing more assertive in the battle for the future of the Church—and the nation."
    },
    {
        "company": "AAPL",
        "title": "Warren Buffett Timed His Apple Stock Sale to Perfection. What’s Next?",
        "date": "2025-04-22",
        "summary": "Berkshire Hathaway’s huge cash pile has investors wondering what he will buy and when."
    },
    {
        "company": "AAPL",
        "title": "Why Trump Decided Not to Try to Fire Jerome Powell",
        "date": "2025-04-23",
        "summary": "White House lawyers were studying legal options for ousting the Fed chair, but senior advisers warned Trump that attempting to do so would rattle markets."
    },
    {
        "company": "AAPL",
        "title": "Is Trump a Tyrant or a Savior? Maybe Just a Bumbler",
        "date": "2025-04-21",
        "summary": "The goals of his second term are ambitious. But so far the execution has been strikingly incompetent."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "How DOGE Plans to Plow Ahead Without Musk at the Helm",
        "date": "2025-04-24",
        "summary": "The Tesla CEO’s White House role is expected to diminish in the coming weeks."
    },
    {
        "company": "AAPL",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "AAPL",
        "title": "The Trump Touch - Is America's Leadership Failing?",
        "date": "2025-04-23",
        "summary": "President Donald Trump's multi-front attempt to remake America and the world is meeting with mixed success. His administration has ended the crisis at the border and is aggressively moving against illegal migrants. But elsewhere the picture is murky. The war in Ukraine rages on, the Middle East continues unsettled and above all, his restless back-and-forth on tariffs and international economics is causing profound damage to faith in U.S. economic stability.  And some of his actions suggest an authoritarian style inimical to American values.  "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "Is This Trump’s Mitterrand Moment?",
        "date": "2025-04-23",
        "summary": "The French President saved his government by giving up socialism. It’s a precedent for tariffs."
    },
    {
        "company": "AAPL",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "AAPL",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Google Faces Its Monopoly Reckoning",
        "date": "2025-04-20",
        "summary": "The Justice Department’s proposal that the company share data, shed its Chrome browser, and cease exclusionary contracts deserves broad support. "
    },
    {
        "company": "AAPL",
        "title": "California Coastal Commission Unites Musk and Newsom",
        "date": "2025-04-18",
        "summary": "It stands in the way of both rebuilding fire-ravaged Los Angeles and SpaceX launches at Vandenberg."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Russia Launches Major Assault on Kyiv",
        "date": "2025-04-24",
        "summary": "A.M. Edition for April 24. Moscow has "
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "AAPL",
        "title": "Trump Is Everywhere Except in the Economic Data",
        "date": "2025-04-21",
        "summary": "Fears that tariffs, spending cuts and deportations would lead to recession and inflation have yet to show up in the numbers."
    },
    {
        "company": "AAPL",
        "title": " Paul Gigot and John Yoo on Donald Trump, the Courts and Presidential Power",
        "date": "2025-04-21",
        "summary": "Donald Trump keeps testing the limits of his executive authority, and courts have been pushing back. Is a constitutional crisis on the horizon? On this episode of Potomac Watch, law professor John Yoo speaks to Paul Gigot about what could be a looming clash between the President and the Supreme Court."
    },
    {
        "company": "AAPL",
        "title": "The Ripple Effect Trump’s Tariffs Will Have on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "It isn’t just inflation. Manufacturing and artificial intelligence are at risk, too."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Continue Rally for Second Day",
        "date": "2025-04-23",
        "summary": "Plus: The White House says there will be \"no unilateral reduction in tariffs against China.\" And OpenAI CEO Sam Altman says he is stepping down as chairman of the nuclear-energy startup Oklo. Anthony Bansie hosts."
    },
    {
        "company": "AAPL",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Video: Trump Praises Musk, as Tesla CEO Reduces DOGE Time",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Uber Sued Over Cancellation Practices",
        "date": "2025-04-21",
        "summary": "Plus: The Justice Department asks a federal judge to force Google to sell its Chrome web browser. And crypto firms swoop in on the banking world with applications for charters. Katie Deighton hosts."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Zuckerberg Continues to Lobby Trump",
        "date": "2025-04-02",
        "summary": "Plus, two big tech companies bid for TikTok. And Nintendo stays in the game with its coming Switch 2 release. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "How to Find Internet Fame in 2025: Talk Tariffs",
        "date": "2025-04-01",
        "summary": "The relatively prosaic world of import duties has become a surprise social-media hit, driving millions of views for some internet personalities and trade experts."
    },
    {
        "company": "AAPL",
        "title": "Trump Considers Tariff Exemptions for Tech, Car Companies",
        "date": "2025-04-14",
        "summary": "President Trump said he was considering short-term tariff exemptions for auto companies in the Oval Office on Monday. He said he exempted smartphones from recent tariffs. "
    },
    {
        "company": "AAPL",
        "title": "Inside Elon Musk’s Shock-and-Awe Months in the White House",
        "date": "2025-04-05",
        "summary": "President Trump directed his chief of staff to better manage the billionaire adviser after complaints arose from his cabinet and staff."
    },
    {
        "company": "AAPL",
        "title": "An American-Made iPhone: Just Expensive or Completely Impossible?",
        "date": "2025-04-09",
        "summary": "Trump’s tariffs aim to bring manufacturing back to the U.S. So what—besides magic—would it take to make iPhones here?"
    },
    {
        "company": "AAPL",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "AAPL",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "AAPL",
        "title": "Trust Unshaken: Trump Voters Are Sticking With Their Guy",
        "date": "2025-04-11",
        "summary": "The prospect of economic upheaval hasn’t disturbed the personal bond between the president and the MAGA movement: ‘There’s a method to his madness.’"
    },
    {
        "company": "AAPL",
        "title": "The Clock Is Ticking Loudly for Intel’s New Boss",
        "date": "2025-04-01",
        "summary": "Lip-Bu Tan isn’t yet signaling a major departure from Intel’s past strategy, but expectations for change are high."
    },
    {
        "company": "AAPL",
        "title": "It’s Not a Bird, or a Plane: It’s Your Walmart Delivery",
        "date": "2025-03-28",
        "summary": "Drone-delivery company Zipline aims to safely—and quietly—drop packages to consumers. Plus, WSJ columnist Tim Higgins tells us about the latest in the duality of Elon Musk the "
    },
    {
        "company": "AAPL",
        "title": "Trump Looks at Tariff Pause for Some Autos",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "AAPL",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "More Democrats Call It “Corruption” When Talking About Trump’s Trade War",
        "date": "2025-04-13",
        "summary": "Sen. Elizabeth Warren and Kentucky Gov. Andy Beshear criticized President Trump’s tariff policies, calling the trade war “corruption.”"
    },
    {
        "company": "AAPL",
        "title": "Could Google Be Forced to Break Up After District Judge’s Ruling?",
        "date": "2025-04-18",
        "summary": "A U.S. district judge ruled "
    },
    {
        "company": "AAPL",
        "title": "Elon Musk’s Mr. Fix-It Takes Center Stage During a Really Bad Week",
        "date": "2025-04-05",
        "summary": "Antonio Gracias made a rare public appearance alongside his friend as he helps with DOGE."
    },
    {
        "company": "AAPL",
        "title": "Despite the Trade War, Chip Maker TSMC Remains Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": "Plus, Japan and Italy try to find common ground with the White House on trade. And Trump officials have requested that the IRS start the process of revoking Harvard’s tax-exempt status. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump Signals He’s Willing to Make Deals to Lower Tariffs",
        "date": "2025-04-03",
        "summary": "President Trump spoke to reporters on board Air Force One, a day after he announced a 10% across-the-board tariff on U.S. imports. "
    },
    {
        "company": "AAPL",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "AAPL",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Lifestyles of the Rich and Famous and Progressive",
        "date": "2025-04-08",
        "summary": "AOC’s flight to populism gets bumpy."
    },
    {
        "company": "AAPL",
        "title": "Trump Announces 10% Baseline Tariff, Reciprocal Tariffs on Some Nations",
        "date": "2025-04-02",
        "summary": "President Trump announced a slate of reciprocal tariffs against certain nations and a 10% across-the-board tariff, at a Rose Garden event he’s called “Liberation Day.” "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Why We Don’t Have a Made-in-America iPhone",
        "date": "2025-04-08",
        "summary": "President Trump’s tariffs aim to bring manufacturing back to the U.S.—including iPhones. WSJ’s Joanna Stern breaks down exactly how tough it would be to build iPhones here, and how tariffs could affect the price of your next phone."
    },
    {
        "company": "AAPL",
        "title": " TNB Tech Minute: TikTok Lives On…For Now",
        "date": "2025-04-04",
        "summary": "Plus, the Magnificent Seven continue their stock-market slide. And fintechs put their IPO roadshows on hold. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "TSMC Maintains Solid 2025 Outlook Despite Tariff Worries",
        "date": "2025-04-17",
        "summary": "The world’s largest contract chip maker remains confident that it can post solid sales growth this year."
    },
    {
        "company": "AAPL",
        "title": "Lutnick’s Strategy Flummoxes Business Leaders and White House Aides",
        "date": "2025-04-08",
        "summary": "The commerce secretary is playing a supersize role in the Trump administration. But in doing so, he has taken contradictory positions on key issues, leading to exasperation on the part of those interacting with him."
    },
    {
        "company": "AAPL",
        "title": "Inside Mark Zuckerberg’s Failed Negotiations to End Antitrust Case",
        "date": "2025-04-15",
        "summary": "The FTC wanted $30 billion to drop its case. Zuckerberg offered much less and hoped Trump would back him up."
    },
    {
        "company": "AAPL",
        "title": "The Kid Rock-Kamala Coalition",
        "date": "2025-04-02",
        "summary": "Voters rejected Harris, but one of her bad ideas makes a comeback."
    },
    {
        "company": "AAPL",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "AAPL",
        "title": "The New Pepsi Challenge: Saving Pepsi From Years of Decline",
        "date": "2025-04-03",
        "summary": "After its cola dropped to No. 3, PepsiCo is trying to win back soda drinkers; “maybe we lost the focus.”"
    },
    {
        "company": "AAPL",
        "title": "Trump Says ‘I Can’t Tell You’ What Will Happen With Markets",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Apple Plans to Source More iPhones From India as Potential Tariff Fix",
        "date": "2025-04-07",
        "summary": "Levies on Chinese goods have created worst three-day rout for iPhone maker in about 25 years."
    },
    {
        "company": "AAPL",
        "title": "Trump Grants 75-Day Extension to Reach TikTok Deal",
        "date": "2025-04-04",
        "summary": "The extension will give investors more time to reach an agreement to keep the app operating in the U.S."
    },
    {
        "company": "AAPL",
        "title": "Markets Tumble as Donald Trump’s Tariff ‘Liberation Day’ Finally Arrives",
        "date": "2025-04-03",
        "summary": "Donald Trump delivers on his promise of sweeping tariffs, causing markets to plunge in response. The White House says the long-term gain will be worth the short-term pain, but how will the American consumer and the world at large be affected?  "
    },
    {
        "company": "AAPL",
        "title": "He Started Out Driving Forklifts. 40 Years Later, He’s Costco’s CEO",
        "date": "2025-04-10",
        "summary": "Costco’s CEO Ron Vachris sat down with The Wall Street Journal to discuss how its $86 billion Kirkland Signature brand runs and why it allows Costco leverage over many big brands. "
    },
    {
        "company": "AAPL",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "AAPL",
        "title": "AppLovin Confirms Indication of Interest in TikTok Purchase",
        "date": "2025-04-03",
        "summary": "The Trump administration’s deadline to sell or shut down TikTok is Saturday."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Trump Signs Order Targeting Ticket Scalpers and Fees",
        "date": "2025-03-31",
        "summary": "The order calls for greater price transparency and stronger enforcement of unfair or anticompetitive ticket-resale practices."
    },
    {
        "company": "AAPL",
        "title": "Citigroup Reports Jump in Profit, Revenue",
        "date": "2025-04-15",
        "summary": "Citigroup reported a jump in profit and revenue in the first quarter of 2025 that beat analysts’ expectations, thanks in part to market volatility that generated higher fees for its trading business."
    },
    {
        "company": "AAPL",
        "title": "Trump Calls for ‘Highly Tailored’ Tariff Deals",
        "date": "2025-04-08",
        "summary": "President Trump said his administration was negotiating “highly tailored deals” with Japan and South Korea on tariffs. “I call them tailored deals, not off the rack,” Trump said."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Trump Takes Up Lawfare Against His First-Term Aides",
        "date": "2025-04-11",
        "summary": "His orders against Chris Krebs and Miles Taylor are what Democrats did to him."
    },
    {
        "company": "AAPL",
        "title": "Intel’s New CEO Plots Turnaround; ‘We Need to Improve’",
        "date": "2025-03-31",
        "summary": "Chief Executive Officer Lip-Bu Tan said customers told him Intel strayed from their needs and fell behind competitors on innovation."
    },
    {
        "company": "AAPL",
        "title": "What Trade War? Chip Maker TSMC Is Still Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Zuckerberg Lobbies Trump to Avoid Meta Antitrust Trial",
        "date": "2025-04-02",
        "summary": "Meta’s chief executive was at the White House on Wednesday, his third visit during Trump’s presidency,  according to people familiar with the matter."
    },
    {
        "company": "AAPL",
        "title": "Trump vs. the Vacuum",
        "date": "2025-04-01",
        "summary": "A weak president faces a dysfunctional opposition."
    },
    {
        "company": "AAPL",
        "title": "Making Sense of the Trade War",
        "date": "2025-04-08",
        "summary": "An inchoate Trump may yet point to a U.S. strategy to deal with China."
    },
    {
        "company": "AAPL",
        "title": "How Right Wing Influencer Laura Loomer Targeted Top Security Officials",
        "date": "2025-04-05",
        "summary": "The conspiracy theorist has been loyal to Trump for a decade. Now, she’s cashing in on her influence."
    },
    {
        "company": "AAPL",
        "title": "Costco’s Co-Founder on the Making of Kirkland Signature’s Success",
        "date": "2025-04-16",
        "summary": "Costco co-founder Jim Sinegal sat down with The Wall Street Journal to discuss how he built the $86 billion label Kirkland Signature and why he was so reluctant to get into the gasoline business. "
    },
    {
        "company": "AAPL",
        "title": "When Coffee Mate Made a ‘White Lotus’ Piña Colada Creamer, It Had No Idea How the Season Would End",
        "date": "2025-04-08",
        "summary": "The Nestlé-owned brand had one response to the show’s season finale: ‘Well this is awkward.’"
    },
    {
        "company": "AAPL",
        "title": "Roasted Duck, Plums and Cheese: The Bizarre Brews Fueling China’s Coffee War",
        "date": "2025-04-14",
        "summary": "Cafes are putting everything they can think of into drinks to stand out in hypercompetitive market."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
        "date": "2025-04-14",
        "summary": "The chip maker’s plan to build AI tech in Texas comes on the heels of a new tariff threat."
    },
    {
        "company": "AAPL",
        "title": "Treasury Secretary on Trump Tariffs: China Is the ‘Biggest Offender’",
        "date": "2025-04-09",
        "summary": "Treasury Secretary Scott Bessent, speaking at a banking convention in Washington, said he would begin taking a lead role in negotiations with other countries over tariffs. "
    },
    {
        "company": "AAPL",
        "title": "Trump Fires Director of National Security Agency",
        "date": "2025-04-04",
        "summary": "The dismissal of Gen. Tim Haugh comes after President Trump let go of several National Security Council officials."
    },
    {
        "company": "AAPL",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "The Billionaire Caught Between Trump and China",
        "date": "2025-04-15",
        "summary": "The Hong Kong-based company CK Hutchinson, led by "
    },
    {
        "company": "AAPL",
        "title": "Trump 2.0: Tariff Turnaround",
        "date": "2025-04-11",
        "summary": "Kate Linebaugh"
    },
    {
        "company": "AAPL",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Faith, Freedom and the Long Thread of Technology",
        "date": "2025-03-31",
        "summary": "As humanity pushes the boundaries of science and artificial intelligence, God is waiting in the wings."
    },
    {
        "company": "AAPL",
        "title": "Does Meta Have a Social Media Monopoly?",
        "date": "2025-04-17",
        "summary": "Mark Zuckerberg is in court defending Meta against a "
    },
    {
        "company": "AAPL",
        "title": "Trump Friend and ‘Envoy for Everything’ Steve Witkoff Embarks on High-Wire Diplomacy",
        "date": "2025-04-11",
        "summary": "The special envoy spoke to the Journal as he prepared to head to Oman for nuclear talks with Iran."
    },
    {
        "company": "AAPL",
        "title": "Is Lina Khan Back at the FTC?",
        "date": "2025-04-14",
        "summary": "Trump’s Chairman Andrew Ferguson sounds like Biden’s, warning businesses not to raise prices."
    },
    {
        "company": "AAPL",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Meet ‘Captain Condor,’ the Options Trader Whose Crew Can Move Markets",
        "date": "2025-04-16",
        "summary": "An options trader’s gutsy bets have drawn followers, and a few nicknames."
    },
    {
        "company": "AAPL",
        "title": "Accountants Finally Get the Sequel to Their Favorite Film: ‘The Accountant’",
        "date": "2025-04-17",
        "summary": "CPAs are geeked for the morale boost that only the bean-counting badass in the movie can provide; ‘It’s our ‘John Wick.‘’"
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "The Art of the 90-Day Tariff Pause",
        "date": "2025-04-09",
        "summary": "This chaos has been bad for everyone. Can the master negotiator now turn it around?"
    },
    {
        "company": "AAPL",
        "title": "Welcome to Trump’s Reality",
        "date": "2025-04-11",
        "summary": "The difference between the president and Steve Jobs."
    },
    {
        "company": "AAPL",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Watch: Trump Speaks From Oval Office as Tariffs Rattle Stock Market",
        "date": "2025-04-07",
        "summary": "President Trump threatened an additional 50% tariff on China if it didn’t remove its retaliatory tariff but left the door open for negotiations with other countries."
    },
    {
        "company": "AAPL",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "AAPL",
        "title": "Where Did the Republican Free-Traders Go?",
        "date": "2025-04-09",
        "summary": "Donald Trump's trade wars are roiling global business and financial markets, with China and the EU moving to retaliate. Yet only a handful of Republicans in Congress are pushing back, despite the GOP's past support for an open economy. Plus, the disruption raises pressure on Capitol Hill to pass a tax bill, and listeners write in with questions about the president's tariff strategy."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs Force a New Era in Global Trade",
        "date": "2025-04-03",
        "summary": "Yesterday, in the Rose Garden, President Trump sent out a clear message: "
    },
    {
        "company": "AAPL",
        "title": "White House on Trade Deals: The Phones Are Ringing off the Hooks",
        "date": "2025-04-11",
        "summary": "White House Press Secretary Karoline Leavitt said more than 75 countries are eager to negotiate tariff deals with President Trump."
    },
    {
        "company": "AAPL",
        "title": "The Secrets and Misdirection Behind Sam Altman’s Firing From OpenAI",
        "date": "2025-03-28",
        "summary": "The inside story of how the CEO of the hottest tech company was ousted and, just as quickly, resurrected."
    },
    {
        "company": "AAPL",
        "title": "Trump Says Vietnam Wants to Cut Its Tariffs to Zero",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "America Gets Trump Fatigue",
        "date": "2025-04-16",
        "summary": "His frenzied pace and lack of focus leave many voters worried and confused."
    },
    {
        "company": "AAPL",
        "title": "Trump to Review Preliminary TikTok Deal As Deadline Approaches",
        "date": "2025-04-02",
        "summary": "Senior administration officials are expected to attend a Wednesday meeting about a potential deal; plan would require Beijing’s blessing."
    },
    {
        "company": "AAPL",
        "title": "The New Right Now Agrees With the Old Left",
        "date": "2025-04-07",
        "summary": "Both camps want permanent protectionism to eliminate the trade deficit."
    },
    {
        "company": "AAPL",
        "title": "In Secret Meeting, China Acknowledged Role in U.S. Infrastructure Hacks",
        "date": "2025-04-10",
        "summary": "A senior Chinese official linked intrusions to escalating U.S. support for Taiwan."
    },
    {
        "company": "AAPL",
        "title": "Coming Soon: Bold Names Season Three",
        "date": "2025-04-11",
        "summary": "Every day, Wall Street Journal reporters talk with the most powerful, influential and interesting people. On the next season of WSJ’s Bold Names podcast, columnists "
    },
    {
        "company": "AAPL",
        "title": "All Things With Kim Strassel: Dana Perino Dishes Life Advice.",
        "date": "2025-04-15",
        "summary": "Drawing on her time as a former White House press secretary and Fox News host--and the entertaining life stories of friends and colleagues--Dana Perino in this episode of All Things discusses the big takeaways of her new book, \"I Wish Someone Had Told Me,\" an advice guide for graduates and professionals. She also grades the Trump administration on its first months' communications strategy, and talks with Kim Strassel about how things have changed--for better and for worse--for a younger generation headed into the workforce. "
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Says 90-Day Tariff Pause Was Because of ‘Yippy’ Reaction",
        "date": "2025-04-09",
        "summary": "President Trump announced he would impose a 125% tariff on China for retaliating against the U.S., while also announcing a 90-day pause on some tariffs. "
    },
    {
        "company": "AAPL",
        "title": "Wall Street Starts to Speak Out Against Trump’s Tariffs",
        "date": "2025-04-07",
        "summary": "Stan Druckenmiller, Bill Ackman and Jamie Dimon are among those raising concerns about the president’s steep, across-the-globe levies."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: OpenAI’s $40 Billion Funding Round Has a Catch",
        "date": "2025-03-28",
        "summary": "Plus, CoreWeave’s much-anticipated IPO flounders. And, President Trump adds Nikola’s founder to his raft of pardons. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump, Unbowed, Is Enacting Change on Scale Rarely Seen Before",
        "date": "2025-04-07",
        "summary": "Financial markets, universities, law firms and world leaders are reeling from the president’s agenda. White House officials say this was always the plan."
    },
    {
        "company": "AAPL",
        "title": "Electronics Exemption Trims U.S. Tariff Rate",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump Blinks on Tariffs, Again, for Now",
        "date": "2025-04-09",
        "summary": "The President pauses on some tariffs amid a bond rout and recession fears."
    },
    {
        "company": "AAPL",
        "title": "Can Pepsi Make a Comeback? ",
        "date": "2025-04-11",
        "summary": "After decades of fighting Coca-Cola to be the nation’s favorite soda, Pepsi dropped to third place, after Dr Pepper. Now "
    },
    {
        "company": "AAPL",
        "title": "A Televangelist Finds Herself at Home in Trump’s White House",
        "date": "2025-04-17",
        "summary": "Paula White, a longtime friend of the president, mixes prayer, politics and fundraising for her ministry. “We pray for God to use him.”"
    },
    {
        "company": "AAPL",
        "title": "‘Your Friends and Neighbors’ Review: Jon Hamm’s Upscale Crime Spree",
        "date": "2025-04-10",
        "summary": "The actor stars in a black comedy on Apple TV+ about a wealthy suburban man who, having recently lost his job at a hedge fund, starts burgling his neighbors’ homes."
    },
    {
        "company": "AAPL",
        "title": "‘Heartbreaker’: Runnin’ Down a Guitarist’s Dream",
        "date": "2025-04-11",
        "summary": "As a guitarist with Tom Petty and the Heartbreakers, Mike Campbell co-wrote many of the band’s breakthrough songs."
    },
    {
        "company": "AAPL",
        "title": "The Trump-Saudi Relationship Behind LIV Golf",
        "date": "2025-04-04",
        "summary": "President Trump’s Florida golf course is hosting a tournament for the Saudi-backed tour this weekend."
    },
    {
        "company": "AAPL",
        "title": "How ‘A Minecraft Movie’ Won With Memes and Deliberate Stupidity ",
        "date": "2025-04-14",
        "summary": "The video-game adaptation succeeded at both things cinema struggles to do consistently: sell gobs of tickets and get young people into theaters."
    },
    {
        "company": "AAPL",
        "title": "Trump and Powell on Collision Course Without Easy Escape ",
        "date": "2025-04-18",
        "summary": "The president wants an interest-rate cut, but his trade war has the Fed chair boxed in."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Adds Tougher Limits on China’s Access to U.S. Technology",
        "date": "2025-03-26",
        "summary": "Plus, AI startup Anthropic wins in court over copyrighted music. And, Gamestop’s play in bitcoin boosts its stock. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Nikola Founder Trevor Milton Details Call With Trump Ahead of Pardon",
        "date": "2025-03-29",
        "summary": "Nikola founder Trevor Milton, who was convicted of fraud in federal court for what prosecutors said were lies to investors about his zero-emission trucks, spoke with WSJ about his recent pardon by President Trump."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Exceptional Tariff Weekend",
        "date": "2025-04-13",
        "summary": "His Customs office announced tariff-rate exceptions on electronics on Friday that he renounced on Sunday. "
    },
    {
        "company": "AAPL",
        "title": "Trump and Musk Share the Founder’s Mindset ",
        "date": "2025-03-26",
        "summary": "Most modern presidents take a managerial approach to the job, which is no way to bring radical change."
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Japan Accuses Google of Being Anticompetitive",
        "date": "2025-04-15",
        "summary": "Plus: JPMorgan Chase, Bank of America and Bank of New York Mellon press pause on electronic communications with their regulator following an email hack. And Johnson & Johnson says tariffs will increase costs for its medical-technology products. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Asian Stocks Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s Behind Donald Trump’s Tariff Pause?",
        "date": "2025-04-10",
        "summary": "Donald Trump places a 90-day pause on the so-called reciprocal tariffs levied on countries around the world, but hits China with an even higher rate.  What is his strategy for dealing with Xi Jinping, and what will he demand from friends and foes during negotiations? "
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "AAPL",
        "title": "Apple-Linked Tech Stocks Are Hard-Hit in Asia",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "White House Announces End of ‘Biden’s Dumb War on Things That Work’",
        "date": "2025-04-10",
        "summary": "President promises benefits for consumers, his hair."
    },
    {
        "company": "AAPL",
        "title": "How the Company Making Nearly All Its Money From the Government Is Navigating Trump’s Cuts",
        "date": "2025-04-03",
        "summary": "Booz Allen’s CEO discusses the more than $1 billion in price concessions his firm has offered up and what its business will look like post-DOGE."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariff Man Peter Navarro Is Down but Not Out",
        "date": "2025-04-10",
        "summary": "The scrappy trade hawk who helped design the much-maligned formula for Trump’s reciprocal levies has the president’s ear and his loyalty."
    },
    {
        "company": "AAPL",
        "title": "How BlackRock’s Larry Fink Won Over Donald Trump",
        "date": "2025-04-05",
        "summary": "CEOs the world over are trying to get in good with President Trump. This Wall Street titan found a way."
    },
    {
        "company": "AAPL",
        "title": "How BlackRock’s Larry Fink Won Over Donald Trump",
        "date": "2025-04-05",
        "summary": "CEOs the world over are trying to get in good with President Trump. This Wall Street titan found a way."
    },
    {
        "company": "AAPL",
        "title": "Chili's Is Hot Again. Can CEO Kevin Hochman Keep It That Way?",
        "date": "2025-04-14",
        "summary": "Chili’s CEO Kevin Hochman has spent the past three years working to revive the chain. It’s paying off: Sales and traffic are up, even as the wider industry slides. He tells WSJ how he plans to keep up the heat."
    },
    {
        "company": "AAPL",
        "title": "Shares of Apple Suppliers in Asia Regain Ground",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Musk Knocks Trump’s Trade Philosophy",
        "date": "2025-04-07",
        "summary": "The comments from the Tesla CEO and DOGE leader revealed tensions within the administration over the president’s trade agenda."
    },
    {
        "company": "AAPL",
        "title": "‘The Thinking Machine’: From Denny’s to Dominance",
        "date": "2025-04-07",
        "summary": "Nvidia’s chief executive is not an easy boss, but he recognized that the company’s chips could power innovations in artificial intelligence."
    },
    {
        "company": "AAPL",
        "title": "Former Intel CEO Pat Gelsinger Makes a Few More Long-Shot Bets  ",
        "date": "2025-03-26",
        "summary": "The semiconductor titan that failed to turn around Intel is refocusing his energy on other challenges, like quantum computing and taking churches to the cloud."
    },
    {
        "company": "AAPL",
        "title": "China Wanted to Negotiate With Trump. Now It’s Arming for Another Trade War.",
        "date": "2025-04-06",
        "summary": "Communication between Washington and Beijing is at a standstill, raising the prospects of a long cycle of tariff retaliation. “Trump and Xi are locked in a paradox of pressure and pride.”"
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "AAPL",
        "title": "Harvard Hit With $2 Billion Government Funding Freeze",
        "date": "2025-04-15",
        "summary": "A.M. Edition for April 15. The Trump administration "
    },
    {
        "company": "AAPL",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Owns the Economy Now",
        "date": "2025-04-04",
        "summary": "He can try to blame the Fed, but the tariff blunder is his alone."
    },
    {
        "company": "AAPL",
        "title": "Trump Tariffs Aim to Bring Down Curtain on Era of Globalization",
        "date": "2025-04-03",
        "summary": "The president wants companies to return production to the U.S., but it won’t be easy."
    },
    {
        "company": "AAPL",
        "title": "Trump Pardons Nikola Founder Trevor Milton",
        "date": "2025-03-28",
        "summary": "Milton was convicted of fraud in 2022 for statements about zero-emission trucks."
    },
    {
        "company": "AAPL",
        "title": "After Tariff Climbdown, World Asks: Is It Method or Madness?",
        "date": "2025-04-10",
        "summary": "President Trump’s U-turn has left governments around the world pondering how to approach a U.S. that has become nearly impossible to predict."
    },
    {
        "company": "AAPL",
        "title": "White House Says Trump Tariffs Tomorrow Will Take Effect ‘Immediately’",
        "date": "2025-04-01",
        "summary": "P.M. Edition for April 1. Trump met with advisers to iron out the final details of his reciprocal tariff plans, as Canada and the EU prepare their responses. Plus, "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "AAPL",
        "title": "Will Trump Take Yes for an Answer?",
        "date": "2025-04-04",
        "summary": "Quick rewards for those who drop trade barriers will encourage others to do the same."
    },
    {
        "company": "AAPL",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Bank of America, Citigroup and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Climbdown for the Ages",
        "date": "2025-04-10",
        "summary": "The president has started scaring members of his base, and there’s life in the establishment yet."
    },
    {
        "company": "AAPL",
        "title": "Stocks Plummet as World Leaders Respond to Trump Tariff Blitz",
        "date": "2025-04-03",
        "summary": "U.S. stock indexes saw their biggest drop in value since March 2020, one day after President Trump announced a 10% across-the-board tariff for all foreign imports, and higher rates for other countries."
    },
    {
        "company": "AAPL",
        "title": "Trump: ‘We’d Go Back’ if Countries Fail to Reach Tariff Deals",
        "date": "2025-04-10",
        "summary": "President Trump commented on tariffs, the stock market and the U.S. relationship with China at his cabinet meeting."
    },
    {
        "company": "AAPL",
        "title": "Ted Cruz Says He Hopes President ‘Listens to the Angels’ on Tariffs",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs Wipe Out Over $6 Trillion on Wall Street in Epic Two-Day Rout",
        "date": "2025-04-04",
        "summary": "The selloff capped the worst week since 2020, as fears of a recession mount"
    },
    {
        "company": "AAPL",
        "title": "Vintage Trump",
        "date": "2025-04-15",
        "summary": "Reciprocal agreements for zero tariffs will enable his promised golden age for Americans."
    },
    {
        "company": "AAPL",
        "title": "Apple Built iPhone Inventory Ahead of Tariff War, Data Show",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "AAPL",
        "title": "Donald Trump Prescribes His Tariff ‘Medicine’ to Remake the Economy",
        "date": "2025-04-07",
        "summary": "Markets continue to tumble as Donald Trump sends more mixed messages about how permanent  his tariffs will be. Is the President still open to negotiations with countries around the world to pare back his tariffs, and will businesses and politicians start pushing back harder against the policy?  "
    },
    {
        "company": "AAPL",
        "title": "Silicon Valley CEO Says U.S. Tech Dominance in Peril Because of Tariffs",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Wall Street Speaks Out Against Tariffs",
        "date": "2025-04-07",
        "summary": "Last week, U.S. stocks lost $6.6 trillion in value during a two-day washout after President Trump announced "
    },
    {
        "company": "AAPL",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "AAPL",
        "title": "We Should Measure Prices in Time",
        "date": "2025-04-16",
        "summary": "The consumer-price index tells us nothing about changes in affordability. We need another measure."
    },
    {
        "company": "AAPL",
        "title": "White House Official Acknowledges ‘Conflicting Narratives’ on Tariffs",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Exempts Some Electronics, Including Smartphones, From Tariffs on China",
        "date": "2025-04-12",
        "summary": "President Trump’s tariff exemptions on some electronics are the latest twist in U.S. trade policy and could benefit companies such as Apple, Microsoft, Dell, Samsung and others that manufacture some products abroad. "
    },
    {
        "company": "AAPL",
        "title": "Tariffs Are Giving These TikTokers an Unlikely Career Boost",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Russian Strike on Ukraine’s Sumy Kills Over 30",
        "date": "2025-04-14",
        "summary": "President Trump described the Russian ballistic-missile strike that killed dozens of people in the northern Ukrainian city of Sumy as “a mistake.”"
    },
    {
        "company": "AAPL",
        "title": "Russian Strike on Ukraine’s Sumy Kills Over 30",
        "date": "2025-04-14",
        "summary": "President Trump described the Russian ballistic-missile strike that killed dozens of people in the northern Ukrainian city of Sumy as “a mistake.”"
    },
    {
        "company": "AAPL",
        "title": "Congress Can Help End Debanking",
        "date": "2025-04-09",
        "summary": "Codifying Trump’s executive orders into law will protect the financial system from political bias."
    },
    {
        "company": "AAPL",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "AAPL",
        "title": "Trade Historian Douglas Irwin on Trump's Unprecedented Tariff Shock",
        "date": "2025-04-14",
        "summary": "Paul Gigot interviews Dartmouth economist Douglas Irwin on why Trump's tariffs are unlike any other in U.S. history, how they will change the global trading system, and what to do about the special case of China."
    },
    {
        "company": "AAPL",
        "title": "Trump Dives Into Political Unknown With Tariff Plan",
        "date": "2025-04-04",
        "summary": "Some allies of President Trump worry that his expansive tariff plans could backfire with voters."
    },
    {
        "company": "AAPL",
        "title": "MLK’s Wise Words on Trade",
        "date": "2025-04-09",
        "summary": "‘We reach for soap that is created for us by a Frenchman. The towel is provided by a Turk.’"
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "A Market-Rattling Attempt to Make the American Economy Trump Always Wanted",
        "date": "2025-04-04",
        "summary": "The president dreams of factories reopened and towns revitalized by tariffs, but stocks plunged on fears economic growth will suffer."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Tariffs Are Modi’s Greatest Economic Test",
        "date": "2025-04-09",
        "summary": "India can’t afford to pick a trade fight with the U.S., but the prime minister can pursue other reforms to lift his country’s economy."
    },
    {
        "company": "AAPL",
        "title": "What Retirement Before Age 55 Looks Like in America ",
        "date": "2025-03-30",
        "summary": "Retirees open up about their finances and how they spend their time."
    },
    {
        "company": "AAPL",
        "title": "The $40 Billion Startup Mystery Shaking Up Silicon Valley",
        "date": "2025-04-09",
        "summary": "The founder says Figure AI has created autonomous robots, setting off an investor frenzy in private markets."
    },
    {
        "company": "AAPL",
        "title": "Most Voters Oppose Trump’s Tariffs, But His Supporters Are Still Behind Him",
        "date": "2025-04-04",
        "summary": "P.M. Edition for April 4. "
    },
    {
        "company": "AAPL",
        "title": "Heard on the Street Tuesday Recap: Bank Shots",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Taiwan Dares to Hope Trump Will Back It Against Beijing",
        "date": "2025-03-30",
        "summary": "The White House’s push to confront China reassured officials in Taipei, who watched President Trump’s shift on Ukraine with alarm."
    },
    {
        "company": "AAPL",
        "title": "Twinkies’ New Owner Courts a Novel Group of Snackers: Stoners",
        "date": "2025-04-11",
        "summary": "J.M. Smucker is hoping to boost sales of Hostess snacks by connecting them to modern cultural moments, like 4/20 cannabis celebrations."
    },
    {
        "company": "AAPL",
        "title": "Why AI Might Not Take All Our Jobs ",
        "date": "2025-04-14",
        "summary": "MIT economics professor Sendhil Mullainathan says it is in humans’ power to put artificial intelligence on a path to help us rather than replace us."
    },
    {
        "company": "AAPL",
        "title": "Leavitt Defends Lutnick Claim That Americans Will Make iPhones",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Vol. 38, No. 3: Canada",
        "date": "2025-03-31",
        "summary": "In the latest WSJ stylebook bulletin, some reminders about how we handle Canadian datelines and related Great White North terms. Also: We spell April Fools’ Day with an apostrophe, no fooling…"
    },
    {
        "company": "AAPL",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insights on car prices, Goodyear Tire & Rubber, Volvo Car, and more in the latest Market Talks covering the Automotive and Transportation sectors."
    },
    {
        "company": "AAPL",
        "title": "Sam Bankman-Fried’s New Home: A Run-Down Prison That Once Housed Al Capone",
        "date": "2025-04-12",
        "summary": "The former crypto billionaire is now doing time at Los Angeles’s Terminal Island."
    },
    {
        "company": "AAPL",
        "title": "Sam Bankman-Fried’s New Home: A Run-Down Prison That Once Housed Al Capone",
        "date": "2025-04-12",
        "summary": "The former crypto billionaire is now doing time at Los Angeles’s Terminal Island."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Provocation Principle",
        "date": "2025-04-09",
        "summary": "The administration is too addicted to shock, awe and intimidation to see the harm it is doing to itself. "
    },
    {
        "company": "AAPL",
        "title": "White House Official Acknowledges ‘Conflicting Narratives’ on Tariffs",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "AAPL",
        "title": "President Trump Announces 10% Across-the-Board Tariff on All Imports",
        "date": "2025-04-02",
        "summary": "P.M. Edition for April 2. President Trump said that the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations, in a series of moves he declared \"Liberation Day\" for U.S. trade policy. Plus, the U.S. tariffs send a message to companies that the era of globalization is over. Reporter "
    },
    {
        "company": "AAPL",
        "title": "Don’t Blame Trump for All of the Stock Market’s Problems",
        "date": "2025-03-27",
        "summary": "Though the trade war has heightened uncertainty, slower earnings growth and a cooler labor market would likely have impacted the market regardless."
    },
    {
        "company": "AAPL",
        "title": "A New Administration’s Signal Failure",
        "date": "2025-03-27",
        "summary": "The national-security communications snafu shows a government in the hands of immature bros."
    },
    {
        "company": "AAPL",
        "title": "Dave Portnoy, Ben Shapiro and Other Podcasters Criticize Trump's Tariffs",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Trump Golfs, Fires Off Social Media Posts as Markets Convulse",
        "date": "2025-04-06",
        "summary": "After announcing sweeping tariffs and triggering worldwide economic jitters, the president left Washington for a long weekend at his Florida clubs."
    },
    {
        "company": "AAPL",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Liberal Wins Wisconsin Supreme Court Race in Rebuke of Trump, Musk",
        "date": "2025-04-02",
        "summary": "Liberal judge Susan Crawford won the Wisconsin Supreme Court race despite Elon Musk's massive investment in support of her opponent."
    },
    {
        "company": "AAPL",
        "title": "Thousands of Anti-Trump Protesters Gathered Around the World",
        "date": "2025-04-05",
        "summary": "Massive protests against President Trump took place across the U.S. and in different parts of the world. "
    },
    {
        "company": "AAPL",
        "title": "The Trump Family Advances Its All-Out Crypto Blitz, This Time With Bitcoin Mining",
        "date": "2025-03-31",
        "summary": "A business led by two of the president’s sons will invest in American Bitcoin, a new mining company controlled by Hut 8."
    },
    {
        "company": "AAPL",
        "title": "Spring Reading Is Here",
        "date": "2025-04-04",
        "summary": "Our reviewers on more than two dozen of the season’s most beguiling new books."
    },
    {
        "company": "AAPL",
        "title": "Chip Stocks Pressured as Tariff Rout Intensifies",
        "date": "2025-04-07",
        "summary": "Global semiconductor stocks opened sharply lower, extending losses from last week as investors digest the extent of U.S. tariffs on chip-making hubs such as Taiwan."
    },
    {
        "company": "AAPL",
        "title": "Banks Warn of Risk to U.S. Economy Because of Tariffs",
        "date": "2025-04-11",
        "summary": "P.M. Edition for April 11. In earnings calls today, executives warned that President Trump’s tariffs were "
    },
    {
        "company": "AAPL",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "AAPL",
        "title": "Why Costco Went All In on Kirkland — and How It Paid Off",
        "date": "2025-03-31",
        "summary": "Costco’s $86 billion Kirkland Signature brand went against industry standards when it was launched in 1995. WSJ breaks down why the private label is now the retail behemoth’s secret weapon.  "
    },
    {
        "company": "AAPL",
        "title": "Paul Rudd on How to Win Friends and Influence Hollywood ",
        "date": "2025-04-01",
        "summary": "The actor fits in with film’s freaks, theater geeks, jocks and popular kids. He shares his secret to being the most beloved man in the industry."
    },
    {
        "company": "AAPL",
        "title": "Peter Navarro on Musk Calling Him a Moron: 'I've Been Called Worse’",
        "date": "2025-04-13",
        "summary": "Peter Navarro said on NBC’s “Meet the Press” program that his relationship with Elon Musk is good, despite Musk calling the White House trade adviser a “moron” on X."
    },
    {
        "company": "AAPL",
        "title": "Trump Administration Touts ‘Wins’ After Two-Day Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "AAPL",
        "title": "Meet the People Who Work Fully Remote—and Hate It",
        "date": "2025-03-28",
        "summary": "Most employees still want to be able to work from home at least some of the time. But a small cohort yearns to get back to cubicles and chit-chat."
    },
    {
        "company": "AAPL",
        "title": "U.S. Market Turmoil Deepens After China Retaliates With 34% Tariffs",
        "date": "2025-04-04",
        "summary": "Plus: The U.S. added 228,000 jobs in March, defying expectations. And President Trump has fired the chief of the National Security Agency. Zoe Kuhlkin hosts."
    },
    {
        "company": "AAPL",
        "title": "Attend The Future of Everything Hosted by The Wall Street Journal",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Notable & Quotable: Thomas Sowell on Tariffs",
        "date": "2025-04-03",
        "summary": "‘People hang on to their money until they figure out what you’re going to do. And when a lot of people hang on to their money, you can get results such as you got during the Great Depression.’ "
    },
    {
        "company": "AAPL",
        "title": "‘THIS IS A GREAT TIME TO BUY!!!’ Trump Contends",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "FCC Investigates Disney for DEI Practices, Chair Says",
        "date": "2025-03-28",
        "summary": "Brendan Carr posted a letter to the entertainment company on X."
    },
    {
        "company": "AAPL",
        "title": "The White House Protests on Signal",
        "date": "2025-03-26",
        "summary": "Steve Witkoff explains his security protocols while in Russia."
    },
    {
        "company": "AAPL",
        "title": "Trump’s Strategy for Signal Chat Fallout: Attack, Attack, Attack",
        "date": "2025-03-27",
        "summary": "The White House is criticizing the news media and playing down the security risk of a group chat that included a journalist from the Atlantic."
    },
    {
        "company": "AAPL",
        "title": "Trump 2.0: Trade Wars and Deportation Battles",
        "date": "2025-04-04",
        "summary": "Ryan Knutson"
    },
    {
        "company": "AAPL",
        "title": "Here’s the iPhone. Here’s the iPhone With Tariffs.",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "AAPL",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "AAPL",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "AAPL",
        "title": "What’s It Like on the Professional Golf Tour? Ask Michael Kim",
        "date": "2025-04-09",
        "summary": "For the past two years, Kim has been answering fans’ questions about endorsement deals, caddies and the day-to-day lives of pro golfers. Here’s what people want to know."
    },
    {
        "company": "AAPL",
        "title": "Stocks Tumble Again in Brutal Week on Wall Street",
        "date": "2025-04-04",
        "summary": "The U.S. stock market lost $6.6 trillion in market cap in two days as China retaliated against President Trump’s wide-ranging tariffs. Plus: Shares of companies that make goods in Vietnam rise after Trump said the country wants to negotiate, while chip stocks fell. Danny Lewis hosts."
    },
    {
        "company": "AAPL",
        "title": "Surrender or Resist? The Dilemma Facing Allies Caught in Trump’s Trade War",
        "date": "2025-03-26",
        "summary": "P.M. Edition for Mar. 26. When confronted with President Trump’s plan to impose tariffs, governments are still figuring out "
    },
    {
        "company": "AAPL",
        "title": "Lutnick on Trade With Countries Like Vietnam: ‘We Need to Stop the Ripoff’",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "Stocks Tumble Again in Brutal Week on Wall Street",
        "date": "2025-04-04",
        "summary": "The U.S. stock market lost $6.6 trillion in market cap in two days as China retaliated against President Trump’s wide-ranging tariffs. Plus: Shares of companies that make goods in Vietnam rise after Trump said the country wants to negotiate, while chip stocks fell. Danny Lewis hosts."
    },
    {
        "company": "AAPL",
        "title": "Surrender or Resist? The Dilemma Facing Allies Caught in Trump’s Trade War",
        "date": "2025-03-26",
        "summary": "P.M. Edition for Mar. 26. When confronted with President Trump’s plan to impose tariffs, governments are still figuring out "
    },
    {
        "company": "AAPL",
        "title": "Lutnick on Trade With Countries Like Vietnam: ‘We Need to Stop the Ripoff’",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "AAPL",
        "title": "U.S. Stocks Fall Sharply as Consumer Sentiment Sours in March",
        "date": "2025-03-28",
        "summary": "P.M. Edition for Mar. 28. Stocks sold off after hotter-than-expected inflation data, President Trump's tariff announcements and "
    },
    {
        "company": "AAPL",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "On WSJ’s Take On the Week, co-host Telis Demos and guest co-host Miriam Gottfried dive into the impending 25 percent tariffs that are set to be placed on global automotive imports to the U.S. Then, we explore what the bond market tells us and what a decrease in the U.S. Treasury yields means for investors. Plus, is the IPO market buzzing? Provider of specialized cloud-computing services, CoreWeave, is the latest company to debut for trading. With companies like StubHub, eToro, and Klarna also announcing public offerings, does this mean more deals are on the horizon?"
    },
    {
        "company": "AAPL",
        "title": "This Former USAID Head Has Advice for Elon Musk and DOGE",
        "date": "2025-04-18",
        "summary": "Rajiv Shah"
    },
    {
        "company": "AAPL",
        "title": "What to Watch For This Earnings Season As Trump’s Tariffs Come Into Play",
        "date": "2025-04-05",
        "summary": "EARLY DROP!!! We know tariffs and markets are on your mind so we're dropping this episode ahead of time to give you even more time to plot out how to take on your week! "
    }
]