[
    {
        "company": "MSFT",
        "title": "AI and Nuclear Power and ‘Wizard of Oz,’ Oh My!",
        "date": "2025-04-21",
        "summary": "Google used artificial intelligence to re-imagine “The Wizard of Oz” for an immersive experience at the Las Vegas Sphere, and WSJ CIO Journal reporter Isabelle Bousquette got "
    },
    {
        "company": "MSFT",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "MSFT",
        "title": "AMD Closes $4.9 Billion ZT Systems Deal, Targeting Its Piece of the ‘AI Factory’",
        "date": "2025-03-31",
        "summary": "Chip giant CEO Lisa Su says AI is still in its “very early stage” as the company revs up competition with Nvidia."
    },
    {
        "company": "MSFT",
        "title": "With Trump Tariffs, Even AI Could Get More Expensive",
        "date": "2025-04-04",
        "summary": "Higher prices may be in store for a range of materials used to build the data centers that will deliver AI."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "How Google Used AI to Re-Create ‘The Wizard of Oz’ for the Las Vegas Sphere",
        "date": "2025-04-09",
        "summary": "Google invented new techniques to enhance resolution and generated new character performances to bring the 1939 film to the giant screen."
    },
    {
        "company": "MSFT",
        "title": "The Drone-Delivery Service Beating Amazon to Your Front Door",
        "date": "2025-03-29",
        "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables."
    },
    {
        "company": "MSFT",
        "title": "Galaxy Digital Settles with NYAG for $200 Million Over Luna Ties",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mission to Take Over NASA—and Mars",
        "date": "2025-03-30",
        "summary": "The billionaire is in position to speed up plans for a voyage to the planet, with a potentially huge impact on SpaceX."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    }
]