[
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Google Faces Its Monopoly Reckoning",
        "date": "2025-04-20",
        "summary": "The Justice Department’s proposal that the company share data, shed its Chrome browser, and cease exclusionary contracts deserves broad support. "
    },
    {
        "company": "MSFT",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Comcast Loses Broadband Customers, Takes Theme-Park Hit From L.A. Fires",
        "date": "2025-04-25",
        "summary": "​The company posted lower quarterly earnings, but found bright spots with its mobile-phone plans and Peacock streaming service."
    },
    {
        "company": "MSFT",
        "title": "A Side Hustle for Friends of Musk: Selling Access to Stakes in His Private Companies",
        "date": "2025-04-25",
        "summary": "Lucrative stock deals have allowed SpaceX to avoid public scrutiny even as it has grown into one of the largest companies in the U.S."
    },
    {
        "company": "MSFT",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "MSFT",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "date": "2025-04-25",
        "summary": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street: CoreWeave Delivers a Verdict on the AI Boom—and on Itself",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "MSFT",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "MSFT",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "MSFT",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple, Meta Fined by EU, Ordered to Comply With Tech Competition Rules",
        "date": "2025-04-23",
        "summary": "The move risks ratcheting up tensions with the Trump administration as EU officials pursue trade talks."
    },
    {
        "company": "MSFT",
        "title": "Trump Signs Executive Order Calling for U.S. Deep-Sea Mining",
        "date": "2025-04-24",
        "summary": "The administration moves to sidestep U.N. body governing the ocean floor and the harvesting of minerals and metals in international waters."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "MSFT",
        "title": "Tech Shares Drive Stocks Higher for a Third Straight Session",
        "date": "2025-04-24",
        "summary": "Nasdaq Composite is up more than 5% this week on trade-deal optimism."
    },
    {
        "company": "MSFT",
        "title": "WPP CEO Sees Client Unease Amid Tariff Uncertainty, But No Spending Cuts",
        "date": "2025-04-25",
        "summary": "EXCLUSIVE: “The bigger question is what happens longer term, how this impacts the economy. I don’t think we’ll see that in the U.S. until May,” the head of the advertising company said in an interview."
    },
    {
        "company": "MSFT",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Relief Rally, Day Three",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Justice Department Urges Tough Action to Break Google’s Search Dominance",
        "date": "2025-04-21",
        "summary": "The judge who found that the tech company maintained an illegal monopoly is asked to force it to sell its Chrome web browser."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "ServiceNow Bumps Up Annual Guidance as Government Business Grows",
        "date": "2025-04-23",
        "summary": "Chief Executive Bill McDermott said the platform is operating in a best-case-scenario environment as companies look to optimize their supply chains amid recent tariff announcements and federal clients aim to boost efficiency amid government spending cuts."
    },
    {
        "company": "MSFT",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "MSFT",
        "title": "Elon Musk Is Stepping Back From DOGE. Can He Really Stay Away?",
        "date": "2025-04-25",
        "summary": "Elon Musk says he’s going to spend less time in Washington and more time running Tesla. WSJ columnist and Musk-watcher Tim Higgins unpacks what that plan might look like in reality. Also, the WSJ’s Isabelle Bousquette takes us inside "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Nokia Flags Earnings Hit From Tariffs",
        "date": "2025-04-24",
        "summary": "The company expects to take an earnings hit in the second quarter from tariffs and said that reaching the high end of its guidance range for the year now looked more challenging."
    },
    {
        "company": "MSFT",
        "title": "From Ken Griffin to Robinhood: The Donors Who Funded Trump’s Inauguration Revealed",
        "date": "2025-04-18",
        "summary": "President Trump’s inaugural committee raised almost $250 million from Corporate America, more than doubling the previous record."
    },
    {
        "company": "MSFT",
        "title": "Google Says End of U.S. Trade Loophole to Pose Headwind",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "The Score: UnitedHealth, Netflix, Eli Lilly and More Stocks That Defined the Week",
        "date": "2025-04-18",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news"
    },
    {
        "company": "MSFT",
        "title": "IBM Set to Benefit From Focus on AI, Automation as Clients Seek Efficiency in Uncertain Economy, CFO Says",
        "date": "2025-04-23",
        "summary": "For the second-quarter, IBM guided for sales between $16.4 billion and $16.75 billion, ahead of the $16.31 billion expected by analysts."
    },
    {
        "company": "MSFT",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "MSFT",
        "title": "Stocks Rally on New Hopes of Tariffs Easing",
        "date": "2025-04-22",
        "summary": "The Dow industrials surged more than 1,000 points after Monday’s selloff."
    },
    {
        "company": "MSFT",
        "title": "How Much Have Stocks Rebounded? Are We Still In a Bear Market?",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Up the Down Trump Tariff Escalator",
        "date": "2025-04-22",
        "summary": "Markets rally on Bessent’s optimism about a U.S.-China trade truce."
    },
    {
        "company": "MSFT",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Targets Democratic Fundraising",
        "date": "2025-04-25",
        "summary": "A.M. Edition for April 25. President Trump directs the Justice Department to "
    },
    {
        "company": "MSFT",
        "title": "3M Keeps Guidance but Adds Tariff Hazards",
        "date": "2025-04-22",
        "summary": "The company says Trump’s tariff campaign could knock down adjusted earnings per share by 20 cents to 40 cents this year."
    },
    {
        "company": "MSFT",
        "title": "Top ‘60 Minutes’ Executive Quits, Citing Editorial Pressure",
        "date": "2025-04-22",
        "summary": "Bill Owens is leaving the CBS News program that has been a major target of President Trump."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Hertz, MicroStrategy, Capital One, Comerica",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "South Korean Firm Galaxy Corporation Targets $1 Billion Valuation in 2026 IPO",
        "date": "2025-04-21",
        "summary": "Galaxy Corporation, a South Korean entertainment-technology group representing K-pop star G-Dragon, plans to go public next year in a deal that could value it at around $1.0 billion."
    },
    {
        "company": "MSFT",
        "title": "Our Capitulation Nation",
        "date": "2025-04-20",
        "summary": "Everybody’s folding, from Trump and Democrats to law firms and universities."
    },
    {
        "company": "MSFT",
        "title": "Asian Stocks Buoyed by Hopes of Easing U.S.-China Tensions",
        "date": "2025-04-23",
        "summary": "Hopes for easing trade tensions between the U.S. and China, and President Trump saying he isn’t planning to fire Fed Chair Jerome Powell, lifted stocks in the region."
    },
    {
        "company": "MSFT",
        "title": "How DOGE Plans to Plow Ahead Without Musk at the Helm",
        "date": "2025-04-24",
        "summary": "The Tesla CEO’s White House role is expected to diminish in the coming weeks."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on Capital Power, commodity prices  and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "How DOGE Plans to Plow Ahead Without Musk at the Helm",
        "date": "2025-04-24",
        "summary": "The Tesla CEO’s White House role is expected to diminish in the coming weeks."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on Capital Power, commodity prices  and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Capital One’s $35 Billion Deal for Discover Gets the Green Light",
        "date": "2025-04-18",
        "summary": "The approval could help encourage deals in the financial-services industry."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "EU Delayed Punishing Apple, Meta Just Before Trade Talks Started",
        "date": "2025-04-18",
        "summary": "The bloc postponed penalties, temporarily avoiding a conflict with the Trump administration during a week in which it ramped up its push for a trade deal with the U.S."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Companies Are Going Bankrupt at the Fastest Rate Since 2010",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Why It’s So Difficult for Robots to Make Your Nike Sneakers",
        "date": "2025-04-21",
        "summary": "The shoe giant’s effort to find alternatives to Asian factories that churn out a dazzling variety of its sneakers is a cautionary tale."
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "MSFT",
        "title": "DOGE Comes for Clean Energy, Putting Exxon and Occidental Projects at Risk",
        "date": "2025-04-18",
        "summary": "Thousands of Energy Department jobs are expected to be eliminated as Trump goes after a favorite target."
    },
    {
        "company": "MSFT",
        "title": "Boston at Risk of ‘Wealth Spiral’ as Harvard Fight Ripples Through Economy",
        "date": "2025-04-20",
        "summary": "Far beyond Harvard Yard, the university is a major economic engine for the region."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Continue Rally for Second Day",
        "date": "2025-04-23",
        "summary": "Plus: The White House says there will be \"no unilateral reduction in tariffs against China.\" And OpenAI CEO Sam Altman says he is stepping down as chairman of the nuclear-energy startup Oklo. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall and the Dollar Drops Amid Trump’s Threats to Fire Fed Chair",
        "date": "2025-04-21",
        "summary": "Investors are seeking refuge after President Trump’s renewed attacks on Federal Reserve chief Jerome Powell. Plus: DHL stock falls after it suspends high-value shipments to the U.S. And Capital One shares rise after regulators approve its $35 billion acquisition of Discover. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Lobbies Trump to Avoid Meta Antitrust Trial",
        "date": "2025-04-02",
        "summary": "Meta’s chief executive was at the White House on Wednesday, his third visit during Trump’s presidency,  according to people familiar with the matter."
    },
    {
        "company": "MSFT",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Lobbies Trump to Avoid Meta Antitrust Trial",
        "date": "2025-04-02",
        "summary": "Meta’s chief executive was at the White House on Wednesday, his third visit during Trump’s presidency,  according to people familiar with the matter."
    },
    {
        "company": "MSFT",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "MSFT",
        "title": "Tesla, Boeing and Alphabet Earnings: What to Watch for This Week",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "MSFT",
        "title": "Government Jobs Insulated DC From Economic Volatility. Not Any More.",
        "date": "2025-04-19",
        "summary": "The president ‘s federal government shake-up is taking a toll on the U.S. capital’s economy. "
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg, on Witness Stand, Rebuffs Claims Meta Monopolizes Social-Media Market",
        "date": "2025-04-15",
        "summary": "The Meta Platforms CEO testified that his company had legitimate business reasons for acquiring Instagram more than a decade ago."
    },
    {
        "company": "MSFT",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Dow Falls More Than 1,000 Points, Nasdaq Loses 4% in Another Volatile Day",
        "date": "2025-04-10",
        "summary": "Plus: President Trump says he is open to Japan’s Nippon Steel investing in U.S. Steel but not owning it. CarMax misses its quarterly earnings estimates. And Modelo owner Constellation Brands cuts its annual outlook. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "Trump Presses Harvard to Turn Over Foreign Funding Records",
        "date": "2025-04-18",
        "summary": "Plus: The EU postpones punishing Apple and Meta. And the U.S. accuses China of aiding the Houthis in Yemen.  Zoe Kuhlkin hosts. "
    },
    {
        "company": "MSFT",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "MSFT",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Uber Sued Over Cancellation Practices",
        "date": "2025-04-21",
        "summary": "Plus: The Justice Department asks a federal judge to force Google to sell its Chrome web browser. And crypto firms swoop in on the banking world with applications for charters. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Big Companies Are Leaving Delaware. Can Its Governor Stop the Exodus?",
        "date": "2025-04-17",
        "summary": "Companies from Tesla to Meta have left or are considering leaving Delaware after a series of controversial court decisions. WSJ looks at the impact of that exodus and talks with Gov. Matt Meyer about how the state is fighting back."
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Judge Rules Google Operates Illegal Ad Monopoly",
        "date": "2025-04-18",
        "summary": "The tech giant faces multiple legal threats related to how it wields market power."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Musk Merges His AI Company With X, Claiming Combined Value of $113 Billion",
        "date": "2025-03-29",
        "summary": "Elon Musk’s artificial-intelligence startup xAI has acquired X, the social-media platform he also owns, in an all-stock deal that assigns the new enterprise a lofty valuation."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Is Chinese AI All It’s Cracked Up to Be?",
        "date": "2025-04-16",
        "summary": "Beijing is pushing a tech challenge to the U.S., but Washington can counter it with smart policies."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Musk’s Megadeal Between X and xAI Breaks Wall Street’s Rulebook ",
        "date": "2025-04-01",
        "summary": "The tech titan can follow his own rules when he is combining two companies he owns, but the merger is still raising dealmaker eyebrows."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
        "date": "2025-04-14",
        "summary": "The chip maker’s plan to build AI tech in Texas comes on the heels of a new tariff threat."
    },
    {
        "company": "MSFT",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "MSFT",
        "title": "AMD Closes $4.9 Billion ZT Systems Deal, Targeting Its Piece of the ‘AI Factory’",
        "date": "2025-03-31",
        "summary": "Chip giant CEO Lisa Su says AI is still in its “very early stage” as the company revs up competition with Nvidia."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "MSFT",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Zuckerberg Continues to Lobby Trump",
        "date": "2025-04-02",
        "summary": "Plus, two big tech companies bid for TikTok. And Nintendo stays in the game with its coming Switch 2 release. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Japan Accuses Google of Being Anticompetitive",
        "date": "2025-04-15",
        "summary": "Plus: JPMorgan Chase, Bank of America and Bank of New York Mellon press pause on electronic communications with their regulator following an email hack. And Johnson & Johnson says tariffs will increase costs for its medical-technology products. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Tries to Enlist Trump in Fight Against Meta EU Ruling",
        "date": "2025-04-01",
        "summary": "Meta executives have pressed U.S. trade officials to push back against a European Union law that could undermine its ad business."
    },
    {
        "company": "MSFT",
        "title": "Inside Mark Zuckerberg’s Failed Negotiations to End Antitrust Case",
        "date": "2025-04-15",
        "summary": "The FTC wanted $30 billion to drop its case. Zuckerberg offered much less and hoped Trump would back him up."
    },
    {
        "company": "MSFT",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump to Review Preliminary TikTok Deal As Deadline Approaches",
        "date": "2025-04-02",
        "summary": "Senior administration officials are expected to attend a Wednesday meeting about a potential deal; plan would require Beijing’s blessing."
    },
    {
        "company": "MSFT",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "MSFT",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "The $40 Billion Startup Mystery Shaking Up Silicon Valley",
        "date": "2025-04-09",
        "summary": "The founder says Figure AI has created autonomous robots, setting off an investor frenzy in private markets."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mission to Take Over NASA—and Mars",
        "date": "2025-03-30",
        "summary": "The billionaire is in position to speed up plans for a voyage to the planet, with a potentially huge impact on SpaceX."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: CarMax, TSMC, Trump Media, U.S. Steel",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "MSFT",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "Plus: Goldman Sachs profit surges as tariff uncertainty powers trading revenue. And U.S. companies are going bankrupt at the fastest rate since 2010. Charlotte Gartenberg hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Inside Elon Musk’s Shock-and-Awe Months in the White House",
        "date": "2025-04-05",
        "summary": "President Trump directed his chief of staff to better manage the billionaire adviser after complaints arose from his cabinet and staff."
    },
    {
        "company": "MSFT",
        "title": "How Bad Was This Week in the Stock Market?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Meta Fights to Keep Instagram and WhatsApp, as Antitrust Trial Begins",
        "date": "2025-04-14",
        "summary": "The Federal Trade Commission says Meta has monopolized the social-media market—and should be broken up."
    },
    {
        "company": "MSFT",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "MSFT",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "MSFT",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "MSFT",
        "title": "AppLovin Confirms Indication of Interest in TikTok Purchase",
        "date": "2025-04-03",
        "summary": "The Trump administration’s deadline to sell or shut down TikTok is Saturday."
    },
    {
        "company": "MSFT",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "MSFT",
        "title": " TNB Tech Minute: TikTok Lives On…For Now",
        "date": "2025-04-04",
        "summary": "Plus, the Magnificent Seven continue their stock-market slide. And fintechs put their IPO roadshows on hold. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Don’t Blame Trump for All of the Stock Market’s Problems",
        "date": "2025-03-27",
        "summary": "Though the trade war has heightened uncertainty, slower earnings growth and a cooler labor market would likely have impacted the market regardless."
    },
    {
        "company": "MSFT",
        "title": "Rocket to Buy Mr. Cooper Group in $9.4 Billion Mortgage-Industry Deal",
        "date": "2025-03-31",
        "summary": "The Detroit-based company agreed to buy Mr. Cooper, one of the country’s largest mortgage firms, in a $9.4 billion all-stock deal."
    },
    {
        "company": "MSFT",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Delaware Punches Back at Texas Efforts to Lure Away Companies",
        "date": "2025-03-26",
        "summary": "The state is fighting to remain the corporate capital with a new law shifting more power to businesses."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Tries to Crush China’s AI Ambitions With Chips Crackdown ",
        "date": "2025-04-17",
        "summary": "New chip restrictions for Nvidia and AMD show the Trump administration’s determination to battle China on tech advances as well as trade."
    },
    {
        "company": "MSFT",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mr. Fix-It Takes Center Stage During a Really Bad Week",
        "date": "2025-04-05",
        "summary": "Antonio Gracias made a rare public appearance alongside his friend as he helps with DOGE."
    },
    {
        "company": "MSFT",
        "title": "Visa Offers Apple Roughly $100 Million to Take Over Credit Card From Mastercard",
        "date": "2025-04-01",
        "summary": "Visa, Amex and Mastercard are all competing to be the network for the tech giant’s credit card."
    },
    {
        "company": "MSFT",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "The graphics-chip maker is working with Foxconn on a supercomputer plant in Houston."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "The graphics-chip maker is working with Foxconn on a supercomputer plant in Houston."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk Brings His Vision for Mars to NASA",
        "date": "2025-04-09",
        "summary": "The SpaceX founder has backed a friend to lead the space agency and make a Mars mission a priority. Wall Street Journal reporters Emily Glazer and Micah Maidenberg talk about Musk’s "
    },
    {
        "company": "MSFT",
        "title": "Trump Tariffs Aim to Bring Down Curtain on Era of Globalization",
        "date": "2025-04-03",
        "summary": "The president wants companies to return production to the U.S., but it won’t be easy."
    },
    {
        "company": "MSFT",
        "title": "Trump Grants 75-Day Extension to Reach TikTok Deal",
        "date": "2025-04-04",
        "summary": "The extension will give investors more time to reach an agreement to keep the app operating in the U.S."
    },
    {
        "company": "MSFT",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Consulting Giants Offer Billions in Cuts to Federal Contracts. It Might Not Be Enough.",
        "date": "2025-04-02",
        "summary": "Accenture, Deloitte, IBM and other firms submitted proposed price concessions but are expected to be asked to dig deeper."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: UnitedHealth, Marvell, CVS, Humana",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Hardest-Hit Stocks in Asia: Tech, Japanese Banks and a Nike Supplier",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chip Shares Tumble After Nvidia Discloses Export Restrictions",
        "date": "2025-04-16",
        "summary": "Export restrictions placed on certain chips manufactured by Nvidia have weighed on other chipmakers, and shares of Broadcom, Qualcomm and others declined."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Canada’s auto industry, Delta, Mercedes-Benz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "MSFT",
        "title": "Apple-Linked Tech Stocks Are Hard-Hit in Asia",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "EQT Consortium Makes Bid for Fortnox, Valuing it at $5.5 Billion",
        "date": "2025-03-31",
        "summary": "The buyout group offered to buy the cloud-based accounting software developer with First Kraft, which currently owns 18.9% of Fortnox."
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Despite the Trade War, Chip Maker TSMC Remains Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": "Plus, Japan and Italy try to find common ground with the White House on trade. And Trump officials have requested that the IRS start the process of revoking Harvard’s tax-exempt status. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: J&J, Xiaomi, PVH, XPeng",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Nvidia’s Dominance Reflects the CEO’s Unique Business Logic",
        "date": "2025-04-12",
        "summary": "The AI powerhouse has become ubiquitous, paradoxically by doing only what it deems essential."
    },
    {
        "company": "MSFT",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Trump Adds Tougher Limits on China’s Access to U.S. Technology",
        "date": "2025-03-26",
        "summary": "Plus, AI startup Anthropic wins in court over copyrighted music. And, Gamestop’s play in bitcoin boosts its stock. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Starboard Nominates Directors for Autodesk’s Board",
        "date": "2025-03-26",
        "summary": "The activist investor  is trying  to boost the software-design maker’s share price."
    },
    {
        "company": "MSFT",
        "title": "Google Faces Potential $6.6 Billion U.K. Antitrust Lawsuit Over Search Advertising",
        "date": "2025-04-16",
        "summary": "The lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services."
    },
    {
        "company": "MSFT",
        "title": "With Trump Tariffs, Even AI Could Get More Expensive",
        "date": "2025-04-04",
        "summary": "Higher prices may be in store for a range of materials used to build the data centers that will deliver AI."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Tesla, Nvidia, Newsmax",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Semiconductor Sector Under Pressure After China Counters in Trump’s Tariff War",
        "date": "2025-04-04",
        "summary": "Shares of Nvidia and other semiconductor companies slid amid a flurry of tariffs between the U.S. and Asian countries that could subdue electronics demand and hinder Big Tech’s artificial-intelligence infrastructure buildout."
    },
    {
        "company": "MSFT",
        "title": "The AI Data-Center Boom Is Coming to Rural America",
        "date": "2025-03-30",
        "summary": "Meta Platforms and other tech companies are looking for huge swaths of flat land and plentiful power."
    },
    {
        "company": "MSFT",
        "title": "EU Competition Chief Goes to Washington, With Tech Rulings Looming",
        "date": "2025-04-01",
        "summary": "Teresa Ribera’s trip comes as her department wraps up investigations into Apple and Meta under the Digital Markets Act — the European Union’s digital antitrust law."
    },
    {
        "company": "MSFT",
        "title": "Bitcoin and Bonds: Have MicroStrategy and GameStop Found a Cheat Code for Markets?",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chip Stocks Pressured as Tariff Rout Intensifies",
        "date": "2025-04-07",
        "summary": "Global semiconductor stocks opened sharply lower, extending losses from last week as investors digest the extent of U.S. tariffs on chip-making hubs such as Taiwan."
    },
    {
        "company": "MSFT",
        "title": "CEOs Break Silence on Trump Trade War",
        "date": "2025-04-08",
        "summary": "For weeks, business leaders have avoided voicing concerns about tariffs. Some executives are getting more vocal."
    },
    {
        "company": "MSFT",
        "title": "CoreWeave Stock Ends Flat on First Day of Trading After Scaled-Back IPO",
        "date": "2025-03-28",
        "summary": "The AI startup had priced it’s highly anticipated IPO at a lower-than-expected $40 a share."
    },
    {
        "company": "MSFT",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "MSFT",
        "title": "TSMC Maintains Solid 2025 Outlook Despite Tariff Worries",
        "date": "2025-04-17",
        "summary": "The world’s largest contract chip maker remains confident that it can post solid sales growth this year."
    },
    {
        "company": "MSFT",
        "title": "S&P and Nasdaq Notch Biggest Quarterly Losses Since 2022",
        "date": "2025-03-31",
        "summary": "A mixed session capped a turbulent quarter as investors turned from excitement over President Trump’s tax cuts and deregulation to fears over tariffs and a recession. Plus: Newsmax shares surge on first day of trading. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": "Trump Settles on Tariff Plan Ahead of ‘Liberation Day’ Deadline",
        "date": "2025-04-01",
        "summary": "Plus, Meta CEO Mark Zuckerberg is pressing U.S. trade officials to help fight an expected European Union ruling that could undermine its ad business. And Softbank agrees to lead $40 billion funding for OpenAI. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall Sharply as Consumer Sentiment Sours in March",
        "date": "2025-03-28",
        "summary": "P.M. Edition for Mar. 28. Stocks sold off after hotter-than-expected inflation data, President Trump's tariff announcements and "
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Edge Lower While Investors Wait for Signs on Tariff Talks",
        "date": "2025-04-15",
        "summary": "The Dow Industrials and the S&P 500 slid fractionally; bank stocks gained on strong earnings reports."
    },
    {
        "company": "MSFT",
        "title": "Stocks Mixed Ahead of Sweeping Trump Tariffs Announcement",
        "date": "2025-04-01",
        "summary": "President Trump is due to unveil sweeping tariffs tomorrow afternoon—but what exactly he will announce is unclear. Plus: executives at Meta Platforms press trade officials to fight an expected European Union fine and cease-and-desist order. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Spirits, Swiss Watches, Sneakers: Global Stock-Market Winners and Losers from Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech Stocks Tumble After Nvidia Discloses Chip Export Restrictions",
        "date": "2025-04-16",
        "summary": "The stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Rise on Tech Tariff Reprieve ",
        "date": "2025-04-14",
        "summary": "Stocks gained after Trump exempted semiconductor equipment, smartphones and other electronics from tariffs, even though officials later signaled they would be put in their own levy bracket."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Drop on Fears of Escalating U.S.-China Trade Tensions",
        "date": "2025-04-16",
        "summary": "European and Asian stock indexes were down, along with U.S. futures, as investor confidence soured on signs of worsening trade tensions between the world’s two largest economies."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: OpenAI’s $40 Billion Funding Round Has a Catch",
        "date": "2025-03-28",
        "summary": "Plus, CoreWeave’s much-anticipated IPO flounders. And, President Trump adds Nikola’s founder to his raft of pardons. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Logitech Withdraws FY26 Outlook Amid Tariff Uncertainty",
        "date": "2025-04-10",
        "summary": "he company’s move comes a day after President Trump placed a 90-day pause on most of his across-the-board reciprocal tariffs."
    },
    {
        "company": "MSFT",
        "title": "How BlackRock’s Larry Fink Won Over Donald Trump",
        "date": "2025-04-05",
        "summary": "CEOs the world over are trying to get in good with President Trump. This Wall Street titan found a way."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall, Wiping Out More Than $3 Trillion in Market Value",
        "date": "2025-04-03",
        "summary": "P.M. Edition for April 3. U.S. markets experience their s"
    },
    {
        "company": "MSFT",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-29",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "MSFT",
        "title": "What Is an AI Supercomputer and Why Is Trump Talking About It?",
        "date": "2025-04-17",
        "summary": "The president enthused on social media that chip maker Nvidia would build “A.I. SUPERCOMPUTERS” in the U.S. Here’s a guide to the technology and why it matters."
    },
    {
        "company": "MSFT",
        "title": "Big Office Landlord Made $4 Million in Previously Undisclosed Payouts to Its CEO",
        "date": "2025-04-05",
        "summary": "Paramount Group recently revealed that it made payments to the chief executive’s jet company as well as for his personal accounting services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Investigating Pharmaceutical and Semiconductor Tariffs",
        "date": "2025-04-15",
        "summary": "Plus, South Korea says it’s preparing roughly $23 billion in government support for the chip sector amid tariff uncertainty. And Netflix aims for a $1trillion market capitalization. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Peril of Trump’s Tariffs for America’s Auto Titans",
        "date": "2025-04-05",
        "summary": "The administration’s new levies will be a massive blow to the bottom line of Ford and GM and force job cuts across the industry."
    },
    {
        "company": "MSFT",
        "title": "Consumer Staples Gain on Rush to Safety After Tariffs Spark Market Rout",
        "date": "2025-04-03",
        "summary": "The sector’s exposure to the tariffs that are poised to hit a number of industries, from clothing and shoe makers, to toys and autoparts companies, is minimal."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Rent the Runway, Xiaomi , Telecom Italia, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "To Navigate Trump’s Tariffs, Apple and Nintendo Take Different Paths",
        "date": "2025-04-15",
        "summary": "Apple CEO "
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall After President Trump Unveils New Tariffs on Auto Imports",
        "date": "2025-03-27",
        "summary": "Shares in all of the Big Three U.S. automakers dropped after the announcement, but Tesla stock ticked up. Plus: GameStop plunged after saying it would issue $1.3 billion of convertible bonds to buy bitcoin. And Dollar Tree shares jumped after announcing the sale of its Family Dollar business. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. House Committee Urges Two U.S. Banks to Withdraw From CATL’s Listing",
        "date": "2025-04-18",
        "summary": "A U.S. congressional committee has urged two U.S. banks to pull out of working on Chinese battery giant Contemporary Amperex Technology’s planned listing in Hong Kong, expressing “significant concerns” over their involvement in the process."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "MSFT",
        "title": "China’s Tariff-Dodging Move to Mexico Looks Doomed",
        "date": "2025-04-02",
        "summary": "Chinese firms invested billions of dollars setting up Mexican factories to make products for the American market, shipping goods tariff-free under a U.S. trade pact now in peril."
    },
    {
        "company": "MSFT",
        "title": "What Apple Has at Stake in China",
        "date": "2025-04-12",
        "summary": "The iPhone-maker just received some reprieve from tariffs, but is still heavily reliant on the Chinese manufacturing economy it helped build."
    },
    {
        "company": "MSFT",
        "title": "‘This Is a Great Time to Buy’: Tariff Pause Sparks Historic Rally",
        "date": "2025-04-09",
        "summary": "U.S. stocks staged a historic rally after President Trump announced a 90-day pause on some tariffs and signaled a willingness to negotiate on trade."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Bank of America, Citigroup and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Post Worst Quarter Since 2022 on Threat of Trade War",
        "date": "2025-03-31",
        "summary": "Tariff uncertainty and a flagging tech trade dragged the S&P 500 and Nasdaq lower to start 2025."
    },
    {
        "company": "MSFT",
        "title": "Citigroup Reports Jump in Profit, Revenue",
        "date": "2025-04-15",
        "summary": "Citigroup reported a jump in profit and revenue in the first quarter of 2025 that beat analysts’ expectations, thanks in part to market volatility that generated higher fees for its trading business."
    },
    {
        "company": "MSFT",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "OpenAI’s Latest Funding Round Comes With a $20 Billion Catch",
        "date": "2025-03-28",
        "summary": "A stipulation of the funding round, led by SoftBank, is adding pressure to OpenAI’s efforts to convert to a for-profit company."
    },
    {
        "company": "MSFT",
        "title": "Vol. 38, No. 3: Canada",
        "date": "2025-03-31",
        "summary": "In the latest WSJ stylebook bulletin, some reminders about how we handle Canadian datelines and related Great White North terms. Also: We spell April Fools’ Day with an apostrophe, no fooling…"
    },
    {
        "company": "MSFT",
        "title": "CoreWeave IPO Prices at $40: Trading Debut to Test Investor Demand for AI",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariffs Create Opening for ‘Made in America’ Ads—With Carefully Chosen Words",
        "date": "2025-04-08",
        "summary": "Ford Motor Company released an ad campaign this month titled “Committed to America,” stating that it assembles more vehicles in the U.S. and employs more hourly workers in the country than any other automaker."
    },
    {
        "company": "MSFT",
        "title": "Mark Klein, a Whistleblower Who Revealed Domestic Spying, Dies at 79",
        "date": "2025-04-11",
        "summary": "The AT&T technician predated Edward Snowden by seven years, but his allegations were never able to achieve traction."
    },
    {
        "company": "MSFT",
        "title": "China Has Readied a Trade-War Arsenal That Takes Aim at U.S. Companies",
        "date": "2025-04-09",
        "summary": "Beijing’s strategy to hit back at President Trump goes well beyond tariffs, targeting companies who bank on their China ties."
    },
    {
        "company": "MSFT",
        "title": "Tech Stocks Fall After U.S. Restrictions on Nvidia's China Exports",
        "date": "2025-04-16",
        "summary": "Plus: The U.K.’s Supreme Court rules that transgender women can’t be defined as women. Canada holds interest rates steady as it examines the impact of tariffs. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Stocks Tumble Again in Brutal Week on Wall Street",
        "date": "2025-04-04",
        "summary": "The U.S. stock market lost $6.6 trillion in market cap in two days as China retaliated against President Trump’s wide-ranging tariffs. Plus: Shares of companies that make goods in Vietnam rise after Trump said the country wants to negotiate, while chip stocks fell. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Bank Shots",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chip Stocks Dive Following Trump’s Threat of More Tariffs — Heard on the Street",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Harvard Hit With $2 Billion Government Funding Freeze",
        "date": "2025-04-15",
        "summary": "A.M. Edition for April 15. The Trump administration "
    },
    {
        "company": "MSFT",
        "title": "Wall Street and Main Street Aren’t Separable",
        "date": "2025-04-17",
        "summary": "The president sets up a false economic dichotomy."
    },
    {
        "company": "MSFT",
        "title": "Asian Stock Markets Fall on Tariff Concerns",
        "date": "2025-04-16",
        "summary": "Equity markets in Asia declined as concerns about tariffs again weighed on sentiment, with technology shares hit by uncertainty over how the Trump administration’s trade policies will affect supply chains."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Nvidia Warns of $5.5 Billion Charge on New China Export Curbs; Stock Drops",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Buy the Yips",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Says Europe’s Tech Rules Are a Trade Barrier",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Microbix Biosystems, Lonza, Telix Pharmaceuticals, and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Meltdown Gives Way to Global Rout",
        "date": "2025-04-07",
        "summary": "The turmoil in financial markets spread worldwide, as Trump’s challenge to world trade intensified stock losses from Hong Kong to France. Japan’s Nikkei 225 logged its biggest drop since last August."
    },
    {
        "company": "MSFT",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-13",
        "summary": "The CEO managed to help the iPhone avoid another U.S. battle with China."
    },
    {
        "company": "MSFT",
        "title": "Tim Cook’s ‘Long Arc of Time’ Prepared Apple for the Trade War",
        "date": "2025-04-13",
        "summary": "The CEO managed to help the iPhone avoid another U.S. battle with China."
    },
    {
        "company": "MSFT",
        "title": "How One of the Wildest Weeks in Market History Unfolded",
        "date": "2025-04-12",
        "summary": "A tense, volatile week on Wall Street ended with all three major U.S. indexes up 5% or more, yet still below where they were when President Trump launched his tariff blitz."
    },
    {
        "company": "MSFT",
        "title": "Shares of Apple Suppliers in Asia Regain Ground",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Claims Tariffs Responsible for Nvidia U.S. Manufacturing Announcement",
        "date": "2025-04-14",
        "summary": "President Trump claimed that his re-election and tariffs were the reasons why Nvidia announced that it would build its AI supercomputers entirely in the U.S."
    },
    {
        "company": "MSFT",
        "title": "Trump Announces 10% Baseline Tariff, Reciprocal Tariffs on Some Nations",
        "date": "2025-04-02",
        "summary": "President Trump announced a slate of reciprocal tariffs against certain nations and a 10% across-the-board tariff, at a Rose Garden event he’s called “Liberation Day.” "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "The Lessons of Trump’s Tariff Exemptions",
        "date": "2025-04-13",
        "summary": "It’s good to be Apple’s Tim Cook but not to be a small manufacturer that can’t afford a K Street lobbyist."
    },
    {
        "company": "MSFT",
        "title": "How RFK Jr. Is Reshaping the U.S. Health Agencies",
        "date": "2025-03-27",
        "summary": "P.M. Edition for Mar. 27. Health and Human Services Secretary Robert F. Kennedy Jr. announced "
    },
    {
        "company": "MSFT",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on fiber operations, oil futures, Repsol’s joint venture with NEO Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Parkland, oil prices and more in the latest Market Talks covering the Energy and Utilities sector."
    },
    {
        "company": "MSFT",
        "title": "Nvidia Says U.S. Implements Chip Export Restrictions to China, Warns of $5.5 Billion Charge",
        "date": "2025-04-15",
        "summary": "The U.S. government ”indicated that the license requirement addresses the risk that the covered products may be used in, or diverted to, a supercomputer in China,” Nvidia said."
    },
    {
        "company": "MSFT",
        "title": "He Started Out Driving Forklifts. 40 Years Later, He’s Costco’s CEO",
        "date": "2025-04-10",
        "summary": "Costco’s CEO Ron Vachris sat down with The Wall Street Journal to discuss how its $86 billion Kirkland Signature brand runs and why it allows Costco leverage over many big brands. "
    },
    {
        "company": "MSFT",
        "title": "Even Disney Is Exposed to Tariffs",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Retreats From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "The Justice Department is backing away from some cases involving foreign bribery, money laundering and crypto markets. Defense lawyers are bracing for a slowdown."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks End Tumultuous Week Highe",
        "date": "2025-04-11",
        "summary": "Stocks rose after the White House said it has 15 trade-deal offers on the table and China said set its reciprocal tariffs on U.S. imports at 125%. Plus: Big banks’ stocks rose after posting profits from equities trading revenue. And shares of gold mining companies jumped amid investors’ rush to haven assets. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "False Tariff Headline Sends Stocks on $2 Trillion Ride",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "False Tariff Headline Sends Stocks on $2 Trillion Ride",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Samsung Guides for Softer First-Quarter Profit But Still Beats Consensus",
        "date": "2025-04-08",
        "summary": "Samsung Electronics guided for softer first-quarter operating profit amid few signs of an immediate recovery in its flagship semiconductor business."
    },
    {
        "company": "MSFT",
        "title": "Higher U.S. Taxes Are an AI Win for China",
        "date": "2025-04-09",
        "summary": "Congress must keep corporate rates low, or businesses may shift valuable IP offshore. "
    },
    {
        "company": "MSFT",
        "title": "Trump Claims Victory After Nvidia’s U.S. Manufacturing Announcement",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How the Company Making Nearly All Its Money From the Government Is Navigating Trump’s Cuts",
        "date": "2025-04-03",
        "summary": "Booz Allen’s CEO discusses the more than $1 billion in price concessions his firm has offered up and what its business will look like post-DOGE."
    },
    {
        "company": "MSFT",
        "title": "What Trade War? Chip Maker TSMC Is Still Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariff Upheaval Threatens Private Equity’s Exit Recovery Hopes",
        "date": "2025-04-14",
        "summary": "U.S. private-equity exits and their total value rose in the first quarter compared with a year ago, but recent market volatility puts that momentum at risk."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and the American Majority",
        "date": "2025-04-01",
        "summary": "Most people understand that the government spends too much."
    },
    {
        "company": "MSFT",
        "title": "In Secret Meeting, China Acknowledged Role in U.S. Infrastructure Hacks",
        "date": "2025-04-10",
        "summary": "A senior Chinese official linked intrusions to escalating U.S. support for Taiwan."
    },
    {
        "company": "MSFT",
        "title": "Nvidia Records $5.5 Billion Charge on New H20 Export Restrictions",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Why Markets Are Melting Down",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Many U.S. Companies Plan to Keep China Ties, Survey Finds",
        "date": "2025-04-08",
        "summary": "The new report commissioned by the U.S. Chamber of Commerce Foundation also indicated that many American firms identify China as a source of geopolitical risk."
    },
    {
        "company": "MSFT",
        "title": "Asian Stocks Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Post Gains Ahead of Trump Tariff Announcement",
        "date": "2025-04-02",
        "summary": "Investors hope clarity on trade will help markets recover."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "Aditya Bhave, a Bank of America senior U.S. economist, discusses with co-hosts Telis Demos and Miriam Gottfried what we can expect from the forthcoming jobs report and how it will offer a big clue to where the economy is heading. "
    },
    {
        "company": "MSFT",
        "title": "How Investing Will Change if the Dollar No Longer Rules the World",
        "date": "2025-04-06",
        "summary": "Should the U.S. currency and Wall Street stocks no longer rise together, Americans will need to broaden their portfolios."
    },
    {
        "company": "MSFT",
        "title": "Galaxy Digital Settles with NYAG for $200 Million Over Luna Ties",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Constellation Brands to Divest Cheaper Wine Brands Amid Organizational Review",
        "date": "2025-04-09",
        "summary": "Alcohol heavyweight Constellation Brands will undergo a review of its organizational structuring that is expected to save the company more than $200 million by 2028."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Poste Italiane, Service Stream and more in the latest Market Talks on the Technology, Media and Telecommunications sectors."
    },
    {
        "company": "MSFT",
        "title": "Wall Street Faces Toughest Test in Years ",
        "date": "2025-04-03",
        "summary": "U.S. stocks fall sharply as investors wrestle with President Trump’s sweeping tariff plans."
    },
    {
        "company": "MSFT",
        "title": "It’s Not a Bird, or a Plane: It’s Your Walmart Delivery",
        "date": "2025-03-28",
        "summary": "Drone-delivery company Zipline aims to safely—and quietly—drop packages to consumers. Plus, WSJ columnist Tim Higgins tells us about the latest in the duality of Elon Musk the "
    },
    {
        "company": "MSFT",
        "title": "Fed Chair Warns of Difficult Choices as Trade War Rages",
        "date": "2025-04-16",
        "summary": "P.M. Edition for April 16. Federal Reserve Chair Jerome Powell warned today that the central bank could face "
    },
    {
        "company": "MSFT",
        "title": "Siemens Agrees to Buy Dotmatics for $5.1 Billion, Expanding AI Portfolio to Life Sciences",
        "date": "2025-04-02",
        "summary": "The deal extends Siemens’s artificial-intelligence-powered product-lifecycle-management portfolio and increases the company’s total addressable market in industrial software by $11 billion."
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Ford Offers Its Employee Discount to All New Car Buyers",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How to Play the Biotech Meltdown in the Age of RFK Jr. and Tariffs",
        "date": "2025-04-11",
        "summary": "Political pressure and persistently high interest rates have some wondering if the industry’s model is broken."
    },
    {
        "company": "MSFT",
        "title": "Nike Stock Drop Erases $12 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Secrets and Misdirection Behind Sam Altman’s Firing From OpenAI",
        "date": "2025-03-28",
        "summary": "The inside story of how the CEO of the hottest tech company was ousted and, just as quickly, resurrected."
    },
    {
        "company": "MSFT",
        "title": "EU Chief Warns Bloc Could Target Digital Services If Talks With U.S. Fail–Report",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple Supplier Luxshare to Maintain Vietnam Production Hub to Support U.S. Market",
        "date": "2025-04-09",
        "summary": "Luxshare Precision Industry, a key assembler of the iPhone and other Apple products, said it will maintain large-scale production in Vietnam and continue exports from there to the U.S., responding to President Trump’s tariffs."
    },
    {
        "company": "MSFT",
        "title": "Ford Says It Is Working With the Trump Administration to Create U.S. Jobs",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Are Headed for Biggest Wipeout in Market Value Since March 2020",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Inside the Law Firm That Decided to Fight Back Against Trump’s Attack",
        "date": "2025-03-28",
        "summary": "Perkins Coie’s biggest clients—including Amazon and Boeing—are staying despite an executive order that targeted the firm, which has Democratic ties."
    },
    {
        "company": "MSFT",
        "title": "These Stocks are Leading Losses Today",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Meta’s Ad Business Relies a Lot on China. Tariffs Could Hurt It, Warns Analyst.",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Inflation, Consumer Fears Fuel Stock Selloff",
        "date": "2025-03-28",
        "summary": "The Dow fell more than 700 points, while gold hit a record and bonds climbed. The anticipation of tariff developments next week also weighed on stocks."
    },
    {
        "company": "MSFT",
        "title": "Rocket’s Deal Aims to Squeeze More From Tough Mortgage Market",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Rocket’s Deal Aims to Squeeze More From Tough Mortgage Market",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "MicroStrategy Expects to Post Loss After Bitcoin Price Slumps",
        "date": "2025-04-07",
        "summary": "The software company said it notched $5.91 billion in unrealized losses on its digital assets for the quarter ended March 31."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Futures Slide After Tough Day for Major Indexes",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Even AI-Infrastructure Spending Is at Risk",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Sink Ahead of Trump’s 104% Tariffs on China",
        "date": "2025-04-08",
        "summary": "P.M. Edition for April 8. U.S. stocks gyrated today but "
    },
    {
        "company": "MSFT",
        "title": "X Was Down for Tens of Thousands Friday Afternoon",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Xi’s Message in Rare Meeting With Global CEOs: Defend Trade",
        "date": "2025-03-28",
        "summary": "China’s leader told foreign executives visiting Beijing that globalization is an “unstoppable historical trend.”"
    },
    {
        "company": "MSFT",
        "title": "The Trump Family Advances Its All-Out Crypto Blitz, This Time With Bitcoin Mining",
        "date": "2025-03-31",
        "summary": "A business led by two of the president’s sons will invest in American Bitcoin, a new mining company controlled by Hut 8."
    },
    {
        "company": "MSFT",
        "title": "Biggest Gains in Innovation in the Management Top 250",
        "date": "2025-03-26",
        "summary": "Bank of New York Mellon tops the list, followed by Duke Energy and Paychex"
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-31",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Caterpillar, Shell, OMV and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "More Than 100 Million Options Contracts Changed Hands on Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: Brake Lights",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Leap, Treasury Yields Ease After Trump Pauses Tariffs",
        "date": "2025-04-10",
        "summary": "Stock markets jumped and Treasury yields dropped after President Trump’s announcement of a 90-day pause on higher-targeted tariffs for most countries, even as he doubled down on China."
    },
    {
        "company": "MSFT",
        "title": "Today's Rally is Nearing Records",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The AI Arms Race Is Coming to Rural America",
        "date": "2025-04-08",
        "summary": "Mark Zuckerberg’s Meta plans to build a "
    },
    {
        "company": "MSFT",
        "title": "Agriculture Stocks Tremble on Tariff Risks for Farmers",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "MSFT",
        "title": "Markets Fall, Dollar Sinks as Investors Grapple with Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": "Plus, SunnyD sells to a Guatemalan company for about $1.5 billion. And New York City Mayor Eric Adams forms his own political party to run for re-election. Alex Ossola hosts. "
    },
    {
        "company": "MSFT",
        "title": "Stocks End Lower After Tariffs Rattle Carmakers",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "MSFT",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    }
]