[
    {
        "company": "MSFT",
        "title": "ServiceNow Bumps Up Annual Guidance as Government Business Grows",
        "date": "2025-04-23",
        "summary": "Chief Executive Bill McDermott said the platform is operating in a best-case-scenario environment as companies look to optimize their supply chains amid recent tariff announcements and federal clients aim to boost efficiency amid government spending cuts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "date": "2025-04-25",
        "summary": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback."
    },
    {
        "company": "MSFT",
        "title": "With Trump Tariffs, Even AI Could Get More Expensive",
        "date": "2025-04-04",
        "summary": "Higher prices may be in store for a range of materials used to build the data centers that will deliver AI."
    },
    {
        "company": "MSFT",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "MSFT",
        "title": "The AI Data-Center Boom Is Coming to Rural America",
        "date": "2025-03-30",
        "summary": "Meta Platforms and other tech companies are looking for huge swaths of flat land and plentiful power."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "MSFT",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "MSFT",
        "title": "Trump Must Deregulate U.S. Energy to Unleash AI Dominance",
        "date": "2025-04-08",
        "summary": "America’s vast natural gas reserves can power data centers and help it win the AI race with China."
    },
    {
        "company": "MSFT",
        "title": "AI Boom to Fuel Surge in Data Center Energy Needs, IEA Says",
        "date": "2025-04-10",
        "summary": "The global push for artificial intelligence is poised to fuel a sharp rise in electricity demand, with consumption from data centers expected to more than double by the end of the decade, according to the International Energy Agency."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Can Europe's Homegrown Satellite Company Compete with Elon Musk's Starlink?",
        "date": "2025-04-14",
        "summary": "Europe is looking at Eutelsat, a smaller rival to Starlink, to reduce its reliance on the U.S. company. Plus, how much personal information should you give an AI chatbot? WSJ personal tech columnist Nicole Nguyen dives into that in our special three-part series “"
    },
    {
        "company": "MSFT",
        "title": "Trump to Review Preliminary TikTok Deal As Deadline Approaches",
        "date": "2025-04-02",
        "summary": "Senior administration officials are expected to attend a Wednesday meeting about a potential deal; plan would require Beijing’s blessing."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street: CoreWeave Delivers a Verdict on the AI Boom—and on Itself",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "Europe Scrambles to Break Its Dependence on Musk’s Satellites",
        "date": "2025-04-13",
        "summary": "Authorities in the region are counting on a homegrown alternative to Starlink and its unpredictable owner."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chatbot Confidential: Using AI for Tax Preparation",
        "date": "2025-03-30",
        "summary": "People are tapping generative AI-powered chatbots for help with everything from writing code to planning vacations. But using generative AI is risker for some tasks than others. Ahead of the last day to file taxes, WSJ’s personal tech columnist Nicole Nguyen joins Tech News Briefing for the special series “Chatbot Confidential,” where she’ll reveal best practices for using AI chatbots while being mindful of protecting your privacy."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on fiber operations, oil futures, Repsol’s joint venture with NEO Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "MSFT",
        "title": "It’s Not a Bird, or a Plane: It’s Your Walmart Delivery",
        "date": "2025-03-28",
        "summary": "Drone-delivery company Zipline aims to safely—and quietly—drop packages to consumers. Plus, WSJ columnist Tim Higgins tells us about the latest in the duality of Elon Musk the "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Is Chinese AI All It’s Cracked Up to Be?",
        "date": "2025-04-16",
        "summary": "Beijing is pushing a tech challenge to the U.S., but Washington can counter it with smart policies."
    },
    {
        "company": "MSFT",
        "title": "Say Hello to Your New Colleague, the AI Agent",
        "date": "2025-04-03",
        "summary": "Today’s CEOs are the final generation of executives who will lead exclusively human workforces."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "AMD Closes $4.9 Billion ZT Systems Deal, Targeting Its Piece of the ‘AI Factory’",
        "date": "2025-03-31",
        "summary": "Chip giant CEO Lisa Su says AI is still in its “very early stage” as the company revs up competition with Nvidia."
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Lobbies Trump to Avoid Meta Antitrust Trial",
        "date": "2025-04-02",
        "summary": "Meta’s chief executive was at the White House on Wednesday, his third visit during Trump’s presidency,  according to people familiar with the matter."
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "MSFT",
        "title": "CoreWeave IPO Prices at $40: Trading Debut to Test Investor Demand for AI",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Drone-Delivery Service Beating Amazon to Your Front Door",
        "date": "2025-03-29",
        "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables."
    },
    {
        "company": "MSFT",
        "title": "Galaxy Digital Settles with NYAG for $200 Million Over Luna Ties",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "WPP Buys InfoSum in AI Push",
        "date": "2025-04-03",
        "summary": "The London-listed ad group said that InfoSum—which will join its media investment group GroupM—will help it create marketing solutions that are enhanced by AI."
    },
    {
        "company": "MSFT",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Tries to Enlist Trump in Fight Against Meta EU Ruling",
        "date": "2025-04-01",
        "summary": "Meta executives have pressed U.S. trade officials to push back against a European Union law that could undermine its ad business."
    },
    {
        "company": "MSFT",
        "title": "EU Chief Warns Bloc Could Target Digital Services If Talks With U.S. Fail–Report",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "The AI Arms Race Is Coming to Rural America",
        "date": "2025-04-08",
        "summary": "Mark Zuckerberg’s Meta plans to build a "
    },
    {
        "company": "MSFT",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "MSFT",
        "title": "AI Agents Are a Moment of Truth for Tech",
        "date": "2025-03-29",
        "summary": "All emerging technology needs to deliver on its promise, sooner or later. For AI agents, that time is now."
    },
    {
        "company": "MSFT",
        "title": "Inside Elon Musk’s Shock-and-Awe Months in the White House",
        "date": "2025-04-05",
        "summary": "President Trump directed his chief of staff to better manage the billionaire adviser after complaints arose from his cabinet and staff."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mission to Take Over NASA—and Mars",
        "date": "2025-03-30",
        "summary": "The billionaire is in position to speed up plans for a voyage to the planet, with a potentially huge impact on SpaceX."
    },
    {
        "company": "MSFT",
        "title": "How Signal Became Washington’s Favorite Messaging App",
        "date": "2025-03-28",
        "summary": "Downloads of the app surged in the past week after the Atlantic published White House officials’ texts about a military strike."
    },
    {
        "company": "MSFT",
        "title": "AI Tools Help Alzheimer’s Researchers Dig Into Data",
        "date": "2025-03-27",
        "summary": "The Oxford Drug Discovery Institute uses artificial intelligence-powered databases "
    }
]