[
    {
        "company": "MSFT",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla, Boeing and Alphabet Earnings: What to Watch for This Week",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Nokia Flags Earnings Hit From Tariffs",
        "date": "2025-04-24",
        "summary": "The company expects to take an earnings hit in the second quarter from tariffs and said that reaching the high end of its guidance range for the year now looked more challenging."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Traders Wager on a Rocky Earnings Season",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla’s Net Income Sinks 71% in First Quarter",
        "date": "2025-04-22",
        "summary": "Plus: stocks rally on optimism from White House on tariff negotiations. And Verizon says it won’t pay for the costs of tariffs on smartphones, but shoppers will. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Tesla, Boeing Earnings; Home Sales: What to Watch This Week",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tesla Profit Slumps",
        "date": "2025-04-22",
        "summary": "Plus: Meta could see a $7 billion pullback from Chinese advertisers over tariffs, research firm says. And Verizon says it won’t cover any handset price increases due to tariffs. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "SAP Shares Jump After Earnings Beat Forecasts Despite Tariff Uncertainty",
        "date": "2025-04-23",
        "summary": "Shares surged after the business-software group posted operating profit that beat analysts’ expectations and backed its full-year guidance, reassuring investors."
    },
    {
        "company": "MSFT",
        "title": "IBM Set to Benefit From Focus on AI, Automation as Clients Seek Efficiency in Uncertain Economy, CFO Says",
        "date": "2025-04-23",
        "summary": "For the second-quarter, IBM guided for sales between $16.4 billion and $16.75 billion, ahead of the $16.31 billion expected by analysts."
    },
    {
        "company": "MSFT",
        "title": "WPP CEO Sees Client Unease Amid Tariff Uncertainty, But No Spending Cuts",
        "date": "2025-04-25",
        "summary": "EXCLUSIVE: “The bigger question is what happens longer term, how this impacts the economy. I don’t think we’ll see that in the U.S. until May,” the head of the advertising company said in an interview."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Boeing Earnings; PMI Surveys; Home Sales: What to Watch Wednesday Onward This Week",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "3M Keeps Guidance but Adds Tariff Hazards",
        "date": "2025-04-22",
        "summary": "The company says Trump’s tariff campaign could knock down adjusted earnings per share by 20 cents to 40 cents this year."
    },
    {
        "company": "MSFT",
        "title": "SK Hynix Posts Strong First Quarter Earnings on AI Chip Demand",
        "date": "2025-04-23",
        "summary": "The South Korean memory chip maker posted stronger-than-expected earnings for the first quarter on brisk demand for artificial-intelligence chips amid uncertainty about sweeping U.S. tariffs."
    },
    {
        "company": "MSFT",
        "title": "Verizon Earnings Top Views; Reports Wider Post-Paid Phones Losses",
        "date": "2025-04-22",
        "summary": "Verizon Communications reported a rise in first-quarter earnings but postpaid phone losses increased. Verizon said it is still on course to meet its yearly goals."
    },
    {
        "company": "MSFT",
        "title": "Comcast Loses Broadband Customers, Takes Theme-Park Hit From L.A. Fires",
        "date": "2025-04-25",
        "summary": "​The company posted lower quarterly earnings, but found bright spots with its mobile-phone plans and Peacock streaming service."
    },
    {
        "company": "MSFT",
        "title": "Colgate-Palmolive Cuts Earnings Outlook on Tariffs",
        "date": "2025-04-25",
        "summary": "Colgate-Palmolive posted a higher profit in the first quarter but lowered 2025 earnings guidance due to tariffs."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Relief Rally, Day Three",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech Shares Drive Stocks Higher for a Third Straight Session",
        "date": "2025-04-24",
        "summary": "Nasdaq Composite is up more than 5% this week on trade-deal optimism."
    },
    {
        "company": "MSFT",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "SAP Posts Higher Revenue, Operating Profit",
        "date": "2025-04-22",
        "summary": "Sales from the business-software company’s core cloud business rose to 4.99 billion euros from 3.93 billion euros while total revenue rose to 9.01 billion euros compared with 8.04 billion euros in the prior-year period."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariff Uncertainty Clobbers Earnings Optimism",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "Stocks Rally on New Hopes of Tariffs Easing",
        "date": "2025-04-22",
        "summary": "The Dow industrials surged more than 1,000 points after Monday’s selloff."
    },
    {
        "company": "MSFT",
        "title": "Hasbro Beats Estimates as Profitability Improves",
        "date": "2025-04-24",
        "summary": "The toymaker said the global tariff war hadn’t impacted first-quarter results, adding that the company wouldn’t touch the guidance it gave in February given the level of uncertainty in the trade environment."
    },
    {
        "company": "MSFT",
        "title": "Merck Cuts 2025 Outlook on Tariffs, Charges",
        "date": "2025-04-24",
        "summary": "Merck’s first-quarter net income increased as sales of its Keytruda cancer drug rose, but the Big Pharma company cut its 2025 adjusted earnings projection, partly to account for recently imposed tariffs."
    },
    {
        "company": "MSFT",
        "title": "Adidas Posts Better-Than-Expected Results Despite Tariff Threat",
        "date": "2025-04-23",
        "summary": "Operating profit rose to €610 million from €336 million previously, the German sporting-goods company said."
    },
    {
        "company": "MSFT",
        "title": "ServiceNow Bumps Up Annual Guidance as Government Business Grows",
        "date": "2025-04-23",
        "summary": "Chief Executive Bill McDermott said the platform is operating in a best-case-scenario environment as companies look to optimize their supply chains amid recent tariff announcements and federal clients aim to boost efficiency amid government spending cuts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla Profit Sinks, Hurt by Backlash Over Elon Musk’s Political Role",
        "date": "2025-04-22",
        "summary": "The chief executive says he will spend significantly less time on DOGE starting in May. First-quarter net income falls 71%."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla Profit Sinks, Hurt by Backlash Over Elon Musk’s Political Role",
        "date": "2025-04-22",
        "summary": "The chief executive says he will spend significantly less time on DOGE starting in May. First-quarter net income falls 71%."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about airline credit cards, BNP Paribas, Oversea-Chinese Banking Corp. and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Fresnillo, gold futures and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "MSFT",
        "title": "Capital One Profit Rises Ahead of Discover Merger",
        "date": "2025-04-22",
        "summary": "Capital One recorded a higher first-quarter profit and is prepared to complete its acquisition of Discover on May 18."
    },
    {
        "company": "MSFT",
        "title": "Meta Could Be Facing $7 Billion in Lost Revenue From China",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Score: UnitedHealth, Netflix, Eli Lilly and More Stocks That Defined the Week",
        "date": "2025-04-18",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news"
    },
    {
        "company": "MSFT",
        "title": "Procter & Gamble Cuts Fiscal-Year Guidance",
        "date": "2025-04-24",
        "summary": "Procter & Gamble lowered its fiscal-year outlook after posting lower sales in the third quarter amid a challenging consumer environment."
    },
    {
        "company": "MSFT",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "MSFT",
        "title": "General Dynamics 1Q Profit Jumps on Rising Revenue",
        "date": "2025-04-23",
        "summary": "General Dynamics recorded higher earnings in the first quarter as its aerospace segment improved its profitability and revenue climbed."
    },
    {
        "company": "MSFT",
        "title": "Netflix, Unscathed by Tariffs, Posts Record Profit",
        "date": "2025-04-17",
        "summary": "The streamer forecasts stronger revenue growth in the second quarter."
    },
    {
        "company": "MSFT",
        "title": "Posco’s Profit Slumps as Trump Tariffs Take Effect",
        "date": "2025-04-24",
        "summary": "The South Korean steelmaker posted lower net profit for the first quarter, dented in part by tariffs on all steel and aluminum imports into the U.S."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "MSFT",
        "title": "Kimberly-Clark Cuts Profit Outlook as New Tariff Costs Mount",
        "date": "2025-04-22",
        "summary": "The CEO said the company doesn’t plan to cut investments or pass the costs on to consumers with across-the-board price increases."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Another Wild Swing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "STMicroelectronics Expects Lower Sales, but Signals Recovery Is Coming",
        "date": "2025-04-24",
        "summary": "The company projected lower sales as weak demand for some semiconductors used in cars and industrial equipment continued to plague an industry that now faces heightened uncertainty from unpredictable tariff policies."
    },
    {
        "company": "MSFT",
        "title": "STMicroelectronics Expects Lower Sales, but Signals Recovery Is Coming",
        "date": "2025-04-24",
        "summary": "The company projected lower sales as weak demand for some semiconductors used in cars and industrial equipment continued to plague an industry that now faces heightened uncertainty from unpredictable tariff policies."
    },
    {
        "company": "MSFT",
        "title": "Intel Sees Rising ‘Probability of a Recession’ From Tariffs",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Intel Cuts Outlook, Says Layoffs Are in Store",
        "date": "2025-04-24",
        "summary": "The American chip-making giant’s stock fell after it said an overhaul is under way and that macro conditions would prove challenging."
    },
    {
        "company": "MSFT",
        "title": "How Much Have Stocks Rebounded? Are We Still In a Bear Market?",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    },
    {
        "company": "MSFT",
        "title": "IMF Warns Tariffs Will Slow Global Economic Growth and Hit U.S. Economy",
        "date": "2025-04-22",
        "summary": "Plus, Gold surges to $3500 in intraday trading. And defense stocks fall after some of the biggest industry names report their earnings. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Intel Sees ‘Probability of a Recession’ From Tariffs",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Whirlpool Sales Slide as Tariff Fears Hit Results",
        "date": "2025-04-24",
        "summary": "Whirlpool sales dropped in the latest quarter, with business taking a hit as tariffs prompted Asia-based appliance manufacturers to ramp up shipments into the U.S. and put a chill on its business in Canada and Europe."
    },
    {
        "company": "MSFT",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Rises 0.7% to 96.56",
        "date": "2025-04-23",
        "summary": "The WSJ Dollar Index was up 0.7% to 96.56 — up for two consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about Merck, EssilorLuxottica, Wuxi Biologics and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Merck, Sanofi and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Nissan Expects Roughly $5 Billion Net Loss From Impairments, Restructuring Costs",
        "date": "2025-04-24",
        "summary": "Nissan Motor estimated billions of dollars in net loss for the fiscal year ended March due to impairments and restructuring expenses."
    },
    {
        "company": "MSFT",
        "title": "GE Vernova Swings to Profit as Backlog Rises",
        "date": "2025-04-23",
        "summary": "GE Vernova swung back to a profit in the first quarter as orders stacked up and its revenue climbed, sending shares higher in the premarket session."
    },
    {
        "company": "MSFT",
        "title": "AT&T Adds More Subscribers, Sees Tariffs Spurring Phone Upgrades",
        "date": "2025-04-23",
        "summary": "The telecom company said that tariffs triggered an acceleration in consumers upgrading their mobile phones."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "MSFT",
        "title": "How Many Trillions Do Americans Spend Complying With Federal Rules?",
        "date": "2025-04-24",
        "summary": "The regulatory tax rivals the income tax."
    },
    {
        "company": "MSFT",
        "title": "Philip Morris Stock at Record High as Zyn Powers Profits",
        "date": "2025-04-23",
        "summary": "Philip Morris International gave its earnings outlook a bump after sustained momentum for its popular Zyn pouch brand powered its profit and revenue higher in the first quarter."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.5% to 96.07",
        "date": "2025-04-24",
        "summary": "The WSJ Dollar Index was down 0.5% to 96.07 — snapping a two-trading-day winning streak."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "LG Electronics Posts Earnings Beat, Plans to Relocate Some Production to U.S.",
        "date": "2025-04-24",
        "summary": "The South Korean consumer-electronics giant reiterated plans to relocate some production to the U.S. in response to President Trump’s recent tariff action."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on American Express, Macquarie and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Pepsi and Mountain Dew Depend on Imports. PepsiCo Says Tariffs Will Hurt Earnings.",
        "date": "2025-04-24",
        "summary": "The maker of Doritos and Cheetos also cited a drop in consumer confidence caused by inflation and the global trade war."
    },
    {
        "company": "MSFT",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Morgan Stanley’s Profit Surged on Trading Revenue",
        "date": "2025-04-11",
        "summary": "The bank’s profit increased to $4.32 billion in the first three months of the year, or $2.60 per share, surpassing the $2.18 per share analysts expected."
    },
    {
        "company": "MSFT",
        "title": "Russia Launches Major Assault on Kyiv",
        "date": "2025-04-24",
        "summary": "A.M. Edition for April 24. Moscow has "
    },
    {
        "company": "MSFT",
        "title": "PepsiCo Says Tariff Costs Will Contribute to Earnings Decline this Year",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Tariffs Show Mixed Impact on Big Economies",
        "date": "2025-04-23",
        "summary": "Business activity in the U.S. and Europe weakened in April, in contrast to pickups in Japan and India, underlining the diverse ways in which higher U.S. tariffs are affecting economies around the world."
    },
    {
        "company": "MSFT",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "date": "2025-04-25",
        "summary": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback."
    },
    {
        "company": "MSFT",
        "title": "Citigroup Reports Jump in Profit, Revenue",
        "date": "2025-04-15",
        "summary": "Citigroup reported a jump in profit and revenue in the first quarter of 2025 that beat analysts’ expectations, thanks in part to market volatility that generated higher fees for its trading business."
    },
    {
        "company": "MSFT",
        "title": "RTX Sees $850 Million Hit From Tariffs",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Marketers Are ‘Scenario Planning’ in an Uncertain Economy, Ad Giant IPG Says",
        "date": "2025-04-24",
        "summary": "Interpublic Group reiterated its 2025 organic revenue guidance and tried to assure analysts that it’s capable of handling any potential downturn."
    },
    {
        "company": "MSFT",
        "title": "Boeing Leans on Backlog, Looks for Alternatives to China Trade",
        "date": "2025-04-23",
        "summary": "The airplane maker reported a narrower first-quarter loss as CEO Kelly Ortberg said the company’s higher backlog has provided some flexibility amid the trade war."
    },
    {
        "company": "MSFT",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Tesla Stock Jumps After Musk Says He Will Spend Less Time on DOGE",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Continue Rally for Second Day",
        "date": "2025-04-23",
        "summary": "Plus: The White House says there will be \"no unilateral reduction in tariffs against China.\" And OpenAI CEO Sam Altman says he is stepping down as chairman of the nuclear-energy startup Oklo. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "Nestle Sales Get Boost From Coffee, Chocolate Price Hikes",
        "date": "2025-04-24",
        "summary": "Nestle posted higher sales that beat analysts’ expectations, with broad-based growth across all markets and categories."
    },
    {
        "company": "MSFT",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "MSFT",
        "title": "GE Aerospace Profit Climbs on Gains in Commercial Services, Defense",
        "date": "2025-04-22",
        "summary": "The maker of jet engines reported higher earnings for the first quarter on revenue gains from its defense businesses and commercial engines and services unit."
    },
    {
        "company": "MSFT",
        "title": "Kimberly-Clark Lowers Profit Forecast, Citing ‘Geopolitical Landscape’",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Rent the Runway, Xiaomi , Telecom Italia, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about Canadian railway cargo, Kuehne + Nagel, Renault and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Trump Targets Democratic Fundraising",
        "date": "2025-04-25",
        "summary": "A.M. Edition for April 25. President Trump directs the Justice Department to "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Gain insight on Comerica, Meiji Yasuda Life Insurance and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Newmont Profit, Revenue Jump, Boosted by Gold Surge",
        "date": "2025-04-23",
        "summary": "The gold miner recorded a profit of $1.9 billion, or $1.68 a share, up from $179 million, or 15 cents a share, a year earlier."
    },
    {
        "company": "MSFT",
        "title": "BNP Paribas Gets Boost From Market Frenzy",
        "date": "2025-04-24",
        "summary": "The French lender confirmed its midterm targets after results were boosted by recent market volatility but higher costs weighed on profit."
    },
    {
        "company": "MSFT",
        "title": "Sanofi Sales, Profit Beat Expectations on Higher Demand for Skin, Asthma Drug",
        "date": "2025-04-24",
        "summary": "The pharmaceutical company said the profit was driven by a higher gross margin and slower operating expense growth."
    },
    {
        "company": "MSFT",
        "title": "3M Counts on Far-Flung Factories to Blunt Tariffs’ Hit",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on CarMax, Tesla and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Samsung Guides for Softer First-Quarter Profit But Still Beats Consensus",
        "date": "2025-04-08",
        "summary": "Samsung Electronics guided for softer first-quarter operating profit amid few signs of an immediate recovery in its flagship semiconductor business."
    },
    {
        "company": "MSFT",
        "title": "Dow Logs Loss, Launches Cost-Cutting Measures Due to Slowdown",
        "date": "2025-04-24",
        "summary": "Dow posted a hefty first-quarter loss and said it planned a drastic pullback in capital expenditure due to a slump in demand for plastic and other products."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Either Sadness or Euphoria",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on oil futures, Woodside Energy and more in the latest Market Talks covering the Energy & Utilities sector."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Defense Stocks Tumble After RTX Warns of Tariff Hit",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Wall Street’s Trading Revenue Powered by Tariff Uncertainty",
        "date": "2025-04-14",
        "summary": "Goldman Sachs is the latest big bank to report that increased trading fueled its quarterly profit."
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Just Eat Takeaway Posts Flat Growth for Key Metric, Backs Guidance",
        "date": "2025-04-23",
        "summary": "The food-delivery group said gross transaction value for the first quarter was €4.72 billion, compared with €4.70 billion for the same period a year earlier."
    },
    {
        "company": "MSFT",
        "title": "Dow Falls More Than 1,000 Points, Nasdaq Loses 4% in Another Volatile Day",
        "date": "2025-04-10",
        "summary": "Plus: President Trump says he is open to Japan’s Nippon Steel investing in U.S. Steel but not owning it. CarMax misses its quarterly earnings estimates. And Modelo owner Constellation Brands cuts its annual outlook. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Northrop Grumman Trims 2025 Outlook Following Slower Sales, Higher Bomber-Program Costs",
        "date": "2025-04-22",
        "summary": "The defense contractor’s  first-quarter earnings and sales missed analysts’ estimates."
    },
    {
        "company": "MSFT",
        "title": "Unilever Confident for 2025 Amid Turnaround Plan, Ice-Cream Spinoff",
        "date": "2025-04-24",
        "summary": "The consumer-brands giant was on track to meet its goals for the year after sales were boosted by its key brands, and despite a hit to turnover from net disposals and currency effects."
    },
    {
        "company": "MSFT",
        "title": "Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": "WSJ Heard on the Street columnist Dan Gallagher breaks down why Tesla stock is on the rise even after the electric car company posted a 71% drop in net income during its most recent quarter. "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Tesla, BYD, Volvo, and more in the latest Market Talks covering the auto and transport sector."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Hertz, MicroStrategy, Capital One, Comerica",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall and the Dollar Drops Amid Trump’s Threats to Fire Fed Chair",
        "date": "2025-04-21",
        "summary": "Investors are seeking refuge after President Trump’s renewed attacks on Federal Reserve chief Jerome Powell. Plus: DHL stock falls after it suspends high-value shipments to the U.S. And Capital One shares rise after regulators approve its $35 billion acquisition of Discover. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Welcome to Schrödinger’s Stock Market",
        "date": "2025-04-18",
        "summary": "United’s decision to give dueling earnings guidance is mind-bending for investors."
    },
    {
        "company": "MSFT",
        "title": "Tesla Has a Deep Hole to Pull Out Of",
        "date": "2025-04-23",
        "summary": "Elon Musk promises more attention on the EV maker, but brand damage from his political activities won’t be easy to repair."
    },
    {
        "company": "MSFT",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "MSFT",
        "title": "Now Streaming on Netflix: A Show Where Profits Trump the Trade War",
        "date": "2025-04-18",
        "summary": "The streaming giant sticks by its full-year forecast in a rare show of resilience in a tumultuous market."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Huge Stock Swings Are the New Normal for Frazzled Investors",
        "date": "2025-04-23",
        "summary": "April is poised to be the most-volatile calendar month since the Covid crash in 2020."
    },
    {
        "company": "MSFT",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Gains Accelerate",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Find insights into  bank earnings,  CIMB Group and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Watch: Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on Capital Power, commodity prices  and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street: CoreWeave Delivers a Verdict on the AI Boom—and on Itself",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump Is Everywhere Except in the Economic Data",
        "date": "2025-04-21",
        "summary": "Fears that tariffs, spending cuts and deportations would lead to recession and inflation have yet to show up in the numbers."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: Purchasing Managers’ Surveys in Focus",
        "date": "2025-04-18",
        "summary": "Provisional U.S. purchasing managers’ surveys for April will be closely watched for signs of how businesses are reacting to tariff announcements. Equivalent surveys will also be released in the eurozone and the U.K."
    },
    {
        "company": "MSFT",
        "title": "Why Earnings Expectations Are Too High",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: Purchasing Managers’ Surveys in Focus",
        "date": "2025-04-18",
        "summary": "Provisional U.S. purchasing managers’ surveys for April will be closely watched for signs of how businesses are reacting to tariff announcements. Equivalent surveys will also be released in the eurozone and the U.K."
    },
    {
        "company": "MSFT",
        "title": "Why Earnings Expectations Are Too High",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Russia Attacks Kyiv, Killing Nine",
        "date": "2025-04-24",
        "summary": "Plus, Tesla’s sales in Europe fall for a third consecutive month. And President Trump rejects a tax hike on millionaires. Kate Bullivant hosts."
    },
    {
        "company": "MSFT",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "Plus: Goldman Sachs profit surges as tariff uncertainty powers trading revenue. And U.S. companies are going bankrupt at the fastest rate since 2010. Charlotte Gartenberg hosts."
    },
    {
        "company": "MSFT",
        "title": "MicroStrategy Expects to Post Loss After Bitcoin Price Slumps",
        "date": "2025-04-07",
        "summary": "The software company said it notched $5.91 billion in unrealized losses on its digital assets for the quarter ended March 31."
    },
    {
        "company": "MSFT",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Could Pause Ukraine Talks If Progress Isn’t Made Soon",
        "date": "2025-04-18",
        "summary": "A.M. Edition for April 18. Secretary of State Marco Rubio says Washington has presented Kyiv and Moscow with a framework deal to end their war, but that "
    },
    {
        "company": "MSFT",
        "title": "By the Numbers: How Bad Was This Week in the Stock Market?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "S&P and Nasdaq Notch Biggest Quarterly Losses Since 2022",
        "date": "2025-03-31",
        "summary": "A mixed session capped a turbulent quarter as investors turned from excitement over President Trump’s tax cuts and deregulation to fears over tariffs and a recession. Plus: Newsmax shares surge on first day of trading. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": " Dow and Dollar Drop as Trump Renews Attacks on the Fed",
        "date": "2025-04-21",
        "summary": "Plus: Russia welcomes U.S. proposal to deny Ukraine NATO membership as talks to end war continue. And, Chipotle plans to expand south, to Mexico and Latin America. Charlotte Gartenberg hosts. "
    },
    {
        "company": "MSFT",
        "title": "Bunzl Shares Hit 4-Year Lows on Guidance Cut, Share-Buyback Pause",
        "date": "2025-04-16",
        "summary": "Bunzl cut its guidance for the year and paused its share-buyback program given the uncertain macro environment and resulting margin pressure in its North American business."
    },
    {
        "company": "MSFT",
        "title": "Bank Trading Desks Are Minting Money From Trump’s Tariff Chaos",
        "date": "2025-04-15",
        "summary": "Goldman Sachs, JPMorgan and Morgan Stanley all saw huge jumps in trading revenue."
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Edge Lower While Investors Wait for Signs on Tariff Talks",
        "date": "2025-04-15",
        "summary": "The Dow Industrials and the S&P 500 slid fractionally; bank stocks gained on strong earnings reports."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Traders Expect Wild Swings After Tesla Reports Earnings",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Abbott Labs Bracing for Tariffs as Profits Rise",
        "date": "2025-04-16",
        "summary": "Abbott Labs boosted its earnings in the first quarter and hinted that its full-year guidance might have gotten a lift were it not for looming cost hikes from the recent tariff war."
    },
    {
        "company": "MSFT",
        "title": "Huawei Posts Profit Drop But Revenue Signals Solid Comeback",
        "date": "2025-03-31",
        "summary": "The Chinese technology giant’s net profit fell in 2024 as higher expenses weighed, but solid revenue growth signals that the company is making a comeback after years of heavy U.S. sanctions that have affected its businesses."
    },
    {
        "company": "MSFT",
        "title": "U.S. Bancorp Profit Climbs With Higher Fees, Lower Costs",
        "date": "2025-04-16",
        "summary": "The parent company of U.S. Bank posted a profit of $1.71 billion, or $1.03 a share,  above analysts expectations of 98 cents a share."
    },
    {
        "company": "MSFT",
        "title": "Bank of America, Citi Stocks Rally; Wall Street Profits From Tariff Chaos",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Bank Shots",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Don’t Blame Trump for All of the Stock Market’s Problems",
        "date": "2025-03-27",
        "summary": "Though the trade war has heightened uncertainty, slower earnings growth and a cooler labor market would likely have impacted the market regardless."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tesco Shares Fall on Profit Warning as Competition Heats Up",
        "date": "2025-04-10",
        "summary": "Shares fell after the U.K.’s largest supermarket said it expects profit to fall as competition intensifies, with rivals such as Asda ramping up efforts to gain market share."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "MSFT",
        "title": "Powell, Global Rate Moves, Retail Sales: What to Watch This Week in Markets",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on CarMax, General Motors, container shipping lines, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks End Tumultuous Week Highe",
        "date": "2025-04-11",
        "summary": "Stocks rose after the White House said it has 15 trade-deal offers on the table and China said set its reciprocal tariffs on U.S. imports at 125%. Plus: Big banks’ stocks rose after posting profits from equities trading revenue. And shares of gold mining companies jumped amid investors’ rush to haven assets. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "MSFT",
        "title": "BlackRock’s Assets Hit Record as Net Income Falls",
        "date": "2025-04-11",
        "summary": "BlackRock’s quarterly net income fell slightly from a year earlier, while the investment firm’s assets under management edged higher to a record $11.6 trillion."
    },
    {
        "company": "MSFT",
        "title": "TSMC Maintains Solid 2025 Outlook Despite Tariff Worries",
        "date": "2025-04-17",
        "summary": "The world’s largest contract chip maker remains confident that it can post solid sales growth this year."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall, Wiping Out More Than $3 Trillion in Market Value",
        "date": "2025-04-03",
        "summary": "P.M. Edition for April 3. U.S. markets experience their s"
    },
    {
        "company": "MSFT",
        "title": "United Airlines Tops Expectations Despite Travel Demand Worries",
        "date": "2025-04-15",
        "summary": "The airline offered two sets of profit guidance depending on whether the U.S. enters a recession or not as it reported quarterly results that beat Wall Street expectations."
    },
    {
        "company": "MSFT",
        "title": "Wells Fargo Profit Rises, Boosted by Lower Expenses",
        "date": "2025-04-11",
        "summary": "Wells Fargo booked a bigger profit in the first quarter, as lower expenses helped offset a decline in net interest income."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "MSFT",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "MSFT",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Bank of America, Citigroup and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "Publicis Confirms Outlook After Organic Growth Beats Expectations",
        "date": "2025-04-15",
        "summary": "The advertising and marketing-services group confirmed its outlook for the year after first-quarter organic growth beat expectations, saying new business wins can make up for potential cuts to client spending due to tariff uncertainty."
    },
    {
        "company": "MSFT",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "MSFT",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "MSFT",
        "title": "Volkswagen Earnings Miss Hopes on Higher Costs, Including Tariff Hit",
        "date": "2025-04-10",
        "summary": "First-quarter earnings missed expectations after taking a hit from one-off items including some early impact from U.S. import tariffs."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "MSFT",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Drop on Fears of Escalating U.S.-China Trade Tensions",
        "date": "2025-04-16",
        "summary": "European and Asian stock indexes were down, along with U.S. futures, as investor confidence soured on signs of worsening trade tensions between the world’s two largest economies."
    },
    {
        "company": "MSFT",
        "title": "Meta’s Ad Business Relies a Lot on China. Tariffs Could Hurt It, Warns Analyst.",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Sainsbury’s Profit Beat Market Views",
        "date": "2025-04-17",
        "summary": "Sainsbury’s beat profit expectations for the full fiscal year, as the company focuses on supporting sales volumes by lowering prices."
    },
    {
        "company": "MSFT",
        "title": "Ericsson Posts Rise in North American Spending Ahead of Tariffs",
        "date": "2025-04-15",
        "summary": "The network business reported a 6% rise in sales, with strong growth in North America as customers moved forward investments ahead of planned U.S. tariffs."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Post Worst Quarter Since 2022 on Threat of Trade War",
        "date": "2025-03-31",
        "summary": "Tariff uncertainty and a flagging tech trade dragged the S&P 500 and Nasdaq lower to start 2025."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Interactive Brokers, Travelers, UniCredit, and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Canada’s auto industry, Delta, Mercedes-Benz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Tariff Wipeout",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dow Drops More Than 500 Points",
        "date": "2025-04-17",
        "summary": "Trump renews attack on Federal Reserve Chair Jerome Powell. Plus, Netflix posts higher-than expected earnings. Eli Lilly stock surges after GLP-1 pill succeeds in a pivotal trial. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on TotalEnergies, BP, Viva Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Tariff Scramble",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Read about March U.S. retail sales, United Airlines, BMW,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Wall Street Bonuses Powered New York’s Economy in 2024. Some Worry They Peaked.",
        "date": "2025-03-26",
        "summary": "The average annual payout jumped 31% to $244,700."
    },
    {
        "company": "MSFT",
        "title": "Despite the Trade War, Chip Maker TSMC Remains Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": "Plus, Japan and Italy try to find common ground with the White House on trade. And Trump officials have requested that the IRS start the process of revoking Harvard’s tax-exempt status. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "LG Electronics Expects Lower Quarterly Operating Profit",
        "date": "2025-04-07",
        "summary": "The South Korean consumer-electronics giant forecast a 5.7% drop in first-quarter operating profit, though it sustained steady revenue growth."
    },
    {
        "company": "MSFT",
        "title": "UnitedHealth Shares Tumble After Earnings Fall Short Due to Medicare Issues",
        "date": "2025-04-17",
        "summary": "The healthcare company slashed its 2025 projections, citing higher-than-expected costs for people enrolled in its Medicare plans."
    },
    {
        "company": "MSFT",
        "title": "Wise Posts Higher Volume, Customer Growth",
        "date": "2025-04-15",
        "summary": "The money-transfer company’s cross-border volume increased 28%, boosted by active customer growth of 17%."
    },
    {
        "company": "MSFT",
        "title": "Stocks Tumble Again in Brutal Week on Wall Street",
        "date": "2025-04-04",
        "summary": "The U.S. stock market lost $6.6 trillion in market cap in two days as China retaliated against President Trump’s wide-ranging tariffs. Plus: Shares of companies that make goods in Vietnam rise after Trump said the country wants to negotiate, while chip stocks fell. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Rise on Tech Tariff Reprieve ",
        "date": "2025-04-14",
        "summary": "Stocks gained after Trump exempted semiconductor equipment, smartphones and other electronics from tariffs, even though officials later signaled they would be put in their own levy bracket."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "MSFT",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "MSFT",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ashmore, Goldman Sachs and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Mixed With Trade Talks in Focus",
        "date": "2025-04-17",
        "summary": "Traders weighed tentative hopes for U.S.-China talks, as Asian stock markets closed higher and U.S. stock futures rose following Wednesday’s tech-fueled slump on Wall Street."
    },
    {
        "company": "MSFT",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Mixed With Trade Talks in Focus",
        "date": "2025-04-17",
        "summary": "Traders weighed tentative hopes for U.S.-China talks, as Asian stock markets closed higher and U.S. stock futures rose following Wednesday’s tech-fueled slump on Wall Street."
    },
    {
        "company": "MSFT",
        "title": "Jefferies Results Suggest Wall Street Down but Hardly Out",
        "date": "2025-03-27",
        "summary": "A surprise revenue drop signals caution on dealmaking under Trump."
    },
    {
        "company": "MSFT",
        "title": "Nordea Backs Guidance After Earnings Beat",
        "date": "2025-04-16",
        "summary": "The lender posted net profit attributable to shareholders of €1.21 billion for the first quarter, down slightly from a year earlier."
    },
    {
        "company": "MSFT",
        "title": "Inflation, Consumer Fears Fuel Stock Selloff",
        "date": "2025-03-28",
        "summary": "The Dow fell more than 700 points, while gold hit a record and bonds climbed. The anticipation of tariff developments next week also weighed on stocks."
    },
    {
        "company": "MSFT",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "MSFT",
        "title": "Uniqlo Owner Boosts Earnings Forecast",
        "date": "2025-04-10",
        "summary": "Fast Retailing boosted its annual earnings forecast despite tariff uncertainties, expecting another year of record profit as revenue continued to grow across regions."
    },
    {
        "company": "MSFT",
        "title": "JPMorgan and Morgan Stanley Show Trading Boomed During Early Tariff Turmoil",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariff Upheaval Threatens Private Equity’s Exit Recovery Hopes",
        "date": "2025-04-14",
        "summary": "U.S. private-equity exits and their total value rose in the first quarter compared with a year ago, but recent market volatility puts that momentum at risk."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall Sharply as Consumer Sentiment Sours in March",
        "date": "2025-03-28",
        "summary": "P.M. Edition for Mar. 28. Stocks sold off after hotter-than-expected inflation data, President Trump's tariff announcements and "
    },
    {
        "company": "MSFT",
        "title": "Logitech Withdraws FY26 Outlook Amid Tariff Uncertainty",
        "date": "2025-04-10",
        "summary": "he company’s move comes a day after President Trump placed a 90-day pause on most of his across-the-board reciprocal tariffs."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Thursday Recap: Dollar Ills",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump’s Tariffs Wipe Out Over $6 Trillion on Wall Street in Epic Two-Day Rout",
        "date": "2025-04-04",
        "summary": "The selloff capped the worst week since 2020, as fears of a recession mount"
    },
    {
        "company": "MSFT",
        "title": "U.K. Wages Accelerated Despite Tariff, Tax Pressures Ahead",
        "date": "2025-04-15",
        "summary": "Wage growth in the U.K. picked up in the first few months of the new year, suggesting that continued high inflation will remain a concern for the Bank of England, despite the damping effect on growth likely to come from U.S. trade tariffs."
    },
    {
        "company": "MSFT",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall Sharply as Global Economic Outlook Remains Uncertain",
        "date": "2025-04-10",
        "summary": "P.M. Edition for April 10. Yesterday’s market rally gave way to "
    },
    {
        "company": "MSFT",
        "title": "BYD Guides for Strong Earnings in Move to Shore Up Market Confidence",
        "date": "2025-04-08",
        "summary": "China’s biggest automaker forecast strong first-quarter earnings in rare early guidance, a move aimed at restoring confidence among investors."
    },
    {
        "company": "MSFT",
        "title": "China Hits U.S. Goods With 125% Tariff",
        "date": "2025-04-11",
        "summary": "A.M. Edition for April 11. Beijing unveils another round of trade countermeasures against Washington, saying "
    },
    {
        "company": "MSFT",
        "title": "Global Equities Tumble on Sweeping U.S. Tariffs",
        "date": "2025-04-03",
        "summary": "European stocks tumbled at the open, following Asia and U.S. stock futures lower in the wake of worse-than-expected U.S. tariffs that raised concerns about a global economic slowdown."
    },
    {
        "company": "MSFT",
        "title": "Spotify, Netflix Prove Bright Spots Within Broader Market Selloff",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Mastercard, Santander, Allianz Trade and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall After President Trump Unveils New Tariffs on Auto Imports",
        "date": "2025-03-27",
        "summary": "Shares in all of the Big Three U.S. automakers dropped after the announcement, but Tesla stock ticked up. Plus: GameStop plunged after saying it would issue $1.3 billion of convertible bonds to buy bitcoin. And Dollar Tree shares jumped after announcing the sale of its Family Dollar business. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Settles on Tariff Plan Ahead of ‘Liberation Day’ Deadline",
        "date": "2025-04-01",
        "summary": "Plus, Meta CEO Mark Zuckerberg is pressing U.S. trade officials to help fight an expected European Union ruling that could undermine its ad business. And Softbank agrees to lead $40 billion funding for OpenAI. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Deliveroo Revenue Rises on Strong Growth, Backs Guidance",
        "date": "2025-04-17",
        "summary": "The food delivery company reported higher revenue for the first quarter, boosted by robust gross transaction value growth in key markets."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on U.S. auto sales in March, the Canadian economy, Germany’s labor market, and more in the latest Market Talks covering the auto and transport sector."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: Buy the Yips",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-29",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Tariff Scramble",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Investigating Pharmaceutical and Semiconductor Tariffs",
        "date": "2025-04-15",
        "summary": "Plus, South Korea says it’s preparing roughly $23 billion in government support for the chip sector amid tariff uncertainty. And Netflix aims for a $1trillion market capitalization. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Gold Is Green",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Tumble as Trade-War Jitters Return",
        "date": "2025-04-10",
        "summary": "The Dow industrials and S&P 500 give back some gains from Wednesday’s historic rally."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Read about  Tesla, U.S. machinery companies,  airlines,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Why the Trade War Isn’t Over for America’s Biggest Banks",
        "date": "2025-04-10",
        "summary": "As bank-earnings season begins Friday with JPMorgan, investors care more about the outlook than prior results."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Albertsons Sales Grow on Boost From Pharmacy Business",
        "date": "2025-04-15",
        "summary": "Albertsons  saw its top-line figure increase in the latest quarter as its pharmacy business powered identical sales growth."
    },
    {
        "company": "MSFT",
        "title": "Albertsons Sales Grow on Boost From Pharmacy Business",
        "date": "2025-04-15",
        "summary": "Albertsons  saw its top-line figure increase in the latest quarter as its pharmacy business powered identical sales growth."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Fed Chair in the Hot Seat",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Post Gains Ahead of Trump Tariff Announcement",
        "date": "2025-04-02",
        "summary": "Investors hope clarity on trade will help markets recover."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on WELL Health Technologies, Novo Nordisk, CSPC Pharmaceutical and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Dollar Tree Attracts More Shoppers As Recession Fears Loom",
        "date": "2025-03-26",
        "summary": "Dollar Tree said more customers across incomes shopped at its stores in the latest quarter, a sign that concerns about the economy are giving the discount retailer a boost."
    },
    {
        "company": "MSFT",
        "title": "Wall Street’s ‘Smart Money’ Braced for Tariff Chaos. It Was Still Caught Off Guard.",
        "date": "2025-04-13",
        "summary": "Even hedge funds weren’t prepared for the gyrations in stocks, Treasurys and currencies."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Read about Mullen Group’s acquisition of Cole Group, Stellantis, Volvo, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "WSJ’ s Take On the Week Podcast: What to Watch For This Earnings Season As Trump’s Tariffs Come Into Play",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heineken Tops Revenue View, Reaffirms Outlook Amid Tariff Concerns",
        "date": "2025-04-16",
        "summary": "The Dutch brewer backed its full-year guidance after quarterly performance beat market expectations, but warned that the consumer and geopolitical backdrop remains volatile."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Tesla, Nvidia, Newsmax",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on transportation jobs, Tesla, auto tariffs and more in the latest Market Talks covering auto and transport."
    },
    {
        "company": "MSFT",
        "title": "S&P, Nasdaq Post Worst Quarter Since 2022",
        "date": "2025-03-31",
        "summary": "P.M. Edition for Mar. 31. U.S. markets bounced back from "
    },
    {
        "company": "MSFT",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "MSFT",
        "title": "ABB Posts Increase in Earnings, Plans Robotics Business Spinoff",
        "date": "2025-04-17",
        "summary": "First-quarter net profit rose above analysts’ expectations to $1.10 billion at ABB, which intends to spin off its robotics division through a share distribution."
    },
    {
        "company": "MSFT",
        "title": "Asian Stock Markets Fall on Tariff Concerns",
        "date": "2025-04-16",
        "summary": "Equity markets in Asia declined as concerns about tariffs again weighed on sentiment, with technology shares hit by uncertainty over how the Trump administration’s trade policies will affect supply chains."
    },
    {
        "company": "MSFT",
        "title": "Inflation Data, Tariff Worries Weigh on Stocks",
        "date": "2025-03-28",
        "summary": "Plus, automaker shares extend losses. And the Coreweave IPO disappoints in a stumble for the market for new public listings. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Inflation Data, Tariff Worries Weigh on Stocks",
        "date": "2025-03-28",
        "summary": "Plus, automaker shares extend losses. And the Coreweave IPO disappoints in a stumble for the market for new public listings. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Private Equity World Engulfed by Perfect Storm",
        "date": "2025-04-18",
        "summary": "Tariff-related market turmoil dashes investors’ hopes for payouts​ as dealmaking grinds to a near standstill."
    },
    {
        "company": "MSFT",
        "title": "How One of the Wildest Weeks in Market History Unfolded",
        "date": "2025-04-12",
        "summary": "A tense, volatile week on Wall Street ended with all three major U.S. indexes up 5% or more, yet still below where they were when President Trump launched his tariff blitz."
    },
    {
        "company": "MSFT",
        "title": "Omnicom Gives More Cautious 2025 Outlook As Tariffs Create Uncertainty about Ad Spending ",
        "date": "2025-04-15",
        "summary": "Advertising giant hasn’t seen any specific instances of marketer clients pulling back thus far, executives say."
    },
    {
        "company": "MSFT",
        "title": "Stocks End Lower After Tariffs Rattle Carmakers",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ford, GM, Stellantis, and more in the latest Market Talks covering Auto and Transport."
    },
    {
        "company": "MSFT",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Musk’s Megadeal Between X and xAI Breaks Wall Street’s Rulebook ",
        "date": "2025-04-01",
        "summary": "The tech titan can follow his own rules when he is combining two companies he owns, but the merger is still raising dealmaker eyebrows."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 1% To 96.71 ",
        "date": "2025-04-11",
        "summary": "The WSJ Dollar Index was down 1% to 96.71 —lower for four consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Nike Stock Drop Erases $12 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dollar Recovers While Recession Fears Grip Wall Street",
        "date": "2025-04-04",
        "summary": "The dollar recovered as Wall Street struggled with recession fears triggered by Trump tariffs, while data show U.S. labor markets are still healthy."
    },
    {
        "company": "MSFT",
        "title": "ASML Warns on Tariff Uncertainty, Logs Weak Orders",
        "date": "2025-04-16",
        "summary": "Orders for the Dutch company’s semiconductor-making equipment came in below forecasts."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.1% to 99.73",
        "date": "2025-03-27",
        "summary": "The WSJ Dollar Index was down 0.1% to 99.73 — down for two of the past three trading days."
    },
    {
        "company": "MSFT",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on chemical exports to China, Canadian commodities producers, SKC and more in the latest Market Talks covering basic materials."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: A $2-Trillion Swing",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on HSBC, Standard Chartered and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "On WSJ’s Take On the Week, co-host Telis Demos and guest co-host Miriam Gottfried dive into the impending 25 percent tariffs that are set to be placed on global automotive imports to the U.S. Then, we explore what the bond market tells us and what a decrease in the U.S. Treasury yields means for investors. Plus, is the IPO market buzzing? Provider of specialized cloud-computing services, CoreWeave, is the latest company to debut for trading. With companies like StubHub, eToro, and Klarna also announcing public offerings, does this mean more deals are on the horizon?"
    },
    {
        "company": "MSFT",
        "title": "‘This Is a Great Time to Buy’: Tariff Pause Sparks Historic Rally",
        "date": "2025-04-09",
        "summary": "U.S. stocks staged a historic rally after President Trump announced a 90-day pause on some tariffs and signaled a willingness to negotiate on trade."
    },
    {
        "company": "MSFT",
        "title": "These Stocks are Leading Losses Today",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Caterpillar, Shell, OMV and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: UnitedHealth, Marvell, CVS, Humana",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on Delta Air Lines, Tesla, Continental, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: Brake Lights",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on gold, JPMorgan Chase, Wells Fargo and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Wall Street Sounds an Alarm: The Economy Is at Risk Thanks to Tariffs",
        "date": "2025-04-11",
        "summary": "JPMorgan Chase’s Jamie Dimon and BlackRock’s Larry Fink both said the turbulence wasn’t like prior financial crises."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: JPMorgan, Wells Fargo, BlackRock, Newmont",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Amazon Rallies as Investors See More Resilience",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Moncler Beats Views but Signals Unstable Macroeconomic Environment",
        "date": "2025-04-16",
        "summary": "Moncler’s update comes days after luxury bellwether LVMH reported lackluster results for the start of the year, setting a negative tone for the reporting season."
    },
    {
        "company": "MSFT",
        "title": "Harvard Hit With $2 Billion Government Funding Freeze",
        "date": "2025-04-15",
        "summary": "A.M. Edition for April 15. The Trump administration "
    },
    {
        "company": "MSFT",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple’s Margins Are Still a Big Risk in Trade War Roller Coaster: Heard on the Street",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Leap, Treasury Yields Ease After Trump Pauses Tariffs",
        "date": "2025-04-10",
        "summary": "Stock markets jumped and Treasury yields dropped after President Trump’s announcement of a 90-day pause on higher-targeted tariffs for most countries, even as he doubled down on China."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.1% to 99.69",
        "date": "2025-04-01",
        "summary": "The WSJ Dollar Index was down 0.1% to 99.69 — lower for three of the past four trading days."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Tariff Announcement Drives Steepest Decline in U.S. Markets Since 2020",
        "date": "2025-04-03",
        "summary": "The stock market plunged as investors grappled with the threat that Trump’s new import tax plan will set off global retaliation and hurt economic growth. Plus, big tech companies lose hundreds of billions of dollars in value, while regulated utilities got a boost from the recession trade. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Tariff Announcement Drives Steepest Decline in U.S. Markets Since 2020",
        "date": "2025-04-03",
        "summary": "The stock market plunged as investors grappled with the threat that Trump’s new import tax plan will set off global retaliation and hurt economic growth. Plus, big tech companies lose hundreds of billions of dollars in value, while regulated utilities got a boost from the recession trade. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Meltdown Gives Way to Global Rout",
        "date": "2025-04-07",
        "summary": "The turmoil in financial markets spread worldwide, as Trump’s challenge to world trade intensified stock losses from Hong Kong to France. Japan’s Nikkei 225 logged its biggest drop since last August."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Banks' Warnings, CarMax Stalls, Delta Shares Fly",
        "date": "2025-04-12",
        "summary": "Why did banks report higher profit but also warn of a recession risk? And how did President Trump’s tariff announcements affect CarMax? Plus, what caused Delta’s shares to rise? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Stocks Mixed Ahead of Sweeping Trump Tariffs Announcement",
        "date": "2025-04-01",
        "summary": "President Trump is due to unveil sweeping tariffs tomorrow afternoon—but what exactly he will announce is unclear. Plus: executives at Meta Platforms press trade officials to fight an expected European Union fine and cease-and-desist order. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Banks' Warnings, CarMax Stalls, Delta Shares Fly",
        "date": "2025-04-12",
        "summary": "Why did banks report higher profit but also warn of a recession risk? And how did President Trump’s tariff announcements affect CarMax? Plus, what caused Delta’s shares to rise? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "MSFT",
        "title": "Netflix and Spotify Are Resilient, but Not Recession-Proof",
        "date": "2025-04-15",
        "summary": "Streaming giants are better positioned than rivals for a recession, but pricey stocks also depend on growth from new ventures."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: CarMax, TSMC, Trump Media, U.S. Steel",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chip Stocks Pressured as Tariff Rout Intensifies",
        "date": "2025-04-07",
        "summary": "Global semiconductor stocks opened sharply lower, extending losses from last week as investors digest the extent of U.S. tariffs on chip-making hubs such as Taiwan."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: A Challenging Scenario",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Retail Sales, Powell Speech, Rate Decisions: What to Watch This Week in Markets",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on the U.S. rig count, BP, Boss Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Parkland, oil prices and more in the latest Market Talks covering the Energy and Utilities sector."
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Musk Merges His AI Company With X, Claiming Combined Value of $113 Billion",
        "date": "2025-03-29",
        "summary": "Elon Musk’s artificial-intelligence startup xAI has acquired X, the social-media platform he also owns, in an all-stock deal that assigns the new enterprise a lofty valuation."
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: U.S. Retail Sales and ECB, BOC Decisions in Focus as Market Digests Tariff Turmoil",
        "date": "2025-04-11",
        "summary": "After a week of huge volatility—with hefty selling in U.S. Treasurys and the U.S. dollar due to President Trump’s sweeping trade tariffs and a subsequent 90-day reprieve for many of them—investors will be hoping for a quieter week ahead."
    },
    {
        "company": "MSFT",
        "title": "Tech Stocks Tumble After Nvidia Discloses Chip Export Restrictions",
        "date": "2025-04-16",
        "summary": "The stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries."
    },
    {
        "company": "MSFT",
        "title": "Bill Ackman’s Fund Lost 12.9% in Early April",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Spirits, Swiss Watches, Sneakers: Global Stock-Market Winners and Losers from Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Spirits, Swiss Watches, Sneakers: Global Stock-Market Winners and Losers from Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "European Stocks Slide",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "White House Says Trump Tariffs Tomorrow Will Take Effect ‘Immediately’",
        "date": "2025-04-01",
        "summary": "P.M. Edition for April 1. Trump met with advisers to iron out the final details of his reciprocal tariff plans, as Canada and the EU prepare their responses. Plus, "
    },
    {
        "company": "MSFT",
        "title": "Tariff Turbulence Could Stop Private Equity Selling Companies, Blackstone Says",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 2.91% This Quarter to 99.76",
        "date": "2025-03-31",
        "summary": "The dollar edged higher for the session, but fell 2.9% for the quarter."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on Tesla, BlackBerry and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Semiconductor Sector Under Pressure After China Counters in Trump’s Tariff War",
        "date": "2025-04-04",
        "summary": "Shares of Nvidia and other semiconductor companies slid amid a flurry of tariffs between the U.S. and Asian countries that could subdue electronics demand and hinder Big Tech’s artificial-intelligence infrastructure buildout."
    },
    {
        "company": "MSFT",
        "title": "The Companies and Markets Hit Hardest by Trump’s Tariffs",
        "date": "2025-04-13",
        "summary": "From stocks to oil to Treasurys, prices have risen and fallen sharply over the past 10 days."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Rises 0.3% to 99.86",
        "date": "2025-03-26",
        "summary": "The WSJ Dollar Index was up 0.3% to 99.86 — higher for five of the past six trading days."
    },
    {
        "company": "MSFT",
        "title": "Companies Are Going Bankrupt at the Fastest Rate Since 2010",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on gold futures, Rio Tinto, NatWest, Banco BPM and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Find insight on Shell, Ampol, Viva Energy and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, London Stock Exchange Group and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Hardest-Hit Stocks in Asia: Tech, Japanese Banks and a Nike Supplier",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on WELL Health Technologies, Novo Nordisk and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Luxury Empire LVMH Posts Revenue Below Views Amid Global Trade War Threat",
        "date": "2025-04-14",
        "summary": "French luxury behemoth LVMH said it booked revenue of €20.31 billion for the first three months of the year, 3% lower organically than in the prior-year period."
    },
    {
        "company": "MSFT",
        "title": "Why Markets Are Melting Down",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Rises 0.6% to 99.75",
        "date": "2025-04-07",
        "summary": "The WSJ Dollar Index was up 0.6% to 99.75 — higher for two consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Individual Investors Brave Tariff Turmoil, Just in Time for a 6% Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: J&J, Xiaomi, PVH, XPeng",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Alcoa to Face Steep Costs From Tariffs Despite Strong Results",
        "date": "2025-04-16",
        "summary": "The aluminum producer said it incurred about $20 million in first-quarter costs stemming from tariffs on imports. Alcoa’s CEO said it would be impractical in the short term to increase U.S. aluminum production."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insights on car prices, Goodyear Tire & Rubber, Volvo Car, and more in the latest Market Talks covering the Automotive and Transportation sectors."
    },
    {
        "company": "MSFT",
        "title": "Cintas Stock Jumps After Annual Earnings Target Lifted",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on oil futures, Sidara, S-Oil,  and more in the latest Market Talks on Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Bang & Olufsen to Increase Prices in Response to Tariffs",
        "date": "2025-04-09",
        "summary": "The Danish consumer-electronics company implemented modest price increases on selected products in January, but further price increases will be made by May 1 partly due to the recent tariffs."
    },
    {
        "company": "MSFT",
        "title": "Most Voters Oppose Trump’s Tariffs, But His Supporters Are Still Behind Him",
        "date": "2025-04-04",
        "summary": "P.M. Edition for April 4. "
    },
    {
        "company": "MSFT",
        "title": "7-Eleven Owner Targets Profit Growth Despite Tariff Uncertainty",
        "date": "2025-04-09",
        "summary": "Seven & i Holding projected a rise in annual profit despite the uncertainty caused by U.S. tariffs, continuing efforts to stave off a takeover attempt by the Canadian owner of Circle K"
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Touts ‘Wins’ After Two-Day Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Read about the U.S. rig count, Canada’s central bank, SSE,  and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 1.5% to 97.64",
        "date": "2025-04-10",
        "summary": "The WSJ Dollar Index was down 1.5% to 97.64 — down for three consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "S&P 500 Suffers Biggest Quarterly Loss Since 2022",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech Stocks Fall After U.S. Restrictions on Nvidia's China Exports",
        "date": "2025-04-16",
        "summary": "Plus: The U.K.’s Supreme Court rules that transgender women can’t be defined as women. Canada holds interest rates steady as it examines the impact of tariffs. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Wall Street Speaks Out Against Tariffs",
        "date": "2025-04-07",
        "summary": "Last week, U.S. stocks lost $6.6 trillion in value during a two-day washout after President Trump announced "
    },
    {
        "company": "MSFT",
        "title": "See How Government Spending Is Up Even as Musk Touts Savings",
        "date": "2025-04-11",
        "summary": "DOGE’s estimated $150 billion in savings has barely made a dent in $6.8 trillion of federal spending, a WSJ analysis finds."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "What Trade War? Chip Maker TSMC Is Still Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Canaries in the Trump Tariff Mine",
        "date": "2025-04-07",
        "summary": "Market signals are warning the White House of trouble ahead."
    },
    {
        "company": "MSFT",
        "title": "Treasury Yields Rise as U.S. Data Keep Flowing In",
        "date": "2025-03-26",
        "summary": "A positive surprise in U.S. data kept Treasury yields mostly afloat, ahead of activity and labor indicators."
    },
    {
        "company": "MSFT",
        "title": "Treasury Yields Rise as U.S. Data Keep Flowing In",
        "date": "2025-03-26",
        "summary": "A positive surprise in U.S. data kept Treasury yields mostly afloat, ahead of activity and labor indicators."
    },
    {
        "company": "MSFT",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "MSFT",
        "title": "U.S. Hopes to Use Tariff Talks to Isolate China",
        "date": "2025-04-16",
        "summary": "A.M. Edition for April 16. The Trump administration intends to use tariff negotiations with more than 70 countries to push them to "
    },
    {
        "company": "MSFT",
        "title": "Biggest Gains in Innovation in the Management Top 250",
        "date": "2025-03-26",
        "summary": "Bank of New York Mellon tops the list, followed by Duke Energy and Paychex"
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Uber, Hertz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "More Cautious Trading Knocks Brokerage Stocks—Heard on the Street",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariff Pause Sends Tech Stocks Soaring",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chip Stocks Dive Following Trump’s Threat of More Tariffs — Heard on the Street",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Stabilize; Carmakers Rise on Tariff Reprieve Hopes",
        "date": "2025-04-15",
        "summary": "Markets were relatively stable compared with last week’s extreme volatility, with gains across most major Asian bourses and a modestly higher open in Europe."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Free Fall",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Stock Markets Retreat Amid Trade War Escalation",
        "date": "2025-04-11",
        "summary": "European stocks reversed early gains and U.S. futures retreated into negative territory after China’s latest salvo on tariffs."
    },
    {
        "company": "MSFT",
        "title": "Fed Chair Warns of Difficult Choices as Trade War Rages",
        "date": "2025-04-16",
        "summary": "P.M. Edition for April 16. Federal Reserve Chair Jerome Powell warned today that the central bank could face "
    },
    {
        "company": "MSFT",
        "title": "U.K. Economy Shows Signs of Strength But Tariffs Darken Outlook",
        "date": "2025-04-11",
        "summary": "The economy grew more strongly than expected but Trump’s barrage of tariff hikes and pauses threaten to stymie further acceleration ahead."
    },
    {
        "company": "MSFT",
        "title": " TNB Tech Minute: TikTok Lives On…For Now",
        "date": "2025-04-04",
        "summary": "Plus, the Magnificent Seven continue their stock-market slide. And fintechs put their IPO roadshows on hold. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Today's Rally is Nearing Records",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Here's How Much the World's Biggest Wealth Fund Is Down This Year",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Read about airline spending, DHL, Daimler Truck, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "How Investing Will Change if the Dollar No Longer Rules the World",
        "date": "2025-04-06",
        "summary": "Should the U.S. currency and Wall Street stocks no longer rise together, Americans will need to broaden their portfolios."
    },
    {
        "company": "MSFT",
        "title": "Bitcoin Price Falls to About $78,000",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "MSFT",
        "title": "Walmart Confident About Tariff Resilience Despite Sales Volatility",
        "date": "2025-04-09",
        "summary": "Walmart reaffirmed its first-quarter sales guidance and widened its range for operating income growth to stay flexible on pricing as tariffs go into effect."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on American Express, home price growth and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Read about pharma stocks, CSL, and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Chip Shares Tumble After Nvidia Discloses Export Restrictions",
        "date": "2025-04-16",
        "summary": "Export restrictions placed on certain chips manufactured by Nvidia have weighed on other chipmakers, and shares of Broadcom, Qualcomm and others declined."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on fiber operations, oil futures, Repsol’s joint venture with NEO Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With Nothing But Hard Choices—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "United Airlines Leans on Wealthier Travelers Through Choppy Demand",
        "date": "2025-04-17",
        "summary": "The airline said it is leaning into its business catered toward wealthier consumers, including premium seating and travel to international destinations, as those spenders appear relatively unfazed by economic storm clouds."
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Edge Up Following Historic Rally",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Economic Outlook Dives Just Three Months Into Trump’s Term",
        "date": "2025-04-13",
        "summary": "The probability of a recession has leapt while the growth outlook has slumped, a survey of economists has found."
    },
    {
        "company": "MSFT",
        "title": "Jobs Report, Tariffs, Powell: What to Watch This Week",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Wall Street Faces Toughest Test in Years ",
        "date": "2025-04-03",
        "summary": "U.S. stocks fall sharply as investors wrestle with President Trump’s sweeping tariff plans."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "Aditya Bhave, a Bank of America senior U.S. economist, discusses with co-hosts Telis Demos and Miriam Gottfried what we can expect from the forthcoming jobs report and how it will offer a big clue to where the economy is heading. "
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on  Eli Lilly, Novo Nordisk, EssilorLuxottica, and more in the latest Market Talks covering the health care sector."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Futures Slide After Tough Day for Major Indexes",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.3% to 99.13",
        "date": "2025-04-09",
        "summary": "The WSJ Dollar Index was down 0.3% to 99.13 — down for two consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Gold Pushes Higher as Trade War Casualties Mount",
        "date": "2025-04-15",
        "summary": "Gold rose 0.4% to $3,218.70 a troy ounce, the second-highest close in the front-month contract’s history and making it 5 out of the past 6 sessions that gold has settled higher."
    },
    {
        "company": "MSFT",
        "title": "Fund Managers Braced for Global ‘Hard Landing’ After Tariff Shock",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "One Tech CEO Expects Tariffs to Hit Growth Prospects ",
        "date": "2025-04-03",
        "summary": "‘I can bet you that the impact of what’s happening on the macro side will be felt in the second half of the year,’ Egnyte Chief Executive Vineet Jain said."
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: Investors to Watch U.S. Inflation, Sentiment Data as Tariff Clouds Loom",
        "date": "2025-04-04",
        "summary": "Focus will center on the University of Michigan’s consumer sentiment survey, while inflation data could offer clues on prospects of interest-rate cuts to support the economy. Federal Reserve minutes will also be released."
    },
    {
        "company": "MSFT",
        "title": "Banks Warn of Risk to U.S. Economy Because of Tariffs",
        "date": "2025-04-11",
        "summary": "P.M. Edition for April 11. In earnings calls today, executives warned that President Trump’s tariffs were "
    },
    {
        "company": "MSFT",
        "title": "Santander Confirms Guidance After First-Quarter Growth",
        "date": "2025-04-04",
        "summary": "The bank said it should deliver a return on tangible equity of around 15.7% for the first three months and is on track to reach its 16.5% target for the year."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Read about American Express, Levi Strauss, Prudential PLC, and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "United Gives Two Profit Scenarios: ‘Impossible to Predict’",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "United Airlines Gives Two Profit Scenarios: ‘Impossible to Predict’",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Find insights on U.S. homebuyer’s monthly payments, UniCredit, Banco BPM, and more in the latest Market Talks covering the Financial Services sector."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Canada Mortgage and Housing Corp., Rio Tinto, Rocket Cos. and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Will Disrupt Corporate Profits and Supply Chains, McKinsey CFO Says",
        "date": "2025-04-04",
        "summary": "Having pre-emptively built up inventories, companies will take a wait-and-see approach to Trump’s tariffs, Global Finance Chief Yuval Atsmon says."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Find insight on the purchase of U.S. goods and services by Canadians, European banks, Generali, and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "How's Your 401(k) Doing? Retirement Plans Sink 7% in Two Days",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "European Bank Stocks Extend Losses From Tariff Fallout",
        "date": "2025-04-04",
        "summary": "Shares in European banks sank further on Friday, adding to losses triggered by Wednesday’s announcement of U.S. tariffs and their effects on global trade and economic activity, after China slapped retaliatory tariffs on U.S. goods."
    },
    {
        "company": "MSFT",
        "title": "Even AI-Infrastructure Spending Is at Risk",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.2% to 96.52 ",
        "date": "2025-04-14",
        "summary": "The WSJ Dollar Index was down 0.2% to 96.52 — the lowest closing value since Oct. 2, 2024."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "MSFT",
        "title": "Stocks Suffer Record Two-Day Wipeout",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Big Office Landlord Made $4 Million in Previously Undisclosed Payouts to Its CEO",
        "date": "2025-04-05",
        "summary": "Paramount Group recently revealed that it made payments to the chief executive’s jet company as well as for his personal accounting services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "The Impact of Trump’s Tariffs on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "P.M. Edition for April 7. "
    },
    {
        "company": "MSFT",
        "title": "H&M Earnings Miss Forecasts on Higher Discounts and Costs",
        "date": "2025-03-27",
        "summary": "Sales rose 2% but momentum slowed in the final month of the quarter."
    },
    {
        "company": "MSFT",
        "title": "When Does a Market Dive Hit the Rest of the Economy?",
        "date": "2025-04-09",
        "summary": "Falling stock prices can filter through to the wider economy, even to those who don’t own a penny in stocks."
    },
    {
        "company": "MSFT",
        "title": "CarMax’s Share Buybacks Turned Lemonade Into Lemons: Heard on the Street",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "MSFT",
        "title": "Jobs Report, Tariffs, Powell: What to Watch This Week",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "President Trump Announces 10% Across-the-Board Tariff on All Imports",
        "date": "2025-04-02",
        "summary": "P.M. Edition for April 2. President Trump said that the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations, in a series of moves he declared \"Liberation Day\" for U.S. trade policy. Plus, the U.S. tariffs send a message to companies that the era of globalization is over. Reporter "
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Read about sustainable aviation fuels, Cheniere Energy, European oil stocks, Dialog Group, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: ‘Liberation Day’ Looms",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Treasury Yields Decline as Investors Fear Economic Contraction",
        "date": "2025-04-04",
        "summary": "Recession fears gripped Wall Street, keeping demand for low-risk Treasurys high while depressing yields. The 10-year lost 0.262 percentage point this week, to 3.992%."
    },
    {
        "company": "MSFT",
        "title": "Markets Fall, Dollar Sinks as Investors Grapple with Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": "Plus, SunnyD sells to a Guatemalan company for about $1.5 billion. And New York City Mayor Eric Adams forms his own political party to run for re-election. Alex Ossola hosts. "
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.3% to 99.46",
        "date": "2025-04-08",
        "summary": "The WSJ Dollar Index was down 0.3% to 99.46 — lower for six of the past nine trading days."
    },
    {
        "company": "MSFT",
        "title": "Walmart Sees Opportunity to Grab Share as Tariff War Kicks Off; Stock Rallies",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-31",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on oil futures, Bank of America, Shell and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Stocks Waver Ahead of Trump’s ‘Liberation Day’ Announcement at 4 p.m. ET",
        "date": "2025-04-02",
        "summary": "Tesla’s global vehicle deliveries fell 13% in the first quarter. And a federal judge has dismissed the bribery case against New York City Mayor Eric Adams. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Sartorius, China’s healthcare industry and more in the latest Market Talks covering health care."
    },
    {
        "company": "MSFT",
        "title": "OpenAI’s Latest Funding Round Comes With a $20 Billion Catch",
        "date": "2025-03-28",
        "summary": "A stipulation of the funding round, led by SoftBank, is adding pressure to OpenAI’s efforts to convert to a for-profit company."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Comex Gold, Silver Settle Lower",
        "date": "2025-04-04",
        "summary": "Gold settled down 2.7% Friday, and silver fell 8.6%. For the week, both metals posted a loss."
    },
    {
        "company": "MSFT",
        "title": "Market Turmoil Deepens as Trump Stands By Tariffs",
        "date": "2025-04-07",
        "summary": "A.M. Edition for April 7. Declines in global markets are snowballing into "
    },
    {
        "company": "MSFT",
        "title": "JPMorgan Warns U.S. Economy Is Facing Considerable Turbulence",
        "date": "2025-04-11",
        "summary": "Plus: U.S. consumer sentiment tanks in April. And producer prices fell in March as food costs declined. Zoe Kuhlkin hosts. "
    },
    {
        "company": "MSFT",
        "title": "CoreWeave Stock Ends Flat on First Day of Trading After Scaled-Back IPO",
        "date": "2025-03-28",
        "summary": "The AI startup had priced it’s highly anticipated IPO at a lower-than-expected $40 a share."
    },
    {
        "company": "MSFT",
        "title": "Is the S&P 500 Cheap Yet? Not Necessarily",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What Lies Ahead for the U.S. Economy? Brexit Offers Clues",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "In Matter of Days, Outlook Shifts From Solid Growth to Recession Risk",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Mercedes-Benz First-Quarter Sales Fall Slightly on China Weakness",
        "date": "2025-04-01",
        "summary": "Sales fell slightly on year, mainly due to weakness in China, but the margin should land within the guided full-year range of 6%-8%, a Mercedes spokesperson confirmed."
    },
    {
        "company": "MSFT",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on CNMC Goldmine Holdings, iron ore prices and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "MSFT",
        "title": "EQT Consortium Makes Bid for Fortnox, Valuing it at $5.5 Billion",
        "date": "2025-03-31",
        "summary": "The buyout group offered to buy the cloud-based accounting software developer with First Kraft, which currently owns 18.9% of Fortnox."
    },
    {
        "company": "MSFT",
        "title": "China’s Factory Activity Expanded in March",
        "date": "2025-03-31",
        "summary": "Activity in China’s vast manufacturing sector expanded at the fastest pace in a year in March, sending another sign of green shoots in the world’s second-largest economy as policymakers brace for more U.S. tariffs this week."
    },
    {
        "company": "MSFT",
        "title": "How the Reversal of the ‘American Exceptionalism’ Trade Is Rippling Around the Globe",
        "date": "2025-03-29",
        "summary": "Outsize U.S. bets delivered foreign investors years of windfall profits, but have left them exposed to this year’s selloff."
    },
    {
        "company": "MSFT",
        "title": "China Industrial Profits Remain in Decline",
        "date": "2025-03-27",
        "summary": "Chinese industrial companies’ profit decline slowed in the first two months of the year  suggesting that Beijing’s stimulus is having some effect."
    },
    {
        "company": "MSFT",
        "title": "Trump Threatens an Additional 50% Tariff on China",
        "date": "2025-04-07",
        "summary": "Plus: Markets rose on rumors that Trump would delay tariffs by 90 days, only to fall again after the White House denied it. And semiconductor stocks were hit particularly hard. Alex Ossola hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Thursday Recap: Car Wreck",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Are Headed for Biggest Wipeout in Market Value Since March 2020",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Comex Gold Settles Higher, Silver Falls",
        "date": "2025-03-31",
        "summary": "Gold rose 1.2% to a new record high, while silver settled 0.5% lower, down for a second consecutive session."
    },
    {
        "company": "MSFT",
        "title": "Comex Gold Settles Higher, Silver Falls",
        "date": "2025-03-28",
        "summary": "Gold futures rose 0.8% to a record $3,086.50 a troy ounce, the fourth consecutive week that gold finished higher."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Wall Street Bonuses Surged in 2024",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "China Retaliates With 34% Tariffs, as a Lawsuit Challenges Trump's Trade Wars",
        "date": "2025-04-04",
        "summary": "Donald Trump's big tariffs have now drawn a big response from Beijing, which says it will add 34% duties to U.S. goods, roiling the stock market again on Friday. But a new lawsuit argues that the president's purported \"emergency\" tariffs aren't authorized by law, while a handful of Senate Republicans, including Rand Paul, vote to countermand the U.S. trade war against Canada."
    },
    {
        "company": "MSFT",
        "title": "Google’s Earnings Power Holds Up in Global Turbulence",
        "date": "2025-04-24",
        "summary": "Google-parent Alphabet reported solid earnings, but the tariff impact on the second quarter is still unclear."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla, Boeing and Alphabet Earnings: What to Watch for This Week",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Nokia Flags Earnings Hit From Tariffs",
        "date": "2025-04-24",
        "summary": "The company expects to take an earnings hit in the second quarter from tariffs and said that reaching the high end of its guidance range for the year now looked more challenging."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "‘Relief Rally’ Extends for Third Day",
        "date": "2025-04-24",
        "summary": "Plus: Google posted higher profit and revenue in the first quarter. And Chinese officials say Beijing hasn't engaged in trade talks with the Trump administration. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Traders Wager on a Rocky Earnings Season",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla’s Net Income Sinks 71% in First Quarter",
        "date": "2025-04-22",
        "summary": "Plus: stocks rally on optimism from White House on tariff negotiations. And Verizon says it won’t pay for the costs of tariffs on smartphones, but shoppers will. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Tesla, Boeing Earnings; Home Sales: What to Watch This Week",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tesla Profit Slumps",
        "date": "2025-04-22",
        "summary": "Plus: Meta could see a $7 billion pullback from Chinese advertisers over tariffs, research firm says. And Verizon says it won’t cover any handset price increases due to tariffs. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "SAP Shares Jump After Earnings Beat Forecasts Despite Tariff Uncertainty",
        "date": "2025-04-23",
        "summary": "Shares surged after the business-software group posted operating profit that beat analysts’ expectations and backed its full-year guidance, reassuring investors."
    },
    {
        "company": "MSFT",
        "title": "IBM Set to Benefit From Focus on AI, Automation as Clients Seek Efficiency in Uncertain Economy, CFO Says",
        "date": "2025-04-23",
        "summary": "For the second-quarter, IBM guided for sales between $16.4 billion and $16.75 billion, ahead of the $16.31 billion expected by analysts."
    },
    {
        "company": "MSFT",
        "title": "WPP CEO Sees Client Unease Amid Tariff Uncertainty, But No Spending Cuts",
        "date": "2025-04-25",
        "summary": "EXCLUSIVE: “The bigger question is what happens longer term, how this impacts the economy. I don’t think we’ll see that in the U.S. until May,” the head of the advertising company said in an interview."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Boeing Earnings; PMI Surveys; Home Sales: What to Watch Wednesday Onward This Week",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "3M Keeps Guidance but Adds Tariff Hazards",
        "date": "2025-04-22",
        "summary": "The company says Trump’s tariff campaign could knock down adjusted earnings per share by 20 cents to 40 cents this year."
    },
    {
        "company": "MSFT",
        "title": "SK Hynix Posts Strong First Quarter Earnings on AI Chip Demand",
        "date": "2025-04-23",
        "summary": "The South Korean memory chip maker posted stronger-than-expected earnings for the first quarter on brisk demand for artificial-intelligence chips amid uncertainty about sweeping U.S. tariffs."
    },
    {
        "company": "MSFT",
        "title": "Verizon Earnings Top Views; Reports Wider Post-Paid Phones Losses",
        "date": "2025-04-22",
        "summary": "Verizon Communications reported a rise in first-quarter earnings but postpaid phone losses increased. Verizon said it is still on course to meet its yearly goals."
    },
    {
        "company": "MSFT",
        "title": "Comcast Loses Broadband Customers, Takes Theme-Park Hit From L.A. Fires",
        "date": "2025-04-25",
        "summary": "​The company posted lower quarterly earnings, but found bright spots with its mobile-phone plans and Peacock streaming service."
    },
    {
        "company": "MSFT",
        "title": "Colgate-Palmolive Cuts Earnings Outlook on Tariffs",
        "date": "2025-04-25",
        "summary": "Colgate-Palmolive posted a higher profit in the first quarter but lowered 2025 earnings guidance due to tariffs."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Relief Rally, Day Three",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech Shares Drive Stocks Higher for a Third Straight Session",
        "date": "2025-04-24",
        "summary": "Nasdaq Composite is up more than 5% this week on trade-deal optimism."
    },
    {
        "company": "MSFT",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "SAP Posts Higher Revenue, Operating Profit",
        "date": "2025-04-22",
        "summary": "Sales from the business-software company’s core cloud business rose to 4.99 billion euros from 3.93 billion euros while total revenue rose to 9.01 billion euros compared with 8.04 billion euros in the prior-year period."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariff Uncertainty Clobbers Earnings Optimism",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "Stocks Rally on New Hopes of Tariffs Easing",
        "date": "2025-04-22",
        "summary": "The Dow industrials surged more than 1,000 points after Monday’s selloff."
    },
    {
        "company": "MSFT",
        "title": "Hasbro Beats Estimates as Profitability Improves",
        "date": "2025-04-24",
        "summary": "The toymaker said the global tariff war hadn’t impacted first-quarter results, adding that the company wouldn’t touch the guidance it gave in February given the level of uncertainty in the trade environment."
    },
    {
        "company": "MSFT",
        "title": "Merck Cuts 2025 Outlook on Tariffs, Charges",
        "date": "2025-04-24",
        "summary": "Merck’s first-quarter net income increased as sales of its Keytruda cancer drug rose, but the Big Pharma company cut its 2025 adjusted earnings projection, partly to account for recently imposed tariffs."
    },
    {
        "company": "MSFT",
        "title": "Adidas Posts Better-Than-Expected Results Despite Tariff Threat",
        "date": "2025-04-23",
        "summary": "Operating profit rose to €610 million from €336 million previously, the German sporting-goods company said."
    },
    {
        "company": "MSFT",
        "title": "ServiceNow Bumps Up Annual Guidance as Government Business Grows",
        "date": "2025-04-23",
        "summary": "Chief Executive Bill McDermott said the platform is operating in a best-case-scenario environment as companies look to optimize their supply chains amid recent tariff announcements and federal clients aim to boost efficiency amid government spending cuts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla Profit Sinks, Hurt by Backlash Over Elon Musk’s Political Role",
        "date": "2025-04-22",
        "summary": "The chief executive says he will spend significantly less time on DOGE starting in May. First-quarter net income falls 71%."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla Profit Sinks, Hurt by Backlash Over Elon Musk’s Political Role",
        "date": "2025-04-22",
        "summary": "The chief executive says he will spend significantly less time on DOGE starting in May. First-quarter net income falls 71%."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about airline credit cards, BNP Paribas, Oversea-Chinese Banking Corp. and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Fresnillo, gold futures and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "MSFT",
        "title": "Capital One Profit Rises Ahead of Discover Merger",
        "date": "2025-04-22",
        "summary": "Capital One recorded a higher first-quarter profit and is prepared to complete its acquisition of Discover on May 18."
    },
    {
        "company": "MSFT",
        "title": "Meta Could Be Facing $7 Billion in Lost Revenue From China",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Score: UnitedHealth, Netflix, Eli Lilly and More Stocks That Defined the Week",
        "date": "2025-04-18",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news"
    },
    {
        "company": "MSFT",
        "title": "Procter & Gamble Cuts Fiscal-Year Guidance",
        "date": "2025-04-24",
        "summary": "Procter & Gamble lowered its fiscal-year outlook after posting lower sales in the third quarter amid a challenging consumer environment."
    },
    {
        "company": "MSFT",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "MSFT",
        "title": "General Dynamics 1Q Profit Jumps on Rising Revenue",
        "date": "2025-04-23",
        "summary": "General Dynamics recorded higher earnings in the first quarter as its aerospace segment improved its profitability and revenue climbed."
    },
    {
        "company": "MSFT",
        "title": "Netflix, Unscathed by Tariffs, Posts Record Profit",
        "date": "2025-04-17",
        "summary": "The streamer forecasts stronger revenue growth in the second quarter."
    },
    {
        "company": "MSFT",
        "title": "Posco’s Profit Slumps as Trump Tariffs Take Effect",
        "date": "2025-04-24",
        "summary": "The South Korean steelmaker posted lower net profit for the first quarter, dented in part by tariffs on all steel and aluminum imports into the U.S."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "MSFT",
        "title": "Kimberly-Clark Cuts Profit Outlook as New Tariff Costs Mount",
        "date": "2025-04-22",
        "summary": "The CEO said the company doesn’t plan to cut investments or pass the costs on to consumers with across-the-board price increases."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Another Wild Swing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "STMicroelectronics Expects Lower Sales, but Signals Recovery Is Coming",
        "date": "2025-04-24",
        "summary": "The company projected lower sales as weak demand for some semiconductors used in cars and industrial equipment continued to plague an industry that now faces heightened uncertainty from unpredictable tariff policies."
    },
    {
        "company": "MSFT",
        "title": "STMicroelectronics Expects Lower Sales, but Signals Recovery Is Coming",
        "date": "2025-04-24",
        "summary": "The company projected lower sales as weak demand for some semiconductors used in cars and industrial equipment continued to plague an industry that now faces heightened uncertainty from unpredictable tariff policies."
    },
    {
        "company": "MSFT",
        "title": "Intel Sees Rising ‘Probability of a Recession’ From Tariffs",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Intel Cuts Outlook, Says Layoffs Are in Store",
        "date": "2025-04-24",
        "summary": "The American chip-making giant’s stock fell after it said an overhaul is under way and that macro conditions would prove challenging."
    },
    {
        "company": "MSFT",
        "title": "How Much Have Stocks Rebounded? Are We Still In a Bear Market?",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    },
    {
        "company": "MSFT",
        "title": "IMF Warns Tariffs Will Slow Global Economic Growth and Hit U.S. Economy",
        "date": "2025-04-22",
        "summary": "Plus, Gold surges to $3500 in intraday trading. And defense stocks fall after some of the biggest industry names report their earnings. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Intel Sees ‘Probability of a Recession’ From Tariffs",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Whirlpool Sales Slide as Tariff Fears Hit Results",
        "date": "2025-04-24",
        "summary": "Whirlpool sales dropped in the latest quarter, with business taking a hit as tariffs prompted Asia-based appliance manufacturers to ramp up shipments into the U.S. and put a chill on its business in Canada and Europe."
    },
    {
        "company": "MSFT",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Rises 0.7% to 96.56",
        "date": "2025-04-23",
        "summary": "The WSJ Dollar Index was up 0.7% to 96.56 — up for two consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about Merck, EssilorLuxottica, Wuxi Biologics and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Merck, Sanofi and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Nissan Expects Roughly $5 Billion Net Loss From Impairments, Restructuring Costs",
        "date": "2025-04-24",
        "summary": "Nissan Motor estimated billions of dollars in net loss for the fiscal year ended March due to impairments and restructuring expenses."
    },
    {
        "company": "MSFT",
        "title": "GE Vernova Swings to Profit as Backlog Rises",
        "date": "2025-04-23",
        "summary": "GE Vernova swung back to a profit in the first quarter as orders stacked up and its revenue climbed, sending shares higher in the premarket session."
    },
    {
        "company": "MSFT",
        "title": "AT&T Adds More Subscribers, Sees Tariffs Spurring Phone Upgrades",
        "date": "2025-04-23",
        "summary": "The telecom company said that tariffs triggered an acceleration in consumers upgrading their mobile phones."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "MSFT",
        "title": "How Many Trillions Do Americans Spend Complying With Federal Rules?",
        "date": "2025-04-24",
        "summary": "The regulatory tax rivals the income tax."
    },
    {
        "company": "MSFT",
        "title": "Philip Morris Stock at Record High as Zyn Powers Profits",
        "date": "2025-04-23",
        "summary": "Philip Morris International gave its earnings outlook a bump after sustained momentum for its popular Zyn pouch brand powered its profit and revenue higher in the first quarter."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.5% to 96.07",
        "date": "2025-04-24",
        "summary": "The WSJ Dollar Index was down 0.5% to 96.07 — snapping a two-trading-day winning streak."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "LG Electronics Posts Earnings Beat, Plans to Relocate Some Production to U.S.",
        "date": "2025-04-24",
        "summary": "The South Korean consumer-electronics giant reiterated plans to relocate some production to the U.S. in response to President Trump’s recent tariff action."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on American Express, Macquarie and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Pepsi and Mountain Dew Depend on Imports. PepsiCo Says Tariffs Will Hurt Earnings.",
        "date": "2025-04-24",
        "summary": "The maker of Doritos and Cheetos also cited a drop in consumer confidence caused by inflation and the global trade war."
    },
    {
        "company": "MSFT",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Morgan Stanley’s Profit Surged on Trading Revenue",
        "date": "2025-04-11",
        "summary": "The bank’s profit increased to $4.32 billion in the first three months of the year, or $2.60 per share, surpassing the $2.18 per share analysts expected."
    },
    {
        "company": "MSFT",
        "title": "Russia Launches Major Assault on Kyiv",
        "date": "2025-04-24",
        "summary": "A.M. Edition for April 24. Moscow has "
    },
    {
        "company": "MSFT",
        "title": "PepsiCo Says Tariff Costs Will Contribute to Earnings Decline this Year",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Tariffs Show Mixed Impact on Big Economies",
        "date": "2025-04-23",
        "summary": "Business activity in the U.S. and Europe weakened in April, in contrast to pickups in Japan and India, underlining the diverse ways in which higher U.S. tariffs are affecting economies around the world."
    },
    {
        "company": "MSFT",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "date": "2025-04-25",
        "summary": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback."
    },
    {
        "company": "MSFT",
        "title": "Citigroup Reports Jump in Profit, Revenue",
        "date": "2025-04-15",
        "summary": "Citigroup reported a jump in profit and revenue in the first quarter of 2025 that beat analysts’ expectations, thanks in part to market volatility that generated higher fees for its trading business."
    },
    {
        "company": "MSFT",
        "title": "RTX Sees $850 Million Hit From Tariffs",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Marketers Are ‘Scenario Planning’ in an Uncertain Economy, Ad Giant IPG Says",
        "date": "2025-04-24",
        "summary": "Interpublic Group reiterated its 2025 organic revenue guidance and tried to assure analysts that it’s capable of handling any potential downturn."
    },
    {
        "company": "MSFT",
        "title": "Boeing Leans on Backlog, Looks for Alternatives to China Trade",
        "date": "2025-04-23",
        "summary": "The airplane maker reported a narrower first-quarter loss as CEO Kelly Ortberg said the company’s higher backlog has provided some flexibility amid the trade war."
    },
    {
        "company": "MSFT",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Tesla Stock Jumps After Musk Says He Will Spend Less Time on DOGE",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Continue Rally for Second Day",
        "date": "2025-04-23",
        "summary": "Plus: The White House says there will be \"no unilateral reduction in tariffs against China.\" And OpenAI CEO Sam Altman says he is stepping down as chairman of the nuclear-energy startup Oklo. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "Nestle Sales Get Boost From Coffee, Chocolate Price Hikes",
        "date": "2025-04-24",
        "summary": "Nestle posted higher sales that beat analysts’ expectations, with broad-based growth across all markets and categories."
    },
    {
        "company": "MSFT",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "MSFT",
        "title": "GE Aerospace Profit Climbs on Gains in Commercial Services, Defense",
        "date": "2025-04-22",
        "summary": "The maker of jet engines reported higher earnings for the first quarter on revenue gains from its defense businesses and commercial engines and services unit."
    },
    {
        "company": "MSFT",
        "title": "Kimberly-Clark Lowers Profit Forecast, Citing ‘Geopolitical Landscape’",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Rent the Runway, Xiaomi , Telecom Italia, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Read about Canadian railway cargo, Kuehne + Nagel, Renault and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Trump Targets Democratic Fundraising",
        "date": "2025-04-25",
        "summary": "A.M. Edition for April 25. President Trump directs the Justice Department to "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Gain insight on Comerica, Meiji Yasuda Life Insurance and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Newmont Profit, Revenue Jump, Boosted by Gold Surge",
        "date": "2025-04-23",
        "summary": "The gold miner recorded a profit of $1.9 billion, or $1.68 a share, up from $179 million, or 15 cents a share, a year earlier."
    },
    {
        "company": "MSFT",
        "title": "BNP Paribas Gets Boost From Market Frenzy",
        "date": "2025-04-24",
        "summary": "The French lender confirmed its midterm targets after results were boosted by recent market volatility but higher costs weighed on profit."
    },
    {
        "company": "MSFT",
        "title": "Sanofi Sales, Profit Beat Expectations on Higher Demand for Skin, Asthma Drug",
        "date": "2025-04-24",
        "summary": "The pharmaceutical company said the profit was driven by a higher gross margin and slower operating expense growth."
    },
    {
        "company": "MSFT",
        "title": "3M Counts on Far-Flung Factories to Blunt Tariffs’ Hit",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on CarMax, Tesla and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Samsung Guides for Softer First-Quarter Profit But Still Beats Consensus",
        "date": "2025-04-08",
        "summary": "Samsung Electronics guided for softer first-quarter operating profit amid few signs of an immediate recovery in its flagship semiconductor business."
    },
    {
        "company": "MSFT",
        "title": "Dow Logs Loss, Launches Cost-Cutting Measures Due to Slowdown",
        "date": "2025-04-24",
        "summary": "Dow posted a hefty first-quarter loss and said it planned a drastic pullback in capital expenditure due to a slump in demand for plastic and other products."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Either Sadness or Euphoria",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on oil futures, Woodside Energy and more in the latest Market Talks covering the Energy & Utilities sector."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Defense Stocks Tumble After RTX Warns of Tariff Hit",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Wall Street’s Trading Revenue Powered by Tariff Uncertainty",
        "date": "2025-04-14",
        "summary": "Goldman Sachs is the latest big bank to report that increased trading fueled its quarterly profit."
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Just Eat Takeaway Posts Flat Growth for Key Metric, Backs Guidance",
        "date": "2025-04-23",
        "summary": "The food-delivery group said gross transaction value for the first quarter was €4.72 billion, compared with €4.70 billion for the same period a year earlier."
    },
    {
        "company": "MSFT",
        "title": "Dow Falls More Than 1,000 Points, Nasdaq Loses 4% in Another Volatile Day",
        "date": "2025-04-10",
        "summary": "Plus: President Trump says he is open to Japan’s Nippon Steel investing in U.S. Steel but not owning it. CarMax misses its quarterly earnings estimates. And Modelo owner Constellation Brands cuts its annual outlook. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Northrop Grumman Trims 2025 Outlook Following Slower Sales, Higher Bomber-Program Costs",
        "date": "2025-04-22",
        "summary": "The defense contractor’s  first-quarter earnings and sales missed analysts’ estimates."
    },
    {
        "company": "MSFT",
        "title": "Unilever Confident for 2025 Amid Turnaround Plan, Ice-Cream Spinoff",
        "date": "2025-04-24",
        "summary": "The consumer-brands giant was on track to meet its goals for the year after sales were boosted by its key brands, and despite a hit to turnover from net disposals and currency effects."
    },
    {
        "company": "MSFT",
        "title": "Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": "WSJ Heard on the Street columnist Dan Gallagher breaks down why Tesla stock is on the rise even after the electric car company posted a 71% drop in net income during its most recent quarter. "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Tesla, BYD, Volvo, and more in the latest Market Talks covering the auto and transport sector."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Hertz, MicroStrategy, Capital One, Comerica",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall and the Dollar Drops Amid Trump’s Threats to Fire Fed Chair",
        "date": "2025-04-21",
        "summary": "Investors are seeking refuge after President Trump’s renewed attacks on Federal Reserve chief Jerome Powell. Plus: DHL stock falls after it suspends high-value shipments to the U.S. And Capital One shares rise after regulators approve its $35 billion acquisition of Discover. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Welcome to Schrödinger’s Stock Market",
        "date": "2025-04-18",
        "summary": "United’s decision to give dueling earnings guidance is mind-bending for investors."
    },
    {
        "company": "MSFT",
        "title": "Tesla Has a Deep Hole to Pull Out Of",
        "date": "2025-04-23",
        "summary": "Elon Musk promises more attention on the EV maker, but brand damage from his political activities won’t be easy to repair."
    },
    {
        "company": "MSFT",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "MSFT",
        "title": "Now Streaming on Netflix: A Show Where Profits Trump the Trade War",
        "date": "2025-04-18",
        "summary": "The streaming giant sticks by its full-year forecast in a rare show of resilience in a tumultuous market."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Huge Stock Swings Are the New Normal for Frazzled Investors",
        "date": "2025-04-23",
        "summary": "April is poised to be the most-volatile calendar month since the Covid crash in 2020."
    },
    {
        "company": "MSFT",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Gains Accelerate",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Find insights into  bank earnings,  CIMB Group and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Watch: Why Tesla Shares Jumped Despite Rough Earnings Report",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on Capital Power, commodity prices  and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street: CoreWeave Delivers a Verdict on the AI Boom—and on Itself",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump Is Everywhere Except in the Economic Data",
        "date": "2025-04-21",
        "summary": "Fears that tariffs, spending cuts and deportations would lead to recession and inflation have yet to show up in the numbers."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: Purchasing Managers’ Surveys in Focus",
        "date": "2025-04-18",
        "summary": "Provisional U.S. purchasing managers’ surveys for April will be closely watched for signs of how businesses are reacting to tariff announcements. Equivalent surveys will also be released in the eurozone and the U.K."
    },
    {
        "company": "MSFT",
        "title": "Why Earnings Expectations Are Too High",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: Purchasing Managers’ Surveys in Focus",
        "date": "2025-04-18",
        "summary": "Provisional U.S. purchasing managers’ surveys for April will be closely watched for signs of how businesses are reacting to tariff announcements. Equivalent surveys will also be released in the eurozone and the U.K."
    },
    {
        "company": "MSFT",
        "title": "Why Earnings Expectations Are Too High",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Russia Attacks Kyiv, Killing Nine",
        "date": "2025-04-24",
        "summary": "Plus, Tesla’s sales in Europe fall for a third consecutive month. And President Trump rejects a tax hike on millionaires. Kate Bullivant hosts."
    },
    {
        "company": "MSFT",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "Plus: Goldman Sachs profit surges as tariff uncertainty powers trading revenue. And U.S. companies are going bankrupt at the fastest rate since 2010. Charlotte Gartenberg hosts."
    },
    {
        "company": "MSFT",
        "title": "MicroStrategy Expects to Post Loss After Bitcoin Price Slumps",
        "date": "2025-04-07",
        "summary": "The software company said it notched $5.91 billion in unrealized losses on its digital assets for the quarter ended March 31."
    },
    {
        "company": "MSFT",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Could Pause Ukraine Talks If Progress Isn’t Made Soon",
        "date": "2025-04-18",
        "summary": "A.M. Edition for April 18. Secretary of State Marco Rubio says Washington has presented Kyiv and Moscow with a framework deal to end their war, but that "
    },
    {
        "company": "MSFT",
        "title": "By the Numbers: How Bad Was This Week in the Stock Market?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "S&P and Nasdaq Notch Biggest Quarterly Losses Since 2022",
        "date": "2025-03-31",
        "summary": "A mixed session capped a turbulent quarter as investors turned from excitement over President Trump’s tax cuts and deregulation to fears over tariffs and a recession. Plus: Newsmax shares surge on first day of trading. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": " Dow and Dollar Drop as Trump Renews Attacks on the Fed",
        "date": "2025-04-21",
        "summary": "Plus: Russia welcomes U.S. proposal to deny Ukraine NATO membership as talks to end war continue. And, Chipotle plans to expand south, to Mexico and Latin America. Charlotte Gartenberg hosts. "
    },
    {
        "company": "MSFT",
        "title": "Bunzl Shares Hit 4-Year Lows on Guidance Cut, Share-Buyback Pause",
        "date": "2025-04-16",
        "summary": "Bunzl cut its guidance for the year and paused its share-buyback program given the uncertain macro environment and resulting margin pressure in its North American business."
    },
    {
        "company": "MSFT",
        "title": "Bank Trading Desks Are Minting Money From Trump’s Tariff Chaos",
        "date": "2025-04-15",
        "summary": "Goldman Sachs, JPMorgan and Morgan Stanley all saw huge jumps in trading revenue."
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Edge Lower While Investors Wait for Signs on Tariff Talks",
        "date": "2025-04-15",
        "summary": "The Dow Industrials and the S&P 500 slid fractionally; bank stocks gained on strong earnings reports."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Traders Expect Wild Swings After Tesla Reports Earnings",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Abbott Labs Bracing for Tariffs as Profits Rise",
        "date": "2025-04-16",
        "summary": "Abbott Labs boosted its earnings in the first quarter and hinted that its full-year guidance might have gotten a lift were it not for looming cost hikes from the recent tariff war."
    },
    {
        "company": "MSFT",
        "title": "Huawei Posts Profit Drop But Revenue Signals Solid Comeback",
        "date": "2025-03-31",
        "summary": "The Chinese technology giant’s net profit fell in 2024 as higher expenses weighed, but solid revenue growth signals that the company is making a comeback after years of heavy U.S. sanctions that have affected its businesses."
    },
    {
        "company": "MSFT",
        "title": "U.S. Bancorp Profit Climbs With Higher Fees, Lower Costs",
        "date": "2025-04-16",
        "summary": "The parent company of U.S. Bank posted a profit of $1.71 billion, or $1.03 a share,  above analysts expectations of 98 cents a share."
    },
    {
        "company": "MSFT",
        "title": "Bank of America, Citi Stocks Rally; Wall Street Profits From Tariff Chaos",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Bank Shots",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Don’t Blame Trump for All of the Stock Market’s Problems",
        "date": "2025-03-27",
        "summary": "Though the trade war has heightened uncertainty, slower earnings growth and a cooler labor market would likely have impacted the market regardless."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tesco Shares Fall on Profit Warning as Competition Heats Up",
        "date": "2025-04-10",
        "summary": "Shares fell after the U.K.’s largest supermarket said it expects profit to fall as competition intensifies, with rivals such as Asda ramping up efforts to gain market share."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "MSFT",
        "title": "Powell, Global Rate Moves, Retail Sales: What to Watch This Week in Markets",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on CarMax, General Motors, container shipping lines, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Johnson & Johnson Forecasts $400 Million in Tariff-Related Costs This Year",
        "date": "2025-04-15",
        "summary": "Stocks edged lower as President Trump released a new statement calling on China to make a trade deal.  Boeing stock fell after China cut off new orders. Plus: shares of grocery chain Albertson’s dropped after its financial outlook disappointed investors. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks End Tumultuous Week Highe",
        "date": "2025-04-11",
        "summary": "Stocks rose after the White House said it has 15 trade-deal offers on the table and China said set its reciprocal tariffs on U.S. imports at 125%. Plus: Big banks’ stocks rose after posting profits from equities trading revenue. And shares of gold mining companies jumped amid investors’ rush to haven assets. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "MSFT",
        "title": "BlackRock’s Assets Hit Record as Net Income Falls",
        "date": "2025-04-11",
        "summary": "BlackRock’s quarterly net income fell slightly from a year earlier, while the investment firm’s assets under management edged higher to a record $11.6 trillion."
    },
    {
        "company": "MSFT",
        "title": "TSMC Maintains Solid 2025 Outlook Despite Tariff Worries",
        "date": "2025-04-17",
        "summary": "The world’s largest contract chip maker remains confident that it can post solid sales growth this year."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall, Wiping Out More Than $3 Trillion in Market Value",
        "date": "2025-04-03",
        "summary": "P.M. Edition for April 3. U.S. markets experience their s"
    },
    {
        "company": "MSFT",
        "title": "United Airlines Tops Expectations Despite Travel Demand Worries",
        "date": "2025-04-15",
        "summary": "The airline offered two sets of profit guidance depending on whether the U.S. enters a recession or not as it reported quarterly results that beat Wall Street expectations."
    },
    {
        "company": "MSFT",
        "title": "Wells Fargo Profit Rises, Boosted by Lower Expenses",
        "date": "2025-04-11",
        "summary": "Wells Fargo booked a bigger profit in the first quarter, as lower expenses helped offset a decline in net interest income."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "MSFT",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "MSFT",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Bank of America, Citigroup and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "Publicis Confirms Outlook After Organic Growth Beats Expectations",
        "date": "2025-04-15",
        "summary": "The advertising and marketing-services group confirmed its outlook for the year after first-quarter organic growth beat expectations, saying new business wins can make up for potential cuts to client spending due to tariff uncertainty."
    },
    {
        "company": "MSFT",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "MSFT",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "MSFT",
        "title": "Volkswagen Earnings Miss Hopes on Higher Costs, Including Tariff Hit",
        "date": "2025-04-10",
        "summary": "First-quarter earnings missed expectations after taking a hit from one-off items including some early impact from U.S. import tariffs."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "MSFT",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Drop on Fears of Escalating U.S.-China Trade Tensions",
        "date": "2025-04-16",
        "summary": "European and Asian stock indexes were down, along with U.S. futures, as investor confidence soured on signs of worsening trade tensions between the world’s two largest economies."
    },
    {
        "company": "MSFT",
        "title": "Meta’s Ad Business Relies a Lot on China. Tariffs Could Hurt It, Warns Analyst.",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Sainsbury’s Profit Beat Market Views",
        "date": "2025-04-17",
        "summary": "Sainsbury’s beat profit expectations for the full fiscal year, as the company focuses on supporting sales volumes by lowering prices."
    },
    {
        "company": "MSFT",
        "title": "Ericsson Posts Rise in North American Spending Ahead of Tariffs",
        "date": "2025-04-15",
        "summary": "The network business reported a 6% rise in sales, with strong growth in North America as customers moved forward investments ahead of planned U.S. tariffs."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Berkshire’s Apple Sales Are Paying Off",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Post Worst Quarter Since 2022 on Threat of Trade War",
        "date": "2025-03-31",
        "summary": "Tariff uncertainty and a flagging tech trade dragged the S&P 500 and Nasdaq lower to start 2025."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Interactive Brokers, Travelers, UniCredit, and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Canada’s auto industry, Delta, Mercedes-Benz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Tariff Wipeout",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dow Drops More Than 500 Points",
        "date": "2025-04-17",
        "summary": "Trump renews attack on Federal Reserve Chair Jerome Powell. Plus, Netflix posts higher-than expected earnings. Eli Lilly stock surges after GLP-1 pill succeeds in a pivotal trial. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on TotalEnergies, BP, Viva Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Tariff Scramble",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Read about March U.S. retail sales, United Airlines, BMW,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Wall Street Bonuses Powered New York’s Economy in 2024. Some Worry They Peaked.",
        "date": "2025-03-26",
        "summary": "The average annual payout jumped 31% to $244,700."
    },
    {
        "company": "MSFT",
        "title": "Despite the Trade War, Chip Maker TSMC Remains Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": "Plus, Japan and Italy try to find common ground with the White House on trade. And Trump officials have requested that the IRS start the process of revoking Harvard’s tax-exempt status. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "LG Electronics Expects Lower Quarterly Operating Profit",
        "date": "2025-04-07",
        "summary": "The South Korean consumer-electronics giant forecast a 5.7% drop in first-quarter operating profit, though it sustained steady revenue growth."
    },
    {
        "company": "MSFT",
        "title": "UnitedHealth Shares Tumble After Earnings Fall Short Due to Medicare Issues",
        "date": "2025-04-17",
        "summary": "The healthcare company slashed its 2025 projections, citing higher-than-expected costs for people enrolled in its Medicare plans."
    },
    {
        "company": "MSFT",
        "title": "Wise Posts Higher Volume, Customer Growth",
        "date": "2025-04-15",
        "summary": "The money-transfer company’s cross-border volume increased 28%, boosted by active customer growth of 17%."
    },
    {
        "company": "MSFT",
        "title": "Stocks Tumble Again in Brutal Week on Wall Street",
        "date": "2025-04-04",
        "summary": "The U.S. stock market lost $6.6 trillion in market cap in two days as China retaliated against President Trump’s wide-ranging tariffs. Plus: Shares of companies that make goods in Vietnam rise after Trump said the country wants to negotiate, while chip stocks fell. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Rise on Tech Tariff Reprieve ",
        "date": "2025-04-14",
        "summary": "Stocks gained after Trump exempted semiconductor equipment, smartphones and other electronics from tariffs, even though officials later signaled they would be put in their own levy bracket."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "MSFT",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "MSFT",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ashmore, Goldman Sachs and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Mixed With Trade Talks in Focus",
        "date": "2025-04-17",
        "summary": "Traders weighed tentative hopes for U.S.-China talks, as Asian stock markets closed higher and U.S. stock futures rose following Wednesday’s tech-fueled slump on Wall Street."
    },
    {
        "company": "MSFT",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Mixed With Trade Talks in Focus",
        "date": "2025-04-17",
        "summary": "Traders weighed tentative hopes for U.S.-China talks, as Asian stock markets closed higher and U.S. stock futures rose following Wednesday’s tech-fueled slump on Wall Street."
    },
    {
        "company": "MSFT",
        "title": "Jefferies Results Suggest Wall Street Down but Hardly Out",
        "date": "2025-03-27",
        "summary": "A surprise revenue drop signals caution on dealmaking under Trump."
    },
    {
        "company": "MSFT",
        "title": "Nordea Backs Guidance After Earnings Beat",
        "date": "2025-04-16",
        "summary": "The lender posted net profit attributable to shareholders of €1.21 billion for the first quarter, down slightly from a year earlier."
    },
    {
        "company": "MSFT",
        "title": "Inflation, Consumer Fears Fuel Stock Selloff",
        "date": "2025-03-28",
        "summary": "The Dow fell more than 700 points, while gold hit a record and bonds climbed. The anticipation of tariff developments next week also weighed on stocks."
    },
    {
        "company": "MSFT",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "MSFT",
        "title": "Uniqlo Owner Boosts Earnings Forecast",
        "date": "2025-04-10",
        "summary": "Fast Retailing boosted its annual earnings forecast despite tariff uncertainties, expecting another year of record profit as revenue continued to grow across regions."
    },
    {
        "company": "MSFT",
        "title": "JPMorgan and Morgan Stanley Show Trading Boomed During Early Tariff Turmoil",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariff Upheaval Threatens Private Equity’s Exit Recovery Hopes",
        "date": "2025-04-14",
        "summary": "U.S. private-equity exits and their total value rose in the first quarter compared with a year ago, but recent market volatility puts that momentum at risk."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall Sharply as Consumer Sentiment Sours in March",
        "date": "2025-03-28",
        "summary": "P.M. Edition for Mar. 28. Stocks sold off after hotter-than-expected inflation data, President Trump's tariff announcements and "
    },
    {
        "company": "MSFT",
        "title": "Logitech Withdraws FY26 Outlook Amid Tariff Uncertainty",
        "date": "2025-04-10",
        "summary": "he company’s move comes a day after President Trump placed a 90-day pause on most of his across-the-board reciprocal tariffs."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Thursday Recap: Dollar Ills",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump’s Tariffs Wipe Out Over $6 Trillion on Wall Street in Epic Two-Day Rout",
        "date": "2025-04-04",
        "summary": "The selloff capped the worst week since 2020, as fears of a recession mount"
    },
    {
        "company": "MSFT",
        "title": "U.K. Wages Accelerated Despite Tariff, Tax Pressures Ahead",
        "date": "2025-04-15",
        "summary": "Wage growth in the U.K. picked up in the first few months of the new year, suggesting that continued high inflation will remain a concern for the Bank of England, despite the damping effect on growth likely to come from U.S. trade tariffs."
    },
    {
        "company": "MSFT",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall Sharply as Global Economic Outlook Remains Uncertain",
        "date": "2025-04-10",
        "summary": "P.M. Edition for April 10. Yesterday’s market rally gave way to "
    },
    {
        "company": "MSFT",
        "title": "BYD Guides for Strong Earnings in Move to Shore Up Market Confidence",
        "date": "2025-04-08",
        "summary": "China’s biggest automaker forecast strong first-quarter earnings in rare early guidance, a move aimed at restoring confidence among investors."
    },
    {
        "company": "MSFT",
        "title": "China Hits U.S. Goods With 125% Tariff",
        "date": "2025-04-11",
        "summary": "A.M. Edition for April 11. Beijing unveils another round of trade countermeasures against Washington, saying "
    },
    {
        "company": "MSFT",
        "title": "Global Equities Tumble on Sweeping U.S. Tariffs",
        "date": "2025-04-03",
        "summary": "European stocks tumbled at the open, following Asia and U.S. stock futures lower in the wake of worse-than-expected U.S. tariffs that raised concerns about a global economic slowdown."
    },
    {
        "company": "MSFT",
        "title": "Spotify, Netflix Prove Bright Spots Within Broader Market Selloff",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Mastercard, Santander, Allianz Trade and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall After President Trump Unveils New Tariffs on Auto Imports",
        "date": "2025-03-27",
        "summary": "Shares in all of the Big Three U.S. automakers dropped after the announcement, but Tesla stock ticked up. Plus: GameStop plunged after saying it would issue $1.3 billion of convertible bonds to buy bitcoin. And Dollar Tree shares jumped after announcing the sale of its Family Dollar business. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Settles on Tariff Plan Ahead of ‘Liberation Day’ Deadline",
        "date": "2025-04-01",
        "summary": "Plus, Meta CEO Mark Zuckerberg is pressing U.S. trade officials to help fight an expected European Union ruling that could undermine its ad business. And Softbank agrees to lead $40 billion funding for OpenAI. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Deliveroo Revenue Rises on Strong Growth, Backs Guidance",
        "date": "2025-04-17",
        "summary": "The food delivery company reported higher revenue for the first quarter, boosted by robust gross transaction value growth in key markets."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on U.S. auto sales in March, the Canadian economy, Germany’s labor market, and more in the latest Market Talks covering the auto and transport sector."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: Buy the Yips",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-29",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Tariff Scramble",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Investigating Pharmaceutical and Semiconductor Tariffs",
        "date": "2025-04-15",
        "summary": "Plus, South Korea says it’s preparing roughly $23 billion in government support for the chip sector amid tariff uncertainty. And Netflix aims for a $1trillion market capitalization. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Gold Is Green",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Tumble as Trade-War Jitters Return",
        "date": "2025-04-10",
        "summary": "The Dow industrials and S&P 500 give back some gains from Wednesday’s historic rally."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Read about  Tesla, U.S. machinery companies,  airlines,  and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Why the Trade War Isn’t Over for America’s Biggest Banks",
        "date": "2025-04-10",
        "summary": "As bank-earnings season begins Friday with JPMorgan, investors care more about the outlook than prior results."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Albertsons Sales Grow on Boost From Pharmacy Business",
        "date": "2025-04-15",
        "summary": "Albertsons  saw its top-line figure increase in the latest quarter as its pharmacy business powered identical sales growth."
    },
    {
        "company": "MSFT",
        "title": "Albertsons Sales Grow on Boost From Pharmacy Business",
        "date": "2025-04-15",
        "summary": "Albertsons  saw its top-line figure increase in the latest quarter as its pharmacy business powered identical sales growth."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Fed Chair in the Hot Seat",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Post Gains Ahead of Trump Tariff Announcement",
        "date": "2025-04-02",
        "summary": "Investors hope clarity on trade will help markets recover."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on WELL Health Technologies, Novo Nordisk, CSPC Pharmaceutical and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Dollar Tree Attracts More Shoppers As Recession Fears Loom",
        "date": "2025-03-26",
        "summary": "Dollar Tree said more customers across incomes shopped at its stores in the latest quarter, a sign that concerns about the economy are giving the discount retailer a boost."
    },
    {
        "company": "MSFT",
        "title": "Wall Street’s ‘Smart Money’ Braced for Tariff Chaos. It Was Still Caught Off Guard.",
        "date": "2025-04-13",
        "summary": "Even hedge funds weren’t prepared for the gyrations in stocks, Treasurys and currencies."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Read about Mullen Group’s acquisition of Cole Group, Stellantis, Volvo, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "WSJ’ s Take On the Week Podcast: What to Watch For This Earnings Season As Trump’s Tariffs Come Into Play",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heineken Tops Revenue View, Reaffirms Outlook Amid Tariff Concerns",
        "date": "2025-04-16",
        "summary": "The Dutch brewer backed its full-year guidance after quarterly performance beat market expectations, but warned that the consumer and geopolitical backdrop remains volatile."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Tesla, Nvidia, Newsmax",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Clouds Part Over Apple’s Stock—for Now",
        "date": "2025-04-14",
        "summary": "Weekend exemptions spared the iPhone titan, but Apple is now at the mercy of Trump."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on transportation jobs, Tesla, auto tariffs and more in the latest Market Talks covering auto and transport."
    },
    {
        "company": "MSFT",
        "title": "S&P, Nasdaq Post Worst Quarter Since 2022",
        "date": "2025-03-31",
        "summary": "P.M. Edition for Mar. 31. U.S. markets bounced back from "
    },
    {
        "company": "MSFT",
        "title": "Asian Shares Gain After Trump’s Tech Exemptions",
        "date": "2025-04-14",
        "summary": "Asian stock markets rose Monday after the U.S. exempted some electronics products from tariffs, though President Trump indicated that sector-specific levies may be still on the way."
    },
    {
        "company": "MSFT",
        "title": "ABB Posts Increase in Earnings, Plans Robotics Business Spinoff",
        "date": "2025-04-17",
        "summary": "First-quarter net profit rose above analysts’ expectations to $1.10 billion at ABB, which intends to spin off its robotics division through a share distribution."
    },
    {
        "company": "MSFT",
        "title": "Asian Stock Markets Fall on Tariff Concerns",
        "date": "2025-04-16",
        "summary": "Equity markets in Asia declined as concerns about tariffs again weighed on sentiment, with technology shares hit by uncertainty over how the Trump administration’s trade policies will affect supply chains."
    },
    {
        "company": "MSFT",
        "title": "Inflation Data, Tariff Worries Weigh on Stocks",
        "date": "2025-03-28",
        "summary": "Plus, automaker shares extend losses. And the Coreweave IPO disappoints in a stumble for the market for new public listings. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Inflation Data, Tariff Worries Weigh on Stocks",
        "date": "2025-03-28",
        "summary": "Plus, automaker shares extend losses. And the Coreweave IPO disappoints in a stumble for the market for new public listings. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Private Equity World Engulfed by Perfect Storm",
        "date": "2025-04-18",
        "summary": "Tariff-related market turmoil dashes investors’ hopes for payouts​ as dealmaking grinds to a near standstill."
    },
    {
        "company": "MSFT",
        "title": "How One of the Wildest Weeks in Market History Unfolded",
        "date": "2025-04-12",
        "summary": "A tense, volatile week on Wall Street ended with all three major U.S. indexes up 5% or more, yet still below where they were when President Trump launched his tariff blitz."
    },
    {
        "company": "MSFT",
        "title": "Omnicom Gives More Cautious 2025 Outlook As Tariffs Create Uncertainty about Ad Spending ",
        "date": "2025-04-15",
        "summary": "Advertising giant hasn’t seen any specific instances of marketer clients pulling back thus far, executives say."
    },
    {
        "company": "MSFT",
        "title": "Stocks End Lower After Tariffs Rattle Carmakers",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Ford, GM, Stellantis, and more in the latest Market Talks covering Auto and Transport."
    },
    {
        "company": "MSFT",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Musk’s Megadeal Between X and xAI Breaks Wall Street’s Rulebook ",
        "date": "2025-04-01",
        "summary": "The tech titan can follow his own rules when he is combining two companies he owns, but the merger is still raising dealmaker eyebrows."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 1% To 96.71 ",
        "date": "2025-04-11",
        "summary": "The WSJ Dollar Index was down 1% to 96.71 —lower for four consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Nike Stock Drop Erases $12 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dollar Recovers While Recession Fears Grip Wall Street",
        "date": "2025-04-04",
        "summary": "The dollar recovered as Wall Street struggled with recession fears triggered by Trump tariffs, while data show U.S. labor markets are still healthy."
    },
    {
        "company": "MSFT",
        "title": "ASML Warns on Tariff Uncertainty, Logs Weak Orders",
        "date": "2025-04-16",
        "summary": "Orders for the Dutch company’s semiconductor-making equipment came in below forecasts."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.1% to 99.73",
        "date": "2025-03-27",
        "summary": "The WSJ Dollar Index was down 0.1% to 99.73 — down for two of the past three trading days."
    },
    {
        "company": "MSFT",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on chemical exports to China, Canadian commodities producers, SKC and more in the latest Market Talks covering basic materials."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: A $2-Trillion Swing",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on HSBC, Standard Chartered and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "On WSJ’s Take On the Week, co-host Telis Demos and guest co-host Miriam Gottfried dive into the impending 25 percent tariffs that are set to be placed on global automotive imports to the U.S. Then, we explore what the bond market tells us and what a decrease in the U.S. Treasury yields means for investors. Plus, is the IPO market buzzing? Provider of specialized cloud-computing services, CoreWeave, is the latest company to debut for trading. With companies like StubHub, eToro, and Klarna also announcing public offerings, does this mean more deals are on the horizon?"
    },
    {
        "company": "MSFT",
        "title": "‘This Is a Great Time to Buy’: Tariff Pause Sparks Historic Rally",
        "date": "2025-04-09",
        "summary": "U.S. stocks staged a historic rally after President Trump announced a 90-day pause on some tariffs and signaled a willingness to negotiate on trade."
    },
    {
        "company": "MSFT",
        "title": "These Stocks are Leading Losses Today",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on Caterpillar, Shell, OMV and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: UnitedHealth, Marvell, CVS, Humana",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on Delta Air Lines, Tesla, Continental, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: Brake Lights",
        "date": "2025-03-27",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on gold, JPMorgan Chase, Wells Fargo and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Wall Street Sounds an Alarm: The Economy Is at Risk Thanks to Tariffs",
        "date": "2025-04-11",
        "summary": "JPMorgan Chase’s Jamie Dimon and BlackRock’s Larry Fink both said the turbulence wasn’t like prior financial crises."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: JPMorgan, Wells Fargo, BlackRock, Newmont",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Amazon Rallies as Investors See More Resilience",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Moncler Beats Views but Signals Unstable Macroeconomic Environment",
        "date": "2025-04-16",
        "summary": "Moncler’s update comes days after luxury bellwether LVMH reported lackluster results for the start of the year, setting a negative tone for the reporting season."
    },
    {
        "company": "MSFT",
        "title": "Harvard Hit With $2 Billion Government Funding Freeze",
        "date": "2025-04-15",
        "summary": "A.M. Edition for April 15. The Trump administration "
    },
    {
        "company": "MSFT",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple’s Margins Are Still a Big Risk in Trade War Roller Coaster: Heard on the Street",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Leap, Treasury Yields Ease After Trump Pauses Tariffs",
        "date": "2025-04-10",
        "summary": "Stock markets jumped and Treasury yields dropped after President Trump’s announcement of a 90-day pause on higher-targeted tariffs for most countries, even as he doubled down on China."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.1% to 99.69",
        "date": "2025-04-01",
        "summary": "The WSJ Dollar Index was down 0.1% to 99.69 — lower for three of the past four trading days."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Tariff Announcement Drives Steepest Decline in U.S. Markets Since 2020",
        "date": "2025-04-03",
        "summary": "The stock market plunged as investors grappled with the threat that Trump’s new import tax plan will set off global retaliation and hurt economic growth. Plus, big tech companies lose hundreds of billions of dollars in value, while regulated utilities got a boost from the recession trade. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Tariff Announcement Drives Steepest Decline in U.S. Markets Since 2020",
        "date": "2025-04-03",
        "summary": "The stock market plunged as investors grappled with the threat that Trump’s new import tax plan will set off global retaliation and hurt economic growth. Plus, big tech companies lose hundreds of billions of dollars in value, while regulated utilities got a boost from the recession trade. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Meltdown Gives Way to Global Rout",
        "date": "2025-04-07",
        "summary": "The turmoil in financial markets spread worldwide, as Trump’s challenge to world trade intensified stock losses from Hong Kong to France. Japan’s Nikkei 225 logged its biggest drop since last August."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Banks' Warnings, CarMax Stalls, Delta Shares Fly",
        "date": "2025-04-12",
        "summary": "Why did banks report higher profit but also warn of a recession risk? And how did President Trump’s tariff announcements affect CarMax? Plus, what caused Delta’s shares to rise? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Stocks Mixed Ahead of Sweeping Trump Tariffs Announcement",
        "date": "2025-04-01",
        "summary": "President Trump is due to unveil sweeping tariffs tomorrow afternoon—but what exactly he will announce is unclear. Plus: executives at Meta Platforms press trade officials to fight an expected European Union fine and cease-and-desist order. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Banks' Warnings, CarMax Stalls, Delta Shares Fly",
        "date": "2025-04-12",
        "summary": "Why did banks report higher profit but also warn of a recession risk? And how did President Trump’s tariff announcements affect CarMax? Plus, what caused Delta’s shares to rise? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "MSFT",
        "title": "Netflix and Spotify Are Resilient, but Not Recession-Proof",
        "date": "2025-04-15",
        "summary": "Streaming giants are better positioned than rivals for a recession, but pricey stocks also depend on growth from new ventures."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: CarMax, TSMC, Trump Media, U.S. Steel",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chip Stocks Pressured as Tariff Rout Intensifies",
        "date": "2025-04-07",
        "summary": "Global semiconductor stocks opened sharply lower, extending losses from last week as investors digest the extent of U.S. tariffs on chip-making hubs such as Taiwan."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: A Challenging Scenario",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Retail Sales, Powell Speech, Rate Decisions: What to Watch This Week in Markets",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on the U.S. rig count, BP, Boss Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Parkland, oil prices and more in the latest Market Talks covering the Energy and Utilities sector."
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Musk Merges His AI Company With X, Claiming Combined Value of $113 Billion",
        "date": "2025-03-29",
        "summary": "Elon Musk’s artificial-intelligence startup xAI has acquired X, the social-media platform he also owns, in an all-stock deal that assigns the new enterprise a lofty valuation."
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: U.S. Retail Sales and ECB, BOC Decisions in Focus as Market Digests Tariff Turmoil",
        "date": "2025-04-11",
        "summary": "After a week of huge volatility—with hefty selling in U.S. Treasurys and the U.S. dollar due to President Trump’s sweeping trade tariffs and a subsequent 90-day reprieve for many of them—investors will be hoping for a quieter week ahead."
    },
    {
        "company": "MSFT",
        "title": "Tech Stocks Tumble After Nvidia Discloses Chip Export Restrictions",
        "date": "2025-04-16",
        "summary": "The stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries."
    },
    {
        "company": "MSFT",
        "title": "Bill Ackman’s Fund Lost 12.9% in Early April",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Spirits, Swiss Watches, Sneakers: Global Stock-Market Winners and Losers from Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Spirits, Swiss Watches, Sneakers: Global Stock-Market Winners and Losers from Tariffs",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "European Stocks Slide",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "White House Says Trump Tariffs Tomorrow Will Take Effect ‘Immediately’",
        "date": "2025-04-01",
        "summary": "P.M. Edition for April 1. Trump met with advisers to iron out the final details of his reciprocal tariff plans, as Canada and the EU prepare their responses. Plus, "
    },
    {
        "company": "MSFT",
        "title": "Tariff Turbulence Could Stop Private Equity Selling Companies, Blackstone Says",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 2.91% This Quarter to 99.76",
        "date": "2025-03-31",
        "summary": "The dollar edged higher for the session, but fell 2.9% for the quarter."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on Tesla, BlackBerry and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Semiconductor Sector Under Pressure After China Counters in Trump’s Tariff War",
        "date": "2025-04-04",
        "summary": "Shares of Nvidia and other semiconductor companies slid amid a flurry of tariffs between the U.S. and Asian countries that could subdue electronics demand and hinder Big Tech’s artificial-intelligence infrastructure buildout."
    },
    {
        "company": "MSFT",
        "title": "The Companies and Markets Hit Hardest by Trump’s Tariffs",
        "date": "2025-04-13",
        "summary": "From stocks to oil to Treasurys, prices have risen and fallen sharply over the past 10 days."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Rises 0.3% to 99.86",
        "date": "2025-03-26",
        "summary": "The WSJ Dollar Index was up 0.3% to 99.86 — higher for five of the past six trading days."
    },
    {
        "company": "MSFT",
        "title": "Companies Are Going Bankrupt at the Fastest Rate Since 2010",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on gold futures, Rio Tinto, NatWest, Banco BPM and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Find insight on Shell, Ampol, Viva Energy and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, London Stock Exchange Group and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Hardest-Hit Stocks in Asia: Tech, Japanese Banks and a Nike Supplier",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on WELL Health Technologies, Novo Nordisk and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Luxury Empire LVMH Posts Revenue Below Views Amid Global Trade War Threat",
        "date": "2025-04-14",
        "summary": "French luxury behemoth LVMH said it booked revenue of €20.31 billion for the first three months of the year, 3% lower organically than in the prior-year period."
    },
    {
        "company": "MSFT",
        "title": "Why Markets Are Melting Down",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Rises 0.6% to 99.75",
        "date": "2025-04-07",
        "summary": "The WSJ Dollar Index was up 0.6% to 99.75 — higher for two consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Individual Investors Brave Tariff Turmoil, Just in Time for a 6% Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: J&J, Xiaomi, PVH, XPeng",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Alcoa to Face Steep Costs From Tariffs Despite Strong Results",
        "date": "2025-04-16",
        "summary": "The aluminum producer said it incurred about $20 million in first-quarter costs stemming from tariffs on imports. Alcoa’s CEO said it would be impractical in the short term to increase U.S. aluminum production."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insights on car prices, Goodyear Tire & Rubber, Volvo Car, and more in the latest Market Talks covering the Automotive and Transportation sectors."
    },
    {
        "company": "MSFT",
        "title": "Cintas Stock Jumps After Annual Earnings Target Lifted",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Tumble on Trump Tariff Plan",
        "date": "2025-04-03",
        "summary": "Plus, the EU vows to respond to additional 20% tariffs that come on top of metals and auto levies threatening the bloc’s economies. And Amazon and AppLovin join a list of bidders aiming to take over TikTok. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on oil futures, Sidara, S-Oil,  and more in the latest Market Talks on Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Bang & Olufsen to Increase Prices in Response to Tariffs",
        "date": "2025-04-09",
        "summary": "The Danish consumer-electronics company implemented modest price increases on selected products in January, but further price increases will be made by May 1 partly due to the recent tariffs."
    },
    {
        "company": "MSFT",
        "title": "Most Voters Oppose Trump’s Tariffs, But His Supporters Are Still Behind Him",
        "date": "2025-04-04",
        "summary": "P.M. Edition for April 4. "
    },
    {
        "company": "MSFT",
        "title": "7-Eleven Owner Targets Profit Growth Despite Tariff Uncertainty",
        "date": "2025-04-09",
        "summary": "Seven & i Holding projected a rise in annual profit despite the uncertainty caused by U.S. tariffs, continuing efforts to stave off a takeover attempt by the Canadian owner of Circle K"
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Touts ‘Wins’ After Two-Day Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Read about the U.S. rig count, Canada’s central bank, SSE,  and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 1.5% to 97.64",
        "date": "2025-04-10",
        "summary": "The WSJ Dollar Index was down 1.5% to 97.64 — down for three consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "S&P 500 Suffers Biggest Quarterly Loss Since 2022",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech Stocks Fall After U.S. Restrictions on Nvidia's China Exports",
        "date": "2025-04-16",
        "summary": "Plus: The U.K.’s Supreme Court rules that transgender women can’t be defined as women. Canada holds interest rates steady as it examines the impact of tariffs. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Wall Street Speaks Out Against Tariffs",
        "date": "2025-04-07",
        "summary": "Last week, U.S. stocks lost $6.6 trillion in value during a two-day washout after President Trump announced "
    },
    {
        "company": "MSFT",
        "title": "See How Government Spending Is Up Even as Musk Touts Savings",
        "date": "2025-04-11",
        "summary": "DOGE’s estimated $150 billion in savings has barely made a dent in $6.8 trillion of federal spending, a WSJ analysis finds."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "What Trade War? Chip Maker TSMC Is Still Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Canaries in the Trump Tariff Mine",
        "date": "2025-04-07",
        "summary": "Market signals are warning the White House of trouble ahead."
    },
    {
        "company": "MSFT",
        "title": "Treasury Yields Rise as U.S. Data Keep Flowing In",
        "date": "2025-03-26",
        "summary": "A positive surprise in U.S. data kept Treasury yields mostly afloat, ahead of activity and labor indicators."
    },
    {
        "company": "MSFT",
        "title": "Treasury Yields Rise as U.S. Data Keep Flowing In",
        "date": "2025-03-26",
        "summary": "A positive surprise in U.S. data kept Treasury yields mostly afloat, ahead of activity and labor indicators."
    },
    {
        "company": "MSFT",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "MSFT",
        "title": "U.S. Hopes to Use Tariff Talks to Isolate China",
        "date": "2025-04-16",
        "summary": "A.M. Edition for April 16. The Trump administration intends to use tariff negotiations with more than 70 countries to push them to "
    },
    {
        "company": "MSFT",
        "title": "Biggest Gains in Innovation in the Management Top 250",
        "date": "2025-03-26",
        "summary": "Bank of New York Mellon tops the list, followed by Duke Energy and Paychex"
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "Uber, Hertz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "More Cautious Trading Knocks Brokerage Stocks—Heard on the Street",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariff Pause Sends Tech Stocks Soaring",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chip Stocks Dive Following Trump’s Threat of More Tariffs — Heard on the Street",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Markets Stabilize; Carmakers Rise on Tariff Reprieve Hopes",
        "date": "2025-04-15",
        "summary": "Markets were relatively stable compared with last week’s extreme volatility, with gains across most major Asian bourses and a modestly higher open in Europe."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Free Fall",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Global Stock Markets Retreat Amid Trade War Escalation",
        "date": "2025-04-11",
        "summary": "European stocks reversed early gains and U.S. futures retreated into negative territory after China’s latest salvo on tariffs."
    },
    {
        "company": "MSFT",
        "title": "Fed Chair Warns of Difficult Choices as Trade War Rages",
        "date": "2025-04-16",
        "summary": "P.M. Edition for April 16. Federal Reserve Chair Jerome Powell warned today that the central bank could face "
    },
    {
        "company": "MSFT",
        "title": "U.K. Economy Shows Signs of Strength But Tariffs Darken Outlook",
        "date": "2025-04-11",
        "summary": "The economy grew more strongly than expected but Trump’s barrage of tariff hikes and pauses threaten to stymie further acceleration ahead."
    },
    {
        "company": "MSFT",
        "title": " TNB Tech Minute: TikTok Lives On…For Now",
        "date": "2025-04-04",
        "summary": "Plus, the Magnificent Seven continue their stock-market slide. And fintechs put their IPO roadshows on hold. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Today's Rally is Nearing Records",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Here's How Much the World's Biggest Wealth Fund Is Down This Year",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Read about airline spending, DHL, Daimler Truck, and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "How Investing Will Change if the Dollar No Longer Rules the World",
        "date": "2025-04-06",
        "summary": "Should the U.S. currency and Wall Street stocks no longer rise together, Americans will need to broaden their portfolios."
    },
    {
        "company": "MSFT",
        "title": "Bitcoin Price Falls to About $78,000",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "MSFT",
        "title": "Walmart Confident About Tariff Resilience Despite Sales Volatility",
        "date": "2025-04-09",
        "summary": "Walmart reaffirmed its first-quarter sales guidance and widened its range for operating income growth to stay flexible on pricing as tariffs go into effect."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on American Express, home price growth and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Read about pharma stocks, CSL, and more in the latest Market Talks covering the Health Care sector."
    },
    {
        "company": "MSFT",
        "title": "Chip Shares Tumble After Nvidia Discloses Export Restrictions",
        "date": "2025-04-16",
        "summary": "Export restrictions placed on certain chips manufactured by Nvidia have weighed on other chipmakers, and shares of Broadcom, Qualcomm and others declined."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on fiber operations, oil futures, Repsol’s joint venture with NEO Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With Nothing But Hard Choices—Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "United Airlines Leans on Wealthier Travelers Through Choppy Demand",
        "date": "2025-04-17",
        "summary": "The airline said it is leaning into its business catered toward wealthier consumers, including premium seating and travel to international destinations, as those spenders appear relatively unfazed by economic storm clouds."
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Edge Up Following Historic Rally",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Markets Have Performed Since Trump Took Office, in Charts",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Economic Outlook Dives Just Three Months Into Trump’s Term",
        "date": "2025-04-13",
        "summary": "The probability of a recession has leapt while the growth outlook has slumped, a survey of economists has found."
    },
    {
        "company": "MSFT",
        "title": "Jobs Report, Tariffs, Powell: What to Watch This Week",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Wall Street Faces Toughest Test in Years ",
        "date": "2025-04-03",
        "summary": "U.S. stocks fall sharply as investors wrestle with President Trump’s sweeping tariff plans."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "Aditya Bhave, a Bank of America senior U.S. economist, discusses with co-hosts Telis Demos and Miriam Gottfried what we can expect from the forthcoming jobs report and how it will offer a big clue to where the economy is heading. "
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on  Eli Lilly, Novo Nordisk, EssilorLuxottica, and more in the latest Market Talks covering the health care sector."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Futures Slide After Tough Day for Major Indexes",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.3% to 99.13",
        "date": "2025-04-09",
        "summary": "The WSJ Dollar Index was down 0.3% to 99.13 — down for two consecutive trading days."
    },
    {
        "company": "MSFT",
        "title": "Gold Pushes Higher as Trade War Casualties Mount",
        "date": "2025-04-15",
        "summary": "Gold rose 0.4% to $3,218.70 a troy ounce, the second-highest close in the front-month contract’s history and making it 5 out of the past 6 sessions that gold has settled higher."
    },
    {
        "company": "MSFT",
        "title": "Fund Managers Braced for Global ‘Hard Landing’ After Tariff Shock",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "One Tech CEO Expects Tariffs to Hit Growth Prospects ",
        "date": "2025-04-03",
        "summary": "‘I can bet you that the impact of what’s happening on the macro side will be felt in the second half of the year,’ Egnyte Chief Executive Vineet Jain said."
    },
    {
        "company": "MSFT",
        "title": "Week Ahead for FX, Bonds: Investors to Watch U.S. Inflation, Sentiment Data as Tariff Clouds Loom",
        "date": "2025-04-04",
        "summary": "Focus will center on the University of Michigan’s consumer sentiment survey, while inflation data could offer clues on prospects of interest-rate cuts to support the economy. Federal Reserve minutes will also be released."
    },
    {
        "company": "MSFT",
        "title": "Banks Warn of Risk to U.S. Economy Because of Tariffs",
        "date": "2025-04-11",
        "summary": "P.M. Edition for April 11. In earnings calls today, executives warned that President Trump’s tariffs were "
    },
    {
        "company": "MSFT",
        "title": "Santander Confirms Guidance After First-Quarter Growth",
        "date": "2025-04-04",
        "summary": "The bank said it should deliver a return on tangible equity of around 15.7% for the first three months and is on track to reach its 16.5% target for the year."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Read about American Express, Levi Strauss, Prudential PLC, and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "United Gives Two Profit Scenarios: ‘Impossible to Predict’",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "United Airlines Gives Two Profit Scenarios: ‘Impossible to Predict’",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Find insights on U.S. homebuyer’s monthly payments, UniCredit, Banco BPM, and more in the latest Market Talks covering the Financial Services sector."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-31",
        "summary": "Find insight on Canada Mortgage and Housing Corp., Rio Tinto, Rocket Cos. and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Will Disrupt Corporate Profits and Supply Chains, McKinsey CFO Says",
        "date": "2025-04-04",
        "summary": "Having pre-emptively built up inventories, companies will take a wait-and-see approach to Trump’s tariffs, Global Finance Chief Yuval Atsmon says."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Find insight on the purchase of U.S. goods and services by Canadians, European banks, Generali, and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "How's Your 401(k) Doing? Retirement Plans Sink 7% in Two Days",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "European Bank Stocks Extend Losses From Tariff Fallout",
        "date": "2025-04-04",
        "summary": "Shares in European banks sank further on Friday, adding to losses triggered by Wednesday’s announcement of U.S. tariffs and their effects on global trade and economic activity, after China slapped retaliatory tariffs on U.S. goods."
    },
    {
        "company": "MSFT",
        "title": "Even AI-Infrastructure Spending Is at Risk",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.2% to 96.52 ",
        "date": "2025-04-14",
        "summary": "The WSJ Dollar Index was down 0.2% to 96.52 — the lowest closing value since Oct. 2, 2024."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "MSFT",
        "title": "Stocks Suffer Record Two-Day Wipeout",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Big Office Landlord Made $4 Million in Previously Undisclosed Payouts to Its CEO",
        "date": "2025-04-05",
        "summary": "Paramount Group recently revealed that it made payments to the chief executive’s jet company as well as for his personal accounting services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "The Impact of Trump’s Tariffs on the Rest of His Agenda",
        "date": "2025-04-07",
        "summary": "P.M. Edition for April 7. "
    },
    {
        "company": "MSFT",
        "title": "H&M Earnings Miss Forecasts on Higher Discounts and Costs",
        "date": "2025-03-27",
        "summary": "Sales rose 2% but momentum slowed in the final month of the quarter."
    },
    {
        "company": "MSFT",
        "title": "When Does a Market Dive Hit the Rest of the Economy?",
        "date": "2025-04-09",
        "summary": "Falling stock prices can filter through to the wider economy, even to those who don’t own a penny in stocks."
    },
    {
        "company": "MSFT",
        "title": "CarMax’s Share Buybacks Turned Lemonade Into Lemons: Heard on the Street",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Tariffs Hit Automakers, Lululemon’s Warning, Family Dollar Sale",
        "date": "2025-03-29",
        "summary": "Why was Tesla not hit as hard by Trump’s new tariffs as GM, Toyota or BMW? And why did Lululemon’s results spook investors? Plus, how did investors react to Family Dollar leaving the Dollar Tree family? "
    },
    {
        "company": "MSFT",
        "title": "Jobs Report, Tariffs, Powell: What to Watch This Week",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "President Trump Announces 10% Across-the-Board Tariff on All Imports",
        "date": "2025-04-02",
        "summary": "P.M. Edition for April 2. President Trump said that the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations, in a series of moves he declared \"Liberation Day\" for U.S. trade policy. Plus, the U.S. tariffs send a message to companies that the era of globalization is over. Reporter "
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Read about sustainable aviation fuels, Cheniere Energy, European oil stocks, Dialog Group, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: ‘Liberation Day’ Looms",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Treasury Yields Decline as Investors Fear Economic Contraction",
        "date": "2025-04-04",
        "summary": "Recession fears gripped Wall Street, keeping demand for low-risk Treasurys high while depressing yields. The 10-year lost 0.262 percentage point this week, to 3.992%."
    },
    {
        "company": "MSFT",
        "title": "Markets Fall, Dollar Sinks as Investors Grapple with Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": "Plus, SunnyD sells to a Guatemalan company for about $1.5 billion. And New York City Mayor Eric Adams forms his own political party to run for re-election. Alex Ossola hosts. "
    },
    {
        "company": "MSFT",
        "title": "The WSJ Dollar Index Falls 0.3% to 99.46",
        "date": "2025-04-08",
        "summary": "The WSJ Dollar Index was down 0.3% to 99.46 — lower for six of the past nine trading days."
    },
    {
        "company": "MSFT",
        "title": "Walmart Sees Opportunity to Grab Share as Tariff War Kicks Off; Stock Rallies",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-31",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on oil futures, Bank of America, Shell and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Stocks Waver Ahead of Trump’s ‘Liberation Day’ Announcement at 4 p.m. ET",
        "date": "2025-04-02",
        "summary": "Tesla’s global vehicle deliveries fell 13% in the first quarter. And a federal judge has dismissed the bribery case against New York City Mayor Eric Adams. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Sartorius, China’s healthcare industry and more in the latest Market Talks covering health care."
    },
    {
        "company": "MSFT",
        "title": "OpenAI’s Latest Funding Round Comes With a $20 Billion Catch",
        "date": "2025-03-28",
        "summary": "A stipulation of the funding round, led by SoftBank, is adding pressure to OpenAI’s efforts to convert to a for-profit company."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Comex Gold, Silver Settle Lower",
        "date": "2025-04-04",
        "summary": "Gold settled down 2.7% Friday, and silver fell 8.6%. For the week, both metals posted a loss."
    },
    {
        "company": "MSFT",
        "title": "Market Turmoil Deepens as Trump Stands By Tariffs",
        "date": "2025-04-07",
        "summary": "A.M. Edition for April 7. Declines in global markets are snowballing into "
    },
    {
        "company": "MSFT",
        "title": "JPMorgan Warns U.S. Economy Is Facing Considerable Turbulence",
        "date": "2025-04-11",
        "summary": "Plus: U.S. consumer sentiment tanks in April. And producer prices fell in March as food costs declined. Zoe Kuhlkin hosts. "
    },
    {
        "company": "MSFT",
        "title": "CoreWeave Stock Ends Flat on First Day of Trading After Scaled-Back IPO",
        "date": "2025-03-28",
        "summary": "The AI startup had priced it’s highly anticipated IPO at a lower-than-expected $40 a share."
    },
    {
        "company": "MSFT",
        "title": "Is the S&P 500 Cheap Yet? Not Necessarily",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What Lies Ahead for the U.S. Economy? Brexit Offers Clues",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "In Matter of Days, Outlook Shifts From Solid Growth to Recession Risk",
        "date": "2025-04-06",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Mercedes-Benz First-Quarter Sales Fall Slightly on China Weakness",
        "date": "2025-04-01",
        "summary": "Sales fell slightly on year, mainly due to weakness in China, but the margin should land within the guided full-year range of 6%-8%, a Mercedes spokesperson confirmed."
    },
    {
        "company": "MSFT",
        "title": "Basic Materials Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on CNMC Goldmine Holdings, iron ore prices and more in the latest Market Talks covering Basic Materials."
    },
    {
        "company": "MSFT",
        "title": "EQT Consortium Makes Bid for Fortnox, Valuing it at $5.5 Billion",
        "date": "2025-03-31",
        "summary": "The buyout group offered to buy the cloud-based accounting software developer with First Kraft, which currently owns 18.9% of Fortnox."
    },
    {
        "company": "MSFT",
        "title": "China’s Factory Activity Expanded in March",
        "date": "2025-03-31",
        "summary": "Activity in China’s vast manufacturing sector expanded at the fastest pace in a year in March, sending another sign of green shoots in the world’s second-largest economy as policymakers brace for more U.S. tariffs this week."
    },
    {
        "company": "MSFT",
        "title": "How the Reversal of the ‘American Exceptionalism’ Trade Is Rippling Around the Globe",
        "date": "2025-03-29",
        "summary": "Outsize U.S. bets delivered foreign investors years of windfall profits, but have left them exposed to this year’s selloff."
    },
    {
        "company": "MSFT",
        "title": "China Industrial Profits Remain in Decline",
        "date": "2025-03-27",
        "summary": "Chinese industrial companies’ profit decline slowed in the first two months of the year  suggesting that Beijing’s stimulus is having some effect."
    },
    {
        "company": "MSFT",
        "title": "Trump Threatens an Additional 50% Tariff on China",
        "date": "2025-04-07",
        "summary": "Plus: Markets rose on rumors that Trump would delay tariffs by 90 days, only to fall again after the White House denied it. And semiconductor stocks were hit particularly hard. Alex Ossola hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Thursday Recap: Car Wreck",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Are Headed for Biggest Wipeout in Market Value Since March 2020",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple Stock and Other Tech Favorites Drop",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Comex Gold Settles Higher, Silver Falls",
        "date": "2025-03-31",
        "summary": "Gold rose 1.2% to a new record high, while silver settled 0.5% lower, down for a second consecutive session."
    },
    {
        "company": "MSFT",
        "title": "Comex Gold Settles Higher, Silver Falls",
        "date": "2025-03-28",
        "summary": "Gold futures rose 0.8% to a record $3,086.50 a troy ounce, the fourth consecutive week that gold finished higher."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Wall Street Bonuses Surged in 2024",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "China Retaliates With 34% Tariffs, as a Lawsuit Challenges Trump's Trade Wars",
        "date": "2025-04-04",
        "summary": "Donald Trump's big tariffs have now drawn a big response from Beijing, which says it will add 34% duties to U.S. goods, roiling the stock market again on Friday. But a new lawsuit argues that the president's purported \"emergency\" tariffs aren't authorized by law, while a handful of Senate Republicans, including Rand Paul, vote to countermand the U.S. trade war against Canada."
    }
]