[
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Treasury Secretary Takes Aim at IMF in Meeting with Investors",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "MSFT",
        "title": "A Side Hustle for Friends of Musk: Selling Access to Stakes in His Private Companies",
        "date": "2025-04-25",
        "summary": "Lucrative stock deals have allowed SpaceX to avoid public scrutiny even as it has grown into one of the largest companies in the U.S."
    },
    {
        "company": "MSFT",
        "title": "Boston at Risk of ‘Wealth Spiral’ as Harvard Fight Ripples Through Economy",
        "date": "2025-04-20",
        "summary": "Far beyond Harvard Yard, the university is a major economic engine for the region."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "70,000 Bets a Minute: How FanDuel’s Parent Is Winning at Sports Gambling",
        "date": "2025-04-25",
        "summary": "Peter Jackson, the CEO of "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-22",
        "summary": "Find insight on BE Semiconductor Industries,  Verizon and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Moody’s, MSCI to Offer Private-Credit Risk Assessments",
        "date": "2025-04-21",
        "summary": "The collaborators aim to provide default probability assessments for investors based on factors such as borrower leverage and profitability."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "date": "2025-04-25",
        "summary": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback."
    },
    {
        "company": "MSFT",
        "title": "ServiceNow Bumps Up Annual Guidance as Government Business Grows",
        "date": "2025-04-23",
        "summary": "Chief Executive Bill McDermott said the platform is operating in a best-case-scenario environment as companies look to optimize their supply chains amid recent tariff announcements and federal clients aim to boost efficiency amid government spending cuts."
    },
    {
        "company": "MSFT",
        "title": "The Morgan Stanley Star Now Leading Trump’s Invest-in-America Push ",
        "date": "2025-04-24",
        "summary": "Michael Grimes will helm a new initiative brokering investments for the “America First” agenda."
    },
    {
        "company": "MSFT",
        "title": "Apple, Meta Fined by EU, Ordered to Comply With Tech Competition Rules",
        "date": "2025-04-23",
        "summary": "The move risks ratcheting up tensions with the Trump administration as EU officials pursue trade talks."
    },
    {
        "company": "MSFT",
        "title": "Senators Demand Federal Reserve Turn Over Records on Failed Fintech Synapse",
        "date": "2025-04-22",
        "summary": "Millions in customer funds still can’t be accounted for since the failure of the Silicon Valley startup."
    },
    {
        "company": "MSFT",
        "title": "Is This Trump’s Mitterrand Moment?",
        "date": "2025-04-23",
        "summary": "The French President saved his government by giving up socialism. It’s a precedent for tariffs."
    },
    {
        "company": "MSFT",
        "title": "Is This Trump’s Mitterrand Moment?",
        "date": "2025-04-23",
        "summary": "The French President saved his government by giving up socialism. It’s a precedent for tariffs."
    },
    {
        "company": "MSFT",
        "title": "Federal Reserve, FDIC Pull Statements on Crypto",
        "date": "2025-04-24",
        "summary": "The regulators have withdrawn several statements regarding banks’ crypto-related activities in an effort to support innovation and clarify current policies."
    },
    {
        "company": "MSFT",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "MSFT",
        "title": "Tech Shares Drive Stocks Higher for a Third Straight Session",
        "date": "2025-04-24",
        "summary": "Nasdaq Composite is up more than 5% this week on trade-deal optimism."
    },
    {
        "company": "MSFT",
        "title": "Next Deal for Top Tech Banker: Drive More Investments to the U.S.",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Baker Tilly, Moss Adams to Merge in $7 Billion Deal. Here’s How It Will Work.",
        "date": "2025-04-21",
        "summary": "Accounting firms Baker Tilly and Moss Adams agreed to merge in a deal valued at roughly $7 billion, which would make it the largest firm in the industry to be partly owned by private-equity investors."
    },
    {
        "company": "MSFT",
        "title": "Up the Down Trump Tariff Escalator",
        "date": "2025-04-22",
        "summary": "Markets rally on Bessent’s optimism about a U.S.-China trade truce."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "MSFT",
        "title": "Asian Stocks Buoyed by Hopes of Easing U.S.-China Tensions",
        "date": "2025-04-23",
        "summary": "Hopes for easing trade tensions between the U.S. and China, and President Trump saying he isn’t planning to fire Fed Chair Jerome Powell, lifted stocks in the region."
    },
    {
        "company": "MSFT",
        "title": "IMF Projects ‘Significant Slowdown’ for U.S. Economy From Tariffs",
        "date": "2025-04-22",
        "summary": "In its quarterly outlook on the world economy, the International Monetary Fund projected slower economic growth for the world, including the U.S., in the wake of President Trump’s tariffs."
    },
    {
        "company": "MSFT",
        "title": "Bessent Tells Investors: ‘America First Does Not Mean America Alone’",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "MSFT",
        "title": "Quantum Communications Breakthrough Could Improve Online Security",
        "date": "2025-04-24",
        "summary": "Scientists have made a huge leap in a highly technical practice known as coherent "
    },
    {
        "company": "MSFT",
        "title": "Does Meta Have a Social Media Monopoly?",
        "date": "2025-04-17",
        "summary": "Mark Zuckerberg is in court defending Meta against a "
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Lobbies Trump to Avoid Meta Antitrust Trial",
        "date": "2025-04-02",
        "summary": "Meta’s chief executive was at the White House on Wednesday, his third visit during Trump’s presidency,  according to people familiar with the matter."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk Is Stepping Back From DOGE. Can He Really Stay Away?",
        "date": "2025-04-25",
        "summary": "Elon Musk says he’s going to spend less time in Washington and more time running Tesla. WSJ columnist and Musk-watcher Tim Higgins unpacks what that plan might look like in reality. Also, the WSJ’s Isabelle Bousquette takes us inside "
    },
    {
        "company": "MSFT",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dollar Renews Slide on Worries Over Fed Independence",
        "date": "2025-04-21",
        "summary": "The WSJ Dollar Index was down 0.7% to 95.42 — down for eight of the past 10 trading days."
    },
    {
        "company": "MSFT",
        "title": "Huge Stock Swings Are the New Normal for Frazzled Investors",
        "date": "2025-04-23",
        "summary": "April is poised to be the most-volatile calendar month since the Covid crash in 2020."
    },
    {
        "company": "MSFT",
        "title": "IBM Set to Benefit From Focus on AI, Automation as Clients Seek Efficiency in Uncertain Economy, CFO Says",
        "date": "2025-04-23",
        "summary": "For the second-quarter, IBM guided for sales between $16.4 billion and $16.75 billion, ahead of the $16.31 billion expected by analysts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Another Wild Swing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Either Sadness or Euphoria",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "MSFT",
        "title": "Stocks Rally on New Hopes of Tariffs Easing",
        "date": "2025-04-22",
        "summary": "The Dow industrials surged more than 1,000 points after Monday’s selloff."
    },
    {
        "company": "MSFT",
        "title": "IMF Warns Tariffs Will Slow Global Economic Growth and Hit U.S. Economy",
        "date": "2025-04-22",
        "summary": "Plus, Gold surges to $3500 in intraday trading. And defense stocks fall after some of the biggest industry names report their earnings. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TPG, Temasek Back Cliffwater, an Interval Fund Specialist",
        "date": "2025-04-21",
        "summary": "Cliffwater began offering interval funds for wealthy individuals some seven years ago, tapping into a burgeoning market."
    },
    {
        "company": "MSFT",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "The Score: UnitedHealth, Netflix, Eli Lilly and More Stocks That Defined the Week",
        "date": "2025-04-18",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news"
    },
    {
        "company": "MSFT",
        "title": "Government Jobs Insulated DC From Economic Volatility. Not Any More.",
        "date": "2025-04-19",
        "summary": "The president ‘s federal government shake-up is taking a toll on the U.S. capital’s economy. "
    },
    {
        "company": "MSFT",
        "title": "The Fire Jerome Powell Market Rout",
        "date": "2025-04-21",
        "summary": "Investors render a verdict on tariffs and politicizing the Fed."
    },
    {
        "company": "MSFT",
        "title": "USA Track & Field Dominates the Olympics. It’s Also Been Bleeding Cash.",
        "date": "2025-04-18",
        "summary": "In recent years, the sport’s governing body has lost money and laid off staff. Now, three years from the Los Angeles Games, it’s canceling meets and under outside review."
    },
    {
        "company": "MSFT",
        "title": "Dollar Hits Fresh Lows on Worries Over Fed Independence",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tesla Profit Slumps",
        "date": "2025-04-22",
        "summary": "Plus: Meta could see a $7 billion pullback from Chinese advertisers over tariffs, research firm says. And Verizon says it won’t cover any handset price increases due to tariffs. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "From Ken Griffin to Robinhood: The Donors Who Funded Trump’s Inauguration Revealed",
        "date": "2025-04-18",
        "summary": "President Trump’s inaugural committee raised almost $250 million from Corporate America, more than doubling the previous record."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Francis, Pope of Firsts, Dies at 88",
        "date": "2025-04-21",
        "summary": "A.M. Edition for April 21. The Vatican announces the "
    },
    {
        "company": "MSFT",
        "title": "Inside Mark Zuckerberg’s Failed Negotiations to End Antitrust Case",
        "date": "2025-04-15",
        "summary": "The FTC wanted $30 billion to drop its case. Zuckerberg offered much less and hoped Trump would back him up."
    },
    {
        "company": "MSFT",
        "title": "U.S.-Stock Funds Have a Quarter to Forget",
        "date": "2025-04-05",
        "summary": "Foreign stocks and bond funds are winning the race so far in 2025.. Plus: A Financial Flashback to 25 years ago, the AT&T Wireless IPO."
    },
    {
        "company": "MSFT",
        "title": "Three Key Moments From Bessent’s Speech to Financial Leaders",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Jump After Trump Says He Doesn't Plan to Fire Powell",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "MSFT",
        "title": "EU Delayed Punishing Apple, Meta Just Before Trade Talks Started",
        "date": "2025-04-18",
        "summary": "The bloc postponed penalties, temporarily avoiding a conflict with the Trump administration during a week in which it ramped up its push for a trade deal with the U.S."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Lilly Surges, UnitedHealth Plummets, Netflix Aims for $1 Trillion",
        "date": "2025-04-19",
        "summary": "Why did news from a weight-loss drug pill trial boost Eli Lilly? And how are costs in the Medicare business affecting UnitedHealth? Plus, what ambitious goals has Netflix set for itself? Host Francesca Fontana discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Meta Fights to Keep Instagram and WhatsApp, as Antitrust Trial Begins",
        "date": "2025-04-14",
        "summary": "The Federal Trade Commission says Meta has monopolized the social-media market—and should be broken up."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "MicroStrategy Expects to Post Loss After Bitcoin Price Slumps",
        "date": "2025-04-07",
        "summary": "The software company said it notched $5.91 billion in unrealized losses on its digital assets for the quarter ended March 31."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Netflix, LVMH, USA Rare Earth, Albertsons",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "AMD Closes $4.9 Billion ZT Systems Deal, Targeting Its Piece of the ‘AI Factory’",
        "date": "2025-03-31",
        "summary": "Chip giant CEO Lisa Su says AI is still in its “very early stage” as the company revs up competition with Nvidia."
    },
    {
        "company": "MSFT",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "MSFT",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Bitcoin and Bonds: Have MicroStrategy and GameStop Found a Cheat Code for Markets?",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "MSFT",
        "title": "Morgan Stanley’s Profit Surged on Trading Revenue",
        "date": "2025-04-11",
        "summary": "The bank’s profit increased to $4.32 billion in the first three months of the year, or $2.60 per share, surpassing the $2.18 per share analysts expected."
    },
    {
        "company": "MSFT",
        "title": "TSMC Maintains Solid 2025 Outlook Despite Tariff Worries",
        "date": "2025-04-17",
        "summary": "The world’s largest contract chip maker remains confident that it can post solid sales growth this year."
    },
    {
        "company": "MSFT",
        "title": "Bank Trading Desks Are Minting Money From Trump’s Tariff Chaos",
        "date": "2025-04-15",
        "summary": "Goldman Sachs, JPMorgan and Morgan Stanley all saw huge jumps in trading revenue."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Musk’s Megadeal Between X and xAI Breaks Wall Street’s Rulebook ",
        "date": "2025-04-01",
        "summary": "The tech titan can follow his own rules when he is combining two companies he owns, but the merger is still raising dealmaker eyebrows."
    },
    {
        "company": "MSFT",
        "title": "Wall Street’s Best Hope to End Trump’s Global Trade War Is One of Its Own",
        "date": "2025-04-12",
        "summary": "Treasury Secretary Scott Bessent, a former hedge-fund manager, is trying to execute one of highest-stakes gambles in modern political and economic history."
    },
    {
        "company": "MSFT",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Despite the Trade War, Chip Maker TSMC Remains Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": "Plus, Japan and Italy try to find common ground with the White House on trade. And Trump officials have requested that the IRS start the process of revoking Harvard’s tax-exempt status. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "OpenAI’s Latest Funding Round Comes With a $20 Billion Catch",
        "date": "2025-03-28",
        "summary": "A stipulation of the funding round, led by SoftBank, is adding pressure to OpenAI’s efforts to convert to a for-profit company."
    },
    {
        "company": "MSFT",
        "title": "Fed’s Collins: Markets Are Functioning Well Despite Volatility",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Tencent, HSBC, Alibaba, TSMC",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Bessent Tries to Unite MAGA Economics, Traditional Conservative Policies",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mr. Fix-It Takes Center Stage During a Really Bad Week",
        "date": "2025-04-05",
        "summary": "Antonio Gracias made a rare public appearance alongside his friend as he helps with DOGE."
    },
    {
        "company": "MSFT",
        "title": "Fidelity Tests a Stablecoin as It Builds Out Crypto Offering",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariffs Will Disrupt Corporate Profits and Supply Chains, McKinsey CFO Says",
        "date": "2025-04-04",
        "summary": "Having pre-emptively built up inventories, companies will take a wait-and-see approach to Trump’s tariffs, Global Finance Chief Yuval Atsmon says."
    },
    {
        "company": "MSFT",
        "title": "Sam Bankman-Fried’s New Home: A Run-Down Prison That Once Housed Al Capone",
        "date": "2025-04-12",
        "summary": "The former crypto billionaire is now doing time at Los Angeles’s Terminal Island."
    },
    {
        "company": "MSFT",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Officials to Slash Most Employees at Consumer-Finance Watchdog",
        "date": "2025-04-17",
        "summary": "The Consumer Financial Protection Bureau emerged as an early target of the administration."
    },
    {
        "company": "MSFT",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Is Chinese AI All It’s Cracked Up to Be?",
        "date": "2025-04-16",
        "summary": "Beijing is pushing a tech challenge to the U.S., but Washington can counter it with smart policies."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "Aditya Bhave, a Bank of America senior U.S. economist, discusses with co-hosts Telis Demos and Miriam Gottfried what we can expect from the forthcoming jobs report and how it will offer a big clue to where the economy is heading. "
    },
    {
        "company": "MSFT",
        "title": "Global Growth to Slow Amid Trade War, But Recession Unlikely, IMF Head Says",
        "date": "2025-04-17",
        "summary": "Kristalina Georgieva said a breakdown of trust sparked a ‘reboot of the global trading system’ but the global economy will avoid a recession."
    },
    {
        "company": "MSFT",
        "title": "Inside Elon Musk’s Shock-and-Awe Months in the White House",
        "date": "2025-04-05",
        "summary": "President Trump directed his chief of staff to better manage the billionaire adviser after complaints arose from his cabinet and staff."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, London Stock Exchange Group and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Why AI Might Not Take All Our Jobs ",
        "date": "2025-04-14",
        "summary": "MIT economics professor Sendhil Mullainathan says it is in humans’ power to put artificial intelligence on a path to help us rather than replace us."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and the American Majority",
        "date": "2025-04-01",
        "summary": "Most people understand that the government spends too much."
    },
    {
        "company": "MSFT",
        "title": "The Secrets and Misdirection Behind Sam Altman’s Firing From OpenAI",
        "date": "2025-03-28",
        "summary": "The inside story of how the CEO of the hottest tech company was ousted and, just as quickly, resurrected."
    },
    {
        "company": "MSFT",
        "title": "How BlackRock’s Larry Fink Won Over Donald Trump",
        "date": "2025-04-05",
        "summary": "CEOs the world over are trying to get in good with President Trump. This Wall Street titan found a way."
    },
    {
        "company": "MSFT",
        "title": "How Signal Became Washington’s Favorite Messaging App",
        "date": "2025-03-28",
        "summary": "Downloads of the app surged in the past week after the Atlantic published White House officials’ texts about a military strike."
    },
    {
        "company": "MSFT",
        "title": "Apple-Linked Tech Stocks Are Hard-Hit in Asia",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Rise",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Market Rout Shatters Long-Held Beliefs on Investing",
        "date": "2025-04-11",
        "summary": "Tariffs are testing the habit of staying invested no matter how rocky markets get."
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "MSFT",
        "title": "The False Tariff Headline That Sent Stocks on a $2 Trillion Ride",
        "date": "2025-04-07",
        "summary": "Misinformation on a White House official’s remarks triggers a short-lived rally."
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Tries to Enlist Trump in Fight Against Meta EU Ruling",
        "date": "2025-04-01",
        "summary": "Meta executives have pressed U.S. trade officials to push back against a European Union law that could undermine its ad business."
    },
    {
        "company": "MSFT",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "MSFT",
        "title": "CME Group, S&P Group Agree to Sell OSTTRA to KKR in $3.1 Billion Deal",
        "date": "2025-04-14",
        "summary": "CME Group and S&P Global have agreed to sell OSTTRA to investment funds managed by investment firm KKR for an enterprise value of $3.1 billion."
    },
    {
        "company": "MSFT",
        "title": "Auto & Transport Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Find insight on Canada’s auto industry, Delta, Mercedes-Benz and more in the latest Market Talks covering the Auto and Transport sector."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on gold, JPMorgan Chase, Wells Fargo and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "S&P 500 Futures Fall 2.2% During Tariff Announcement",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Fed Chair Warns of Difficult Choices as Trade War Rages",
        "date": "2025-04-16",
        "summary": "P.M. Edition for April 16. Federal Reserve Chair Jerome Powell warned today that the central bank could face "
    },
    {
        "company": "MSFT",
        "title": "A Peter Thiel Protégé Is Leading Trump’s AI Strategy Against China",
        "date": "2025-03-31",
        "summary": "Michael Kratsios will work to counter Beijing without disrupting U.S. businesses."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mission to Take Over NASA—and Mars",
        "date": "2025-03-30",
        "summary": "The billionaire is in position to speed up plans for a voyage to the planet, with a potentially huge impact on SpaceX."
    },
    {
        "company": "MSFT",
        "title": "Judge Orders Trump Officials to Resume Work at Consumer-Finance Watchdog",
        "date": "2025-03-28",
        "summary": "The administration, which had moved to gut the Consumer Financial Protection Bureau,  likely will appeal the judge’s order."
    },
    {
        "company": "MSFT",
        "title": "TSMC Is Trading So Strangely It Almost Got Back to Normal: Heard on the Street",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Sam Bankman-Fried Moved to Oklahoma Prison Transit Facility",
        "date": "2025-03-27",
        "summary": "The disgraced cryptocurrency tycoon, who was sentenced to 25 years, was taken from a Brooklyn jail."
    },
    {
        "company": "MSFT",
        "title": "Wall Street’s Trading Revenue Powered by Tariff Uncertainty",
        "date": "2025-04-14",
        "summary": "Goldman Sachs is the latest big bank to report that increased trading fueled its quarterly profit."
    },
    {
        "company": "MSFT",
        "title": "Shipping Tycoons Discuss Separating Panama Ports From Hutchison Deal",
        "date": "2025-04-16",
        "summary": "Mediterranean Shipping Co. explores parallel tracks for contested Panama Canal ports and the rest of the deal with BlackRock."
    },
    {
        "company": "MSFT",
        "title": "Exclusive: Fintech Banking Startup Mercury Raises $300 Million at a $3.5 Billion Valuation",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How a Bet on Bank Capital Rules Figures in the U.S. Treasury Rout",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Macy’s Hires Dual Finance-Operations Chief From Capri",
        "date": "2025-04-01",
        "summary": "Macy’s hired Thomas Edwards to be its next CFO and COO, roles he has held at Versace owner Capri Holdings for eight years."
    },
    {
        "company": "MSFT",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "Plus: Goldman Sachs profit surges as tariff uncertainty powers trading revenue. And U.S. companies are going bankrupt at the fastest rate since 2010. Charlotte Gartenberg hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Tariff Upheaval Threatens Private Equity’s Exit Recovery Hopes",
        "date": "2025-04-14",
        "summary": "U.S. private-equity exits and their total value rose in the first quarter compared with a year ago, but recent market volatility puts that momentum at risk."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Fed Chair in the Hot Seat",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Chip Industry Has Too Many Eggs in the AI Basket",
        "date": "2025-04-17",
        "summary": "TSMC struck an upbeat note after posting strong earnings, but tariffs and the trade war loom large."
    },
    {
        "company": "MSFT",
        "title": "Trump Settles on Tariff Plan Ahead of ‘Liberation Day’ Deadline",
        "date": "2025-04-01",
        "summary": "Plus, Meta CEO Mark Zuckerberg is pressing U.S. trade officials to help fight an expected European Union ruling that could undermine its ad business. And Softbank agrees to lead $40 billion funding for OpenAI. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: New Auto Tariffs Sting Some Carmakers, But Not All",
        "date": "2025-03-27",
        "summary": "Plus, a freight startup comes up short on profitability. And, Sam-Bankman Fried makes a move. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street: CoreWeave Delivers a Verdict on the AI Boom—and on Itself",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street: CoreWeave Delivers a Verdict on the AI Boom—and on Itself",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "MSFT",
        "title": "Mark Klein, a Whistleblower Who Revealed Domestic Spying, Dies at 79",
        "date": "2025-04-11",
        "summary": "The AT&T technician predated Edward Snowden by seven years, but his allegations were never able to achieve traction."
    },
    {
        "company": "MSFT",
        "title": "Companies Will Hit Pause Button Because of Tariffs, Wells Fargo CFO Says",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dow, S&P 500 Futures Fall; Nasdaq Futures Lead Losses",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "On WSJ’s Take On the Week, co-host Telis Demos and guest co-host Miriam Gottfried dive into the impending 25 percent tariffs that are set to be placed on global automotive imports to the U.S. Then, we explore what the bond market tells us and what a decrease in the U.S. Treasury yields means for investors. Plus, is the IPO market buzzing? Provider of specialized cloud-computing services, CoreWeave, is the latest company to debut for trading. With companies like StubHub, eToro, and Klarna also announcing public offerings, does this mean more deals are on the horizon?"
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "EQT Consortium Makes Bid for Fortnox, Valuing it at $5.5 Billion",
        "date": "2025-03-31",
        "summary": "The buyout group offered to buy the cloud-based accounting software developer with First Kraft, which currently owns 18.9% of Fortnox."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Zuckerberg Continues to Lobby Trump",
        "date": "2025-04-02",
        "summary": "Plus, two big tech companies bid for TikTok. And Nintendo stays in the game with its coming Switch 2 release. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Bank Shots",
        "date": "2025-04-15",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on gold futures, Rio Tinto, NatWest, Banco BPM and more in the latest Market Talks covering financial services."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-15",
        "summary": "Find insight on Rent the Runway, Xiaomi , Telecom Italia, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "MSFT",
        "title": "Chinese Investors Pile Into Big Tech Even as Tariffs Jolt Markets",
        "date": "2025-04-17",
        "summary": "Technology stocks in Hong Kong have fallen in April as markets were roiled by U.S. tariffs, but that hasn’t stopped mainland Chinese investors from pouring billions into the sector."
    },
    {
        "company": "MSFT",
        "title": "Is Lina Khan Back at the FTC?",
        "date": "2025-04-14",
        "summary": "Trump’s Chairman Andrew Ferguson sounds like Biden’s, warning businesses not to raise prices."
    },
    {
        "company": "MSFT",
        "title": "U.S. Tariffs Pose ‘Significant Risk’ to Global Economy, IMF Chief Says",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Why Musk vs. Navarro Matters",
        "date": "2025-04-08",
        "summary": "The fight reflects the competing factions in Trump’s coalition."
    },
    {
        "company": "MSFT",
        "title": "Companies Are Going Bankrupt at the Fastest Rate Since 2010",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Harvard Ended Up Leading the University Fight Against Trump",
        "date": "2025-04-16",
        "summary": "Some in Washington say America’s wealthiest school is about to learn the price of crossing the president."
    },
    {
        "company": "MSFT",
        "title": "Asian Tech Stocks, Apple Suppliers Rise After U.S. Tariff Reprieve",
        "date": "2025-04-14",
        "summary": "Asian tech hardware stocks broadly rose after the Trump administration exempted tariffs on semiconductor equipment, smartphones and other electronics, despite administration officials saying that these tech products would face their own levies."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on fiber operations, oil futures, Repsol’s joint venture with NEO Energy, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Global Stocks Are Suddenly Pension Darlings",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "MSFT",
        "title": "The Task Force Taking On American Universities",
        "date": "2025-04-15",
        "summary": "P.M. Edition for April 15. The Task Force to Combat Anti-Semitism is a cross-government group with "
    },
    {
        "company": "MSFT",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "MSFT",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Meltdown Gives Way to Global Rout",
        "date": "2025-04-07",
        "summary": "The turmoil in financial markets spread worldwide, as Trump’s challenge to world trade intensified stock losses from Hong Kong to France. Japan’s Nikkei 225 logged its biggest drop since last August."
    },
    {
        "company": "MSFT",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Visa Offers Apple Roughly $100 Million to Take Over Credit Card From Mastercard",
        "date": "2025-04-01",
        "summary": "Visa, Amex and Mastercard are all competing to be the network for the tech giant’s credit card."
    },
    {
        "company": "MSFT",
        "title": "Fund Managers Braced for Global ‘Hard Landing’ After Tariff Shock",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Mastercard, Santander, Allianz Trade and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "Trump and Musk Share the Founder’s Mindset ",
        "date": "2025-03-26",
        "summary": "Most modern presidents take a managerial approach to the job, which is no way to bring radical change."
    },
    {
        "company": "MSFT",
        "title": "What Trade War? Chip Maker TSMC Is Still Bullish on AI Demand",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple and Musk Clash Over Satellite Expansion Plans",
        "date": "2025-03-31",
        "summary": "The iPhone maker and SpaceX are competing in the race to eliminate cellphone dead spots, a rift that is set to intensify."
    },
    {
        "company": "MSFT",
        "title": "Four Takeaways From a Senate Hearing on the D.C. Plane Crash",
        "date": "2025-03-28",
        "summary": "The acting FAA chief and others faced questions from senators following the midair collision in January that took 67 lives."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-04",
        "summary": "Find insight on Live Nation Entertainment, Apple, President Trump’s tariffs and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Global Markets Drop on Fears of Escalating U.S.-China Trade Tensions",
        "date": "2025-04-16",
        "summary": "European and Asian stock indexes were down, along with U.S. futures, as investor confidence soured on signs of worsening trade tensions between the world’s two largest economies."
    },
    {
        "company": "MSFT",
        "title": "Investors Report Glitches at Fidelity, Robinhood and Other Brokers",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Investors Report Glitches at Fidelity, Robinhood and Other Brokers",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Block to Pay $40 Million in Settlement Over Anti-Money-Laundering Programs",
        "date": "2025-04-10",
        "summary": "The agency said its investigation additionally found its lax practices allowed for largely anonymous and high-risk bitcoin transactions to proceed without proper scrutiny."
    },
    {
        "company": "MSFT",
        "title": "Dollar Recovers While Recession Fears Grip Wall Street",
        "date": "2025-04-04",
        "summary": "The dollar recovered as Wall Street struggled with recession fears triggered by Trump tariffs, while data show U.S. labor markets are still healthy."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "JPMorgan and Morgan Stanley Show Trading Boomed During Early Tariff Turmoil",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "A Billionaire and an Oscar Winner Have Made a Hit Movie. It’s About Investing.",
        "date": "2025-03-29",
        "summary": "The new documentary from Errol Morris makes index funds and passive investing thrilling"
    },
    {
        "company": "MSFT",
        "title": "STMicroelectronics to Shed Nearly 3,000 Jobs Amid Sluggish Chip Sales",
        "date": "2025-04-10",
        "summary": "The Tesla supplier said it would cut nearly 3,000 jobs through 2027 as the European chip maker seeks to revamp its fortunes after months of lackluster sales."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Stock Futures Keep Falling",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Accounting Firms Baker Tilly and Moss Adams Near Merger ",
        "date": "2025-04-09",
        "summary": "Moss Adams would become partly owned by private equity through the deal, which would create a combined firm with more than $3 billion in annual revenue."
    },
    {
        "company": "MSFT",
        "title": "Wall Street Faces Toughest Test in Years ",
        "date": "2025-04-03",
        "summary": "U.S. stocks fall sharply as investors wrestle with President Trump’s sweeping tariff plans."
    },
    {
        "company": "MSFT",
        "title": "How to Play the Biotech Meltdown in the Age of RFK Jr. and Tariffs",
        "date": "2025-04-11",
        "summary": "Political pressure and persistently high interest rates have some wondering if the industry’s model is broken."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Wall Street’s ‘Smart Money’ Braced for Tariff Chaos. It Was Still Caught Off Guard.",
        "date": "2025-04-13",
        "summary": "Even hedge funds weren’t prepared for the gyrations in stocks, Treasurys and currencies."
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "‘McAtlas’: McNuggets the World Over",
        "date": "2025-04-04",
        "summary": "Part of the global appeal of McDonald’s is its cultural flexibility. Meatless burgers are offered in India, while Czech diners can order a beer to go with a Big Mac."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "S&P and Nasdaq Notch Biggest Quarterly Losses Since 2022",
        "date": "2025-03-31",
        "summary": "A mixed session capped a turbulent quarter as investors turned from excitement over President Trump’s tax cuts and deregulation to fears over tariffs and a recession. Plus: Newsmax shares surge on first day of trading. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": "Elon Musk Brings His Vision for Mars to NASA",
        "date": "2025-04-09",
        "summary": "The SpaceX founder has backed a friend to lead the space agency and make a Mars mission a priority. Wall Street Journal reporters Emily Glazer and Micah Maidenberg talk about Musk’s "
    },
    {
        "company": "MSFT",
        "title": "Musk Merges His AI Company With X, Claiming Combined Value of $113 Billion",
        "date": "2025-03-29",
        "summary": "Elon Musk’s artificial-intelligence startup xAI has acquired X, the social-media platform he also owns, in an all-stock deal that assigns the new enterprise a lofty valuation."
    },
    {
        "company": "MSFT",
        "title": "Consulting Giants Offer Billions in Cuts to Federal Contracts. It Might Not Be Enough.",
        "date": "2025-04-02",
        "summary": "Accenture, Deloitte, IBM and other firms submitted proposed price concessions but are expected to be asked to dig deeper."
    },
    {
        "company": "MSFT",
        "title": "Tech Stocks Fall After U.S. Restrictions on Nvidia's China Exports",
        "date": "2025-04-16",
        "summary": "Plus: The U.K.’s Supreme Court rules that transgender women can’t be defined as women. Canada holds interest rates steady as it examines the impact of tariffs. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Futures Fall After Major Indexes Edged Lower on Tuesday",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How RFK Jr. Is Reshaping the U.S. Health Agencies",
        "date": "2025-03-27",
        "summary": "P.M. Edition for Mar. 27. Health and Human Services Secretary Robert F. Kennedy Jr. announced "
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Banks Warn of Risk to U.S. Economy Because of Tariffs",
        "date": "2025-04-11",
        "summary": "P.M. Edition for April 11. In earnings calls today, executives warned that President Trump’s tariffs were "
    },
    {
        "company": "MSFT",
        "title": "Tufts Graduate Student Detained by Federal Immigration Authorities",
        "date": "2025-03-26",
        "summary": "Rumeysa Ozturk, a Ph.D. student at Tufts University, was taken into custody by federal immigration agents outside her off-campus apartment. "
    },
    {
        "company": "MSFT",
        "title": "IMF Chief: Global Trade Will Slow Amid Tariffs, but Recession Unlikely",
        "date": "2025-04-17",
        "summary": "Kristalina Georgieva, managing director for the International Monetary Fund, said in a speech that while uncertainty has increased, the “economic fundamentals are still quite strong.” "
    },
    {
        "company": "MSFT",
        "title": "Black Monday? The S&P 500 is Crashing Like It's 1987",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: CarMax, TSMC, Trump Media, U.S. Steel",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trades Before Trump Tariff Post Draw Scrutiny",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How the Reversal of the ‘American Exceptionalism’ Trade Is Rippling Around the Globe",
        "date": "2025-03-29",
        "summary": "Outsize U.S. bets delivered foreign investors years of windfall profits, but have left them exposed to this year’s selloff."
    },
    {
        "company": "MSFT",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "This Former USAID Head Has Advice for Elon Musk and DOGE",
        "date": "2025-04-18",
        "summary": "Rajiv Shah"
    },
    {
        "company": "MSFT",
        "title": "Say Hello to Your New Colleague, the AI Agent",
        "date": "2025-04-03",
        "summary": "Today’s CEOs are the final generation of executives who will lead exclusively human workforces."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Post Gains Ahead of Trump Tariff Announcement",
        "date": "2025-04-02",
        "summary": "Investors hope clarity on trade will help markets recover."
    },
    {
        "company": "MSFT",
        "title": "About The Wall Street Journal Economic Forecasting Survey",
        "date": "2025-04-13",
        "summary": "Answers to frequently asked questions about the survey plus links to survey stories and archival data."
    },
    {
        "company": "MSFT",
        "title": "How Is SoftBank Funding Its Mega Investment in OpenAI? A Lot of Debt",
        "date": "2025-04-01",
        "summary": "The Japanese investment firm is entwining its fortunes with a company that expects to lose billions of dollars for years to come, in the hope that it will emerge as the leader in AI."
    },
    {
        "company": "MSFT",
        "title": "Nvidia’s Dominance Reflects the CEO’s Unique Business Logic",
        "date": "2025-04-12",
        "summary": "The AI powerhouse has become ubiquitous, paradoxically by doing only what it deems essential."
    },
    {
        "company": "MSFT",
        "title": "Treasury Secretary Scott Bessent Says Economy in ‘Good Shape’",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Main Street vs. Wall Street Canard",
        "date": "2025-04-09",
        "summary": "President Trump and Treasury Secretary Bessent pick up the left’s false economic dichotomy."
    },
    {
        "company": "MSFT",
        "title": "Why Markets Are Melting Down",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Read about sustainable aviation fuels, Cheniere Energy, European oil stocks, Dialog Group, and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Chinese Exports Surge as Importers Rush to Beat Tariffs",
        "date": "2025-04-14",
        "summary": "Plus, a rollback on tariffs for the tech sector sends markets higher, even as the Trump Administration warns the reprieve could be short lived. And a key architect of Trump’s campaign to slash foreign aid has left the State Department after less than three months on the job. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall, Wiping Out More Than $3 Trillion in Market Value",
        "date": "2025-04-03",
        "summary": "P.M. Edition for April 3. U.S. markets experience their s"
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "MSFT",
        "title": "Financial Services Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Read about American Express, Levi Strauss, Prudential PLC, and more in the latest Market Talks covering Financial Services."
    },
    {
        "company": "MSFT",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "MSFT",
        "title": "Democrats Fear Trump’s Crypto Entity Poses Regulatory Conflict",
        "date": "2025-03-28",
        "summary": "Senators wrote to financial watchdogs to ask how they plan to oversee the Trump family’s cryptocurrency activities."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: OpenAI’s $40 Billion Funding Round Has a Catch",
        "date": "2025-03-28",
        "summary": "Plus, CoreWeave’s much-anticipated IPO flounders. And, President Trump adds Nikola’s founder to his raft of pardons. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Individual Investors Brave Tariff Turmoil, Just in Time for a 6% Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Democrats Fear Trump’s Crypto Entity Poses Regulatory Conflict",
        "date": "2025-03-28",
        "summary": "Senators wrote to financial watchdogs to ask how they plan to oversee the Trump family’s cryptocurrency activities."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: OpenAI’s $40 Billion Funding Round Has a Catch",
        "date": "2025-03-28",
        "summary": "Plus, CoreWeave’s much-anticipated IPO flounders. And, President Trump adds Nikola’s founder to his raft of pardons. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Individual Investors Brave Tariff Turmoil, Just in Time for a 6% Selloff",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How One of the Wildest Weeks in Market History Unfolded",
        "date": "2025-04-12",
        "summary": "A tense, volatile week on Wall Street ended with all three major U.S. indexes up 5% or more, yet still below where they were when President Trump launched his tariff blitz."
    },
    {
        "company": "MSFT",
        "title": "Biotech Investors Rush for the Exits After FDA Official Resigns",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "MSFT",
        "title": "Which Stocks Held Up in the Market Rout?",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "This Financial Firm Can Give Investment Advice in Gen Z Slang, No Cap",
        "date": "2025-04-01",
        "summary": "Arta, a wealth-management startup, is using mobile apps and AI tools to reach young millionaires."
    },
    {
        "company": "MSFT",
        "title": "Spotify, Netflix Prove Bright Spots Within Broader Market Selloff",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Venture Market Notches Strong Quarter—Thanks Mostly to One Mammoth AI Deal",
        "date": "2025-04-03",
        "summary": "Investors say competition for artificial intelligence startups is fierce, and OpenAI’s $40 billion fundraise proved it."
    },
    {
        "company": "MSFT",
        "title": "Dollar Tree Attracts More Shoppers As Recession Fears Loom",
        "date": "2025-03-26",
        "summary": "Dollar Tree said more customers across incomes shopped at its stores in the latest quarter, a sign that concerns about the economy are giving the discount retailer a boost."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Deloitte to Lay Off U.S. Consultants After Government Cost Crackdown",
        "date": "2025-04-03",
        "summary": "The move comes after demands by the federal government to identify potential cost cuts to existing projects."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: UnitedHealth, Marvell, CVS, Humana",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Amazon and Meta Share in China’s Tariff Pain - Heard on the Street",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "MSFT",
        "title": "U.S. Says Europe’s Tech Rules Are a Trade Barrier",
        "date": "2025-04-01",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Trump Adds Tougher Limits on China’s Access to U.S. Technology",
        "date": "2025-03-26",
        "summary": "Plus, AI startup Anthropic wins in court over copyrighted music. And, Gamestop’s play in bitcoin boosts its stock. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: JPMorgan, Wells Fargo, BlackRock, Newmont",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Recession Trade Drives Selloff in Stock Futures",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Traders Dial Up Bets on Interest-Rate Cuts",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "ProSiebenSat.1 Shares Plunge After MFE-MediaForEurope’s Takeover Offer",
        "date": "2025-03-27",
        "summary": "Shares slumped 12% after MFE  said it will offer shareholders the volume-weighted three-month average price."
    },
    {
        "company": "MSFT",
        "title": "FTC’s Case Against Drug Managers on Hold After Commissioners Fired",
        "date": "2025-04-02",
        "summary": "The agency has paused its lawsuit against three pharmacy-benefit managers because no current commissioners can participate in the case."
    },
    {
        "company": "MSFT",
        "title": "Aston Martin Shares Jump on Plans for Cash Injection",
        "date": "2025-03-31",
        "summary": "The sports-car maker said it could raise £125 million through an investment by Executive Chair Lawrence Stroll’s firm and a sale of its stake in the Formula One team that bears its name."
    },
    {
        "company": "MSFT",
        "title": "Stocks Mixed Ahead of Sweeping Trump Tariffs Announcement",
        "date": "2025-04-01",
        "summary": "President Trump is due to unveil sweeping tariffs tomorrow afternoon—but what exactly he will announce is unclear. Plus: executives at Meta Platforms press trade officials to fight an expected European Union fine and cease-and-desist order. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Tariff Pause Sends Tech Stocks Soaring",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "EU Competition Chief Goes to Washington, With Tech Rulings Looming",
        "date": "2025-04-01",
        "summary": "Teresa Ribera’s trip comes as her department wraps up investigations into Apple and Meta under the Digital Markets Act — the European Union’s digital antitrust law."
    },
    {
        "company": "MSFT",
        "title": "They Went to the Masters. They Ditched Their Cellphones. Then the Markets Went Completely Crazy.",
        "date": "2025-04-10",
        "summary": "Augusta National is one of the last places on Earth where fans are forced to disconnect, leaving finance bros in the dark about Wednesday’s market drama."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stock Futures Slide After Tough Day for Major Indexes",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Health Care Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Find insight on Novo Nordisk, product-specific tariffs, Pro Medicus and more in the latest Market Talks on Health Care."
    },
    {
        "company": "MSFT",
        "title": "Watch: Musk and DOGE Team Answer Questions About Cost-Cutting Drive",
        "date": "2025-03-28",
        "summary": "Elon Musk and members of the Department of Government Efficiency team appeared on Fox News and addressed questions on what DOGE has achieved. "
    },
    {
        "company": "MSFT",
        "title": "Chatbot Confidential: When AI at Work Is Risky Business",
        "date": "2025-04-06",
        "summary": "Gen AI chatbots have changed how we work. Today, we bring you the second installment of Tech News Briefing’s special series “Chatbot Confidential,” where WSJ personal tech columnist Nicole Nguyen details best practices for using the chatbots while protecting your privacy. In this episode, we dive into an area where the temptation to tap generative AI tools is very strong: work! We’ll tell you about the risks your new helper brings and how not to give away company secrets while using them."
    },
    {
        "company": "MSFT",
        "title": "The Federal Workers Who Are Not Quite Fired, Not Quite Working",
        "date": "2025-03-27",
        "summary": "Thousands of people who were fired then rehired by the Trump administration remain in limbo. Says one: “They want to get rid of us one way or another.”"
    },
    {
        "company": "MSFT",
        "title": "Here’s How Markets Are Responding to Trump’s Tariffs Announcement",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Atlantic Magazine Releases Signal Texts Showing Hegseth Shared Attack Details ",
        "date": "2025-03-26",
        "summary": "Plus: The Congressional Budget Office says the U.S. government will probably run out of money in August or September. And Dollar Tree agrees to sell its Family Dollar business for about $1 billion. Alex Ossola hosts. "
    },
    {
        "company": "MSFT",
        "title": "The Trump Touch - Is America's Leadership Failing?",
        "date": "2025-04-23",
        "summary": "President Donald Trump's multi-front attempt to remake America and the world is meeting with mixed success. His administration has ended the crisis at the border and is aggressively moving against illegal migrants. But elsewhere the picture is murky. The war in Ukraine rages on, the Middle East continues unsettled and above all, his restless back-and-forth on tariffs and international economics is causing profound damage to faith in U.S. economic stability.  And some of his actions suggest an authoritarian style inimical to American values.  "
    },
    {
        "company": "MSFT",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    },
    {
        "company": "MSFT",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    }
]