[
    {
        "company": "MSFT",
        "title": "Offices Ditch Harsh Fluorescent Lights. New Tech Is On the Way.",
        "date": "2025-04-22",
        "summary": "From faux skylights to circadian-tuned systems, lighting upgrades are a priority for companies trying to lure employees back to the workplace."
    },
    {
        "company": "MSFT",
        "title": "Dyson’s New Headquarters Is a Reversible Building Within a Building",
        "date": "2025-04-23",
        "summary": "When Dyson renovated its new headquarters in a nearly 100-year-old Singaporean national monument, it faced a unique challenge: Everything it added had to be completely reversible. WSJ took a tour."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Trade War Is Threatening to Derail the Office-Market Recovery",
        "date": "2025-04-14",
        "summary": "Leasing by businesses hit a recent high in the first quarter, but economic uncertainty is prompting a pause in some dealmaking."
    },
    {
        "company": "MSFT",
        "title": "How the Science of Color Boosts Productivity at Work",
        "date": "2025-04-09",
        "summary": "As more companies call employees back to the office, they are also rethinking the use of color in workplace design."
    },
    {
        "company": "MSFT",
        "title": "Why Dyson’s New Headquarters Is a Reversible Building Within a Building",
        "date": "2025-04-23",
        "summary": "When Dyson renovated its new headquarters in a nearly 100-year-old Singaporean national monument, it faced a unique challenge: Everything it added had to be completely reversible. WSJ took a tour."
    },
    {
        "company": "MSFT",
        "title": "Meet the People Who Work Fully Remote—and Hate It",
        "date": "2025-03-28",
        "summary": "Most employees still want to be able to work from home at least some of the time. But a small cohort yearns to get back to cubicles and chit-chat."
    },
    {
        "company": "MSFT",
        "title": "Rubio Unveils State Department Overhaul to Promote Trump’s ‘America First’ Policies",
        "date": "2025-04-22",
        "summary": "Secretary lays out plans to cut positions and shrink what he called ‘bloated’ bureaucracy."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Quiet Luxury Meets…the ’80s? The Modern Way to Power Dress at the Office",
        "date": "2025-04-03",
        "summary": "Fashion from the 1980s is back in business. Don’t be afraid. How to pull off shoulder pads, bold jewelry and statement hair in 2025."
    },
    {
        "company": "MSFT",
        "title": "Your Packed Lunch Could Cost More Than You Think",
        "date": "2025-04-21",
        "summary": "More workers are "
    },
    {
        "company": "MSFT",
        "title": "Why Airbus’s Plans for a Green Jet Remain Grounded",
        "date": "2025-04-23",
        "summary": "Airbus’s"
    },
    {
        "company": "MSFT",
        "title": "Government Jobs Insulated DC From Economic Volatility. Not Any More.",
        "date": "2025-04-19",
        "summary": "The president ‘s federal government shake-up is taking a toll on the U.S. capital’s economy. "
    },
    {
        "company": "MSFT",
        "title": "Clearing Foggy Bottom",
        "date": "2025-04-23",
        "summary": "Secretary of State Marco Rubio moves to overhaul one of Washington’s more dysfunctional operations."
    },
    {
        "company": "MSFT",
        "title": "How Trump and His ‘Gold Guy’ Are Redecorating the White House",
        "date": "2025-04-16",
        "summary": "The president is making the world’s most famous residence more like Mar-a-Lago, his gilded Florida club."
    },
    {
        "company": "MSFT",
        "title": "Circle Back on the Deep Dive",
        "date": "2025-04-20",
        "summary": "A note on the rules of language that govern business meetings."
    },
    {
        "company": "MSFT",
        "title": "A $145,000 Mudroom With Storage, Seating and a Sink to Clean Your Corgi",
        "date": "2025-04-19",
        "summary": "The New York homeowner included a bed, crate and dog-washing station in the 264-square-foot space."
    },
    {
        "company": "MSFT",
        "title": "He Wanted Room for 21 of His Porsches. So He Built a Second House Across the Street.",
        "date": "2025-04-23",
        "summary": "Near Palm Springs, Calif., architect Steven Harris spent millions designing a modern house equipped with an underground garage for his sports cars."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "A $620,000 Renovation Kept Their Art-Filled Home From Feeling Like a Museum",
        "date": "2025-04-03",
        "summary": "A nine-month project gave a pair of Raleigh penthouse owners a space to display their 120-piece art collection, without making it feel too sterile."
    },
    {
        "company": "MSFT",
        "title": "Saving the Office From Becoming a Passive-Aggressive Hellscape",
        "date": "2025-04-03",
        "summary": "Texas trial lawyer and internet star Jefferson Fisher on bringing back directness as workers return to the office: ‘We’re doomed if we don’t change our approach.’"
    },
    {
        "company": "MSFT",
        "title": "Big Office Landlord Made $4 Million in Previously Undisclosed Payouts to Its CEO",
        "date": "2025-04-05",
        "summary": "Paramount Group recently revealed that it made payments to the chief executive’s jet company as well as for his personal accounting services."
    },
    {
        "company": "MSFT",
        "title": "The AP-White House Case Is About Separation of Powers",
        "date": "2025-04-09",
        "summary": "The Oval Office, like a judge’s chambers, is off-limits to the other government branches."
    },
    {
        "company": "MSFT",
        "title": "Your New Lunch Habit Is Hurting the Economy",
        "date": "2025-04-04",
        "summary": "More people are bringing lunch to work and restaurants are selling fewer lunches than they did in 2020"
    },
    {
        "company": "MSFT",
        "title": "The Best Men’s Ties, From Office Casual to Gala Ready",
        "date": "2025-04-04",
        "summary": "Expert-approved picks you’ll actually want to wear."
    },
    {
        "company": "MSFT",
        "title": "Career Centers (Saturday Crossword, April 12)",
        "date": "2025-04-11",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "29 Best Gifts for Your Boss ",
        "date": "2025-04-09",
        "summary": "These expert finds hit just the right (thoughtful, appropriate) note."
    },
    {
        "company": "MSFT",
        "title": "Bank Trading Desks Are Minting Money From Trump’s Tariff Chaos",
        "date": "2025-04-15",
        "summary": "Goldman Sachs, JPMorgan and Morgan Stanley all saw huge jumps in trading revenue."
    },
    {
        "company": "MSFT",
        "title": "Hours in Line, Cut-Off Calls: Accessing Social Security in the Era of DOGE",
        "date": "2025-04-06",
        "summary": "Advocates say cutbacks hurt the agency’s already depleted field offices: “It’s like a house of cards.”"
    },
    {
        "company": "MSFT",
        "title": "A Televangelist Finds Herself at Home in Trump’s White House",
        "date": "2025-04-17",
        "summary": "Paula White, a longtime friend of the president, mixes prayer, politics and fundraising for her ministry. “We pray for God to use him.”"
    },
    {
        "company": "MSFT",
        "title": "Parents Hoped a Rec Room Would Get Their Kids Off Their Phones. It Worked.",
        "date": "2025-03-28",
        "summary": "Dungeon-like rec rooms, with their stingy light and cast-off sofas, are so last century. Behold the rise—literally—of the stylish game room, where everyone wants to hang and family time beats out screen time."
    },
    {
        "company": "MSFT",
        "title": "The Frick’s Renovation Is a Subtle Revelation",
        "date": "2025-04-09",
        "summary": "Remodeled by Selldorf Architects, the New York museum has gained space and free-flowing paths of movement through a series of humble but imaginative interventions."
    },
    {
        "company": "MSFT",
        "title": "My Dad Is a Top Hollywood Agent. But He Started at the Bottom.",
        "date": "2025-04-14",
        "summary": "Matthew Specktor tells the story of his super-agent father, Fred Specktor’s, rise through the agency ranks in ‘The Golden Hour.’"
    },
    {
        "company": "MSFT",
        "title": "The Anklets of Your Youth Are All Grown Up—and Office-Ready",
        "date": "2025-04-16",
        "summary": "No longer reserved for middle-schoolers, anklets even made an appearance at Chanel’s fashion show this season. How to wear these sophisticated takes—with the best shoes for each style."
    },
    {
        "company": "MSFT",
        "title": "Mark Klein, a Whistleblower Who Revealed Domestic Spying, Dies at 79",
        "date": "2025-04-11",
        "summary": "The AT&T technician predated Edward Snowden by seven years, but his allegations were never able to achieve traction."
    },
    {
        "company": "MSFT",
        "title": "Health Department Begins Sweeping Job Cuts",
        "date": "2025-04-01",
        "summary": "CDC, FDA, NIH are among agencies shedding thousands of workers. Some senior leaders and entire divisions are being cut."
    },
    {
        "company": "MSFT",
        "title": "How the Company Making Nearly All Its Money From the Government Is Navigating Trump’s Cuts",
        "date": "2025-04-03",
        "summary": "Booz Allen’s CEO discusses the more than $1 billion in price concessions his firm has offered up and what its business will look like post-DOGE."
    },
    {
        "company": "MSFT",
        "title": "We Had Been Scraping By on Two Paychecks. Now We Have One.",
        "date": "2025-04-06",
        "summary": "My wife and I are in our late 30s. If one of us is going to take a chance at starting a business, now’s the time to do it."
    },
    {
        "company": "MSFT",
        "title": "House of the Week: A Modern San Francisco Home With Loads of Natural Light",
        "date": "2025-04-11",
        "summary": "The owners were drawn to the San Francisco home’s indoor-outdoor layout, as well as its history."
    },
    {
        "company": "MSFT",
        "title": "New York’s Hottest New Department Store Has Almost No Tech",
        "date": "2025-04-02",
        "summary": "Printemps, which opened last month in the Financial District, is betting that minimal customer-facing technology will create a more compelling in-store experience."
    },
    {
        "company": "MSFT",
        "title": "Late McKinsey Executive’s Hamptons Compound Lists for $41.9 Million",
        "date": "2025-04-17",
        "summary": "The roughly 4.4-acre property has about 260 feet of frontage on Hook Pond and overlooks the Maidstone Club."
    },
    {
        "company": "MSFT",
        "title": "Interior Secretary Doug Burgum Takes On Everything ",
        "date": "2025-04-08",
        "summary": "With a sprawling portfolio that spans national lands, wildlife, oceans and Indian Affairs, Interior Secretary Doug Burgum sits at the intersection of key areas of Donald Trump's agenda. In this episode of All Things, Secretary Burgum lays out his vision for getting national lands to again \"benefit\" Americans, with big plans for energy production, permitting, housing development, timber management and recreation. He also walks through Interior's efficiency drive, and his plans to use staffing cuts to improve public service, including at the National Park Service. "
    },
    {
        "company": "MSFT",
        "title": "Accused Tech Spy Says Rival CEO Recruited Him With Offer to Be Like James Bond",
        "date": "2025-04-02",
        "summary": "An alleged spying plot in the payroll-services industry involves allegations by a former employee of Rippling that he was recruited to feed the company’s private information to a competitor, Deel."
    },
    {
        "company": "MSFT",
        "title": "RFK Jr. Plans 10,000 Job Cuts in Major Restructuring of Health Department",
        "date": "2025-03-27",
        "summary": "The changes would reshape the nation’s health agencies and close regional offices."
    },
    {
        "company": "MSFT",
        "title": "The Next Logical Step After Quitting Corporate Life? Teaching Himself to Build a House.",
        "date": "2025-04-10",
        "summary": "With virtually no experience, a former white-collar worker became the project manager and general laborer on his family’s barn-conversion home in the English countryside"
    },
    {
        "company": "MSFT",
        "title": "Enhance Your Outdoor Space With Outer’s Durable, Innovative Furniture",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Say Hello to Your New Colleague, the AI Agent",
        "date": "2025-04-03",
        "summary": "Today’s CEOs are the final generation of executives who will lead exclusively human workforces."
    },
    {
        "company": "MSFT",
        "title": "Public Officials Separate Workplace and Personal Online Lives. Hackers Don’t Care.",
        "date": "2025-04-07",
        "summary": "Some government officials have defended their use of commercial apps, including Gmail and X, by drawing a line between their professional and personal online activity. But for hackers, there are no such boundaries."
    },
    {
        "company": "MSFT",
        "title": "Three Federal Workers Hit by DOGE",
        "date": "2025-03-27",
        "summary": "President Trump’s unprecedented effort to shrink the federal labor force is impeding work at government sites across the country. Three laid-off federal employees tell their story and WSJ’s "
    },
    {
        "company": "MSFT",
        "title": "Inside Elon Musk’s Shock-and-Awe Months in the White House",
        "date": "2025-04-05",
        "summary": "President Trump directed his chief of staff to better manage the billionaire adviser after complaints arose from his cabinet and staff."
    },
    {
        "company": "MSFT",
        "title": "31 Gifts Every College Grad Will Appreciate",
        "date": "2025-04-07",
        "summary": "Help them celebrate with expert-approved essentials and fresh takes."
    },
    {
        "company": "MSFT",
        "title": "Consulting Giants Offer Billions in Cuts to Federal Contracts. It Might Not Be Enough.",
        "date": "2025-04-02",
        "summary": "Accenture, Deloitte, IBM and other firms submitted proposed price concessions but are expected to be asked to dig deeper."
    },
    {
        "company": "MSFT",
        "title": "The Day Trump’s Tariffs Shook Corporate America",
        "date": "2025-04-03",
        "summary": "Executives scrambled to grasp the scope and size of the president’s trade barriers."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Inside the Hunt for Putin’s Sleeper Agents ",
        "date": "2025-03-28",
        "summary": "A family of deep-cover Russian spies hiding in the heart of Europe. A Slovenian spycatcher with a daunting mission. After months of reporting, WSJ's "
    },
    {
        "company": "MSFT",
        "title": "The Federal Workers Who Are Not Quite Fired, Not Quite Working",
        "date": "2025-03-27",
        "summary": "Thousands of people who were fired then rehired by the Trump administration remain in limbo. Says one: “They want to get rid of us one way or another.”"
    },
    {
        "company": "MSFT",
        "title": "A Closer Look",
        "date": "2025-04-04",
        "summary": "Selections from ‘Mighty: The Story of an Oak Tree Ecosystem’ by Henry Cole"
    },
    {
        "company": "MSFT",
        "title": "How RFK Jr. Is Reshaping the U.S. Health Agencies",
        "date": "2025-03-27",
        "summary": "P.M. Edition for Mar. 27. Health and Human Services Secretary Robert F. Kennedy Jr. announced "
    }
]