[
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks on Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-21",
        "summary": "Find insight on Google, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Continue Rally for Second Day",
        "date": "2025-04-23",
        "summary": "Plus: The White House says there will be \"no unilateral reduction in tariffs against China.\" And OpenAI CEO Sam Altman says he is stepping down as chairman of the nuclear-energy startup Oklo. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple and Meta Slapped With EU Fines",
        "date": "2025-04-23",
        "summary": "Plus: Nvidia gets into the AI agents game. And SAP sees its stock climb as it dodges tariff hits—for now. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump’s Rearview Antitrust Battles",
        "date": "2025-04-24",
        "summary": "The cases against Meta and Google miss how fast markets are changing."
    },
    {
        "company": "MSFT",
        "title": "The Secrets and Misdirection Behind Sam Altman’s Firing From OpenAI",
        "date": "2025-03-28",
        "summary": "The inside story of how the CEO of the hottest tech company was ousted and, just as quickly, resurrected."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-25",
        "summary": "Find insight on Alphabet, Autohome and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tesla Profit Slumps",
        "date": "2025-04-22",
        "summary": "Plus: Meta could see a $7 billion pullback from Chinese advertisers over tariffs, research firm says. And Verizon says it won’t cover any handset price increases due to tariffs. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "The Stock Market's Winners and Losers Today",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dealmakers Are Struggling to Make Sense of Trump’s Antitrust Policy",
        "date": "2025-04-22",
        "summary": "Approval of the Capital One deal should be a positive sign; all eyes now turn to Google-Wiz."
    },
    {
        "company": "MSFT",
        "title": "A Side Hustle for Friends of Musk: Selling Access to Stakes in His Private Companies",
        "date": "2025-04-25",
        "summary": "Lucrative stock deals have allowed SpaceX to avoid public scrutiny even as it has grown into one of the largest companies in the U.S."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch on Friday: Alphabet, Intel, Skechers, T-Mobile",
        "date": "2025-04-25",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Fighting the Fed",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-23",
        "summary": "Find insight on Rogers Communications, Meta, Just Eat Takeaway.com, and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Bold Names Season 3",
        "date": "2025-04-25",
        "summary": "WSJ interview series where you hear directly from the leaders of bold-name companies."
    },
    {
        "company": "MSFT",
        "title": "Nokia Flags Earnings Hit From Tariffs",
        "date": "2025-04-24",
        "summary": "The company expects to take an earnings hit in the second quarter from tariffs and said that reaching the high end of its guidance range for the year now looked more challenging."
    },
    {
        "company": "MSFT",
        "title": "IBM Is Back. Now It Must Prove Its Mettle in AI.",
        "date": "2025-04-25",
        "summary": "“Big Blue” has clawed its way back into investor favor, but the company needs to show staying power in AI to cement its comeback."
    },
    {
        "company": "MSFT",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "MSFT",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "MSFT",
        "title": "Big Tech Braces for Tariff-Induced Advertising Slowdown",
        "date": "2025-04-24",
        "summary": "Early signs of deceleration in the U.S. digital ad industry began to hit in April."
    },
    {
        "company": "MSFT",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Meta Faces Off With FTC at Antitrust Trial",
        "date": "2025-04-14",
        "summary": "Meta and the Federal Trade Commission make their opening arguments in a trial that could end with a divestment of Instagram and WhatsApp. Plus: A tariff reprieve sends tech stocks higher, and Nvidia says it will make AI supercomputers entirely in the U.S. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Markets Rally as Trump Softens Threats on China, Powell",
        "date": "2025-04-23",
        "summary": "Plus, Tesla shares rise after Elon Musk says will wind down his time at the Department of Government Efficiency. And Apple and Meta are fined hundreds of millions of dollars by the EU and ordered to comply with tech competition rules. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Alphabet Revenue Surges",
        "date": "2025-04-24",
        "summary": "Plus: Intel plans to cut management roles as its losses widen. And Huawei lobbyists are locked out of the European Commission. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Google Faces Its Monopoly Reckoning",
        "date": "2025-04-20",
        "summary": "The Justice Department’s proposal that the company share data, shed its Chrome browser, and cease exclusionary contracts deserves broad support. "
    },
    {
        "company": "MSFT",
        "title": "Tech Shares Drive Stocks Higher for a Third Straight Session",
        "date": "2025-04-24",
        "summary": "Nasdaq Composite is up more than 5% this week on trade-deal optimism."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk Is Stepping Back From DOGE. Can He Really Stay Away?",
        "date": "2025-04-25",
        "summary": "Elon Musk says he’s going to spend less time in Washington and more time running Tesla. WSJ columnist and Musk-watcher Tim Higgins unpacks what that plan might look like in reality. Also, the WSJ’s Isabelle Bousquette takes us inside "
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Either Sadness or Euphoria",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: Either Sadness or Euphoria",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Fed, Tariff Fears Send Dow Down More Than 900 Points",
        "date": "2025-04-21",
        "summary": "The Dow industrials fell 2.5% as Trump’s threats to fire the Fed chief exacerbated turmoil from his trade restrictions. The dollar hit fresh multiyear lows against the euro and yen, while gold rose to a record."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: Alphabet, Intel, P&G, Merck",
        "date": "2025-04-24",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Inside Story of Sam Altman’s Firing–and Rehiring–at OpenAI",
        "date": "2025-04-07",
        "summary": "WSJ reporter Keach Hagey gives us a behind-the-scenes look into one of the "
    },
    {
        "company": "MSFT",
        "title": "JD Vance Sees an India That America Can Work With",
        "date": "2025-04-22",
        "summary": "The vice president says India and the U.S. are making progress in trade talks."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-18",
        "summary": "TSMC,  Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Our Capitulation Nation",
        "date": "2025-04-20",
        "summary": "Everybody’s folding, from Trump and Democrats to law firms and universities."
    },
    {
        "company": "MSFT",
        "title": " ‘Sell America’ Trade Picks Up After New Trump Threats on Fed",
        "date": "2025-04-21",
        "summary": "P.M. Edition for April 21. U.S. markets were on edge about President Trump's tariff war as well as his threats to fire Federal Reserve chief Jerome Powell. Stocks fell, the dollar hit fresh multiyear lows against major currencies, and yields on longer-term Treasurys rose. Plus, U.S. megabanks are built for business from all corners of the globe. Heard on the Street columnist "
    },
    {
        "company": "MSFT",
        "title": "Trump Targets Democrats’ Main Funding Platform",
        "date": "2025-04-25",
        "summary": "Plus, President Trump gives the green light on deep-sea mining. And Google and Meta prepare for a tariff-induced advertising slowdown. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Bounce Back on Hopes of Trade War De-Escalation",
        "date": "2025-04-22",
        "summary": "P.M. Edition for April 22. "
    },
    {
        "company": "MSFT",
        "title": "How Dyson’s Founder Picks What to Invent Next",
        "date": "2025-04-23",
        "summary": "James Dyson’s bagless vacuum built a global empire. WSJ met the founder at Dyson’s headquarters in Singapore to discuss failure and the tension between innovation and profitability. "
    },
    {
        "company": "MSFT",
        "title": "How DOGE Plans to Plow Ahead Without Musk at the Helm",
        "date": "2025-04-24",
        "summary": "The Tesla CEO’s White House role is expected to diminish in the coming weeks."
    },
    {
        "company": "MSFT",
        "title": "Tesla Rises as Musk Signals DOGE Work ‘Mostly Done’",
        "date": "2025-04-23",
        "summary": "A.M. Edition for April 23. Global markets "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Recap: IBM, Shopify, Intuitive Surgical, Boeing",
        "date": "2025-04-23",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall and the Dollar Drops Amid Trump’s Threats to Fire Fed Chair",
        "date": "2025-04-21",
        "summary": "Investors are seeking refuge after President Trump’s renewed attacks on Federal Reserve chief Jerome Powell. Plus: DHL stock falls after it suspends high-value shipments to the U.S. And Capital One shares rise after regulators approve its $35 billion acquisition of Discover. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Russia Launches Major Assault on Kyiv",
        "date": "2025-04-24",
        "summary": "A.M. Edition for April 24. Moscow has "
    },
    {
        "company": "MSFT",
        "title": "Surprise Will of Late Zappos CEO Adds New Twist for His Fortune",
        "date": "2025-04-23",
        "summary": "In the years since the death of entrepreneur Tony Hsieh, his family and friends have been fighting in court over his estate. A mysterious document has emerged that may be the sole legal record of his final wishes."
    },
    {
        "company": "MSFT",
        "title": "OpenAI CEO Sam Altman to Resign as Oklo Chairman",
        "date": "2025-04-22",
        "summary": "Altman’s resignation opens up the opportunity for future deals between OpenAI and the nuclear-energy startup. Oklo shares fall after hours."
    },
    {
        "company": "MSFT",
        "title": "India Sees a Golden Opportunity in U.S.-China Trade War",
        "date": "2025-04-22",
        "summary": "A.M. Edition for April 22. The U.S. and India agree to broad terms to negotiate a potential trade deal. WSJ’s South Asia bureau chief "
    },
    {
        "company": "MSFT",
        "title": "Roche, Apple, TSMC: Tracking Corporate Spending Pledges Under Trump",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "Tesla’s Net Income Sinks 71% in First Quarter",
        "date": "2025-04-22",
        "summary": "Plus: stocks rally on optimism from White House on tariff negotiations. And Verizon says it won’t pay for the costs of tariffs on smartphones, but shoppers will. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Trump Follows but Rebrands Biden’s Semiconductor Policy",
        "date": "2025-04-20",
        "summary": "Whether you call such an effort the Chips Act or the Investment Accelerator, the goal remains the same."
    },
    {
        "company": "MSFT",
        "title": "Huge Stock Swings Are the New Normal for Frazzled Investors",
        "date": "2025-04-23",
        "summary": "April is poised to be the most-volatile calendar month since the Covid crash in 2020."
    },
    {
        "company": "MSFT",
        "title": "Stocks Rally on New Hopes of Tariffs Easing",
        "date": "2025-04-22",
        "summary": "The Dow industrials surged more than 1,000 points after Monday’s selloff."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Hertz, MicroStrategy, Capital One, Comerica",
        "date": "2025-04-21",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Tuesday: First Solar, 3M, Equifax, Tesla",
        "date": "2025-04-22",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Russia Attacks Kyiv, Killing Nine",
        "date": "2025-04-24",
        "summary": "Plus, Tesla’s sales in Europe fall for a third consecutive month. And President Trump rejects a tax hike on millionaires. Kate Bullivant hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Uber Sued Over Cancellation Practices",
        "date": "2025-04-21",
        "summary": "Plus: The Justice Department asks a federal judge to force Google to sell its Chrome web browser. And crypto firms swoop in on the banking world with applications for charters. Katie Deighton hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Considers Slashing China Tariffs",
        "date": "2025-04-23",
        "summary": "P.M. Edition for April 23. We exclusively report that President Trump is "
    },
    {
        "company": "MSFT",
        "title": "India Has a Golden Opportunity to Capture U.S. Business From China",
        "date": "2025-04-19",
        "summary": "The world’s most populous nation has long trailed not just China but also smaller countries with nimbler governments."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: OpenAI’s $40 Billion Funding Round Has a Catch",
        "date": "2025-03-28",
        "summary": "Plus, CoreWeave’s much-anticipated IPO flounders. And, President Trump adds Nikola’s founder to his raft of pardons. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Galaxy Digital Settles with NYAG for $200 Million Over Luna Ties",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Chipmakers Squeezed as Trump Ratchets Up China Trade Pressure",
        "date": "2025-04-17",
        "summary": "U.S. semiconductor companies Nvidia and Advanced Micro Devices will contend with new export restrictions on specialized chips for China and other nations. WSJ reporter Asa Fitch explains how that will "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Knocked From Top Mobile Spot in China",
        "date": "2025-04-18",
        "summary": "Plus: The WSJ reports the EU delayed planned punishments for Apple and Meta as U.S. trade talks neared. And hedge-fund billionaire Bill Ackman discloses a nearly 20% stake in Hertz and floats expanding its Uber partnership. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Case for Trump’s Tariffs",
        "date": "2025-04-01",
        "summary": "A.M. Edition for April 1. President Trump says he has "
    },
    {
        "company": "MSFT",
        "title": "Does Meta Have a Social Media Monopoly?",
        "date": "2025-04-17",
        "summary": "Mark Zuckerberg is in court defending Meta against a "
    },
    {
        "company": "MSFT",
        "title": "Big Tech Sticks to AI Spending Plans Despite Tariffs—For Now",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Lashes Out at Powell. But Can the President Fire the Fed Chair?",
        "date": "2025-04-17",
        "summary": "P.M. Edition for April 17. In a post on social media and in comments from the Oval Office, President Trump expressed his "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "How Right Wing Influencer Laura Loomer Targeted Top Security Officials",
        "date": "2025-04-05",
        "summary": "The conspiracy theorist has been loyal to Trump for a decade. Now, she’s cashing in on her influence."
    },
    {
        "company": "MSFT",
        "title": "Why AI Might Not Take All Our Jobs ",
        "date": "2025-04-14",
        "summary": "MIT economics professor Sendhil Mullainathan says it is in humans’ power to put artificial intelligence on a path to help us rather than replace us."
    },
    {
        "company": "MSFT",
        "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
        "date": "2025-04-14",
        "summary": "The chip maker’s plan to build AI tech in Texas comes on the heels of a new tariff threat."
    },
    {
        "company": "MSFT",
        "title": "Markets Await ‘Liberation Day’ Tariff Clarity",
        "date": "2025-04-02",
        "summary": "Plus, President Trump is expected to review a deal to keep TikTok operational ahead of a deadline to sell the app or shut it down. And Visa offers Apple about $100 Million to take over the tech giant’s credit card. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Settles on Tariff Plan Ahead of ‘Liberation Day’ Deadline",
        "date": "2025-04-01",
        "summary": "Plus, Meta CEO Mark Zuckerberg is pressing U.S. trade officials to help fight an expected European Union ruling that could undermine its ad business. And Softbank agrees to lead $40 billion funding for OpenAI. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Nvidia, AMD Drive Nasdaq Lower",
        "date": "2025-04-16",
        "summary": "Chipmakers’ shares tumble after the Trump administration confirms export controls on semiconductors designed for the Chinese market. Plus, Dutch chip-equipment maker ASML feels the pressure of tariffs. And Google faces a potential $6.6 billion antitrust lawsuit in the UK. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: SoftBank Racks Up Debt to Fund Massive OpenAI Bet",
        "date": "2025-04-01",
        "summary": "Plus, Meta’s AI research chief resigns. And Apple’s credit card spurs a costly battle among payment networks Visa, Amex and Mastercard. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "CEOs Break Silence on Trump Trade War",
        "date": "2025-04-08",
        "summary": "For weeks, business leaders have avoided voicing concerns about tariffs. Some executives are getting more vocal."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Judge Rules Google Built Illegal Ad Monopoly",
        "date": "2025-04-17",
        "summary": "Plus: Taiwan’s TSMC says it hasn’t seen a change in customer behavior from U.S. tariffs so far. And Netflix posts higher revenue from ads and subscriptions, thanks in part to higher prices. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Fires Director of National Security Agency",
        "date": "2025-04-04",
        "summary": "The dismissal of Gen. Tim Haugh comes after President Trump let go of several National Security Council officials."
    },
    {
        "company": "MSFT",
        "title": "Big Companies Are Leaving Delaware. Can Its Governor Stop the Exodus?",
        "date": "2025-04-17",
        "summary": "Companies from Tesla to Meta have left or are considering leaving Delaware after a series of controversial court decisions. WSJ looks at the impact of that exodus and talks with Gov. Matt Meyer about how the state is fighting back."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Close Higher Ahead of ‘Liberation Day’ Tariffs Announcement ",
        "date": "2025-04-02",
        "summary": "President Trump announced the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations. Plus: Meta chief executive Mark Zuckerberg is lobbying the White House to agree to a settlement that would prevent an antitrust trial. Shares in conservative TV outlet Newsmax slide more than 77%, continuing a rollercoaster first week of trading. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Tech Companies Lose Billions in Market Value",
        "date": "2025-04-03",
        "summary": "Plus, France’s president weighs retaliating against U.S. digital services. And  China and the EU agree to restart negotiations on electric-vehicle tariffs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "One Tech CEO Expects Tariffs to Hit Growth Prospects ",
        "date": "2025-04-03",
        "summary": "‘I can bet you that the impact of what’s happening on the macro side will be felt in the second half of the year,’ Egnyte Chief Executive Vineet Jain said."
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Lobbies Trump to Avoid Meta Antitrust Trial",
        "date": "2025-04-02",
        "summary": "Meta’s chief executive was at the White House on Wednesday, his third visit during Trump’s presidency,  according to people familiar with the matter."
    },
    {
        "company": "MSFT",
        "title": "The Week Google and Meta Faced an Antitrust Reckoning",
        "date": "2025-04-18",
        "summary": "The two titans of digital advertising are facing unprecedented legal threats over tactics they used to reach dominance."
    },
    {
        "company": "MSFT",
        "title": "How Are the Magnificent Seven Doing After the Tariff News?",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-08",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Social Media Stocks Continue Sliding, Thanks to Advertising Exposure",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-04-15",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Tesla, Nvidia, Newsmax",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Markets Fall, Dollar Sinks as Investors Grapple with Trump’s Tariffs",
        "date": "2025-04-03",
        "summary": "Plus, SunnyD sells to a Guatemalan company for about $1.5 billion. And New York City Mayor Eric Adams forms his own political party to run for re-election. Alex Ossola hosts. "
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: Buy the Yips",
        "date": "2025-04-10",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Will Trump Take Yes for an Answer?",
        "date": "2025-04-04",
        "summary": "Quick rewards for those who drop trade barriers will encourage others to do the same."
    },
    {
        "company": "MSFT",
        "title": "Inside Mark Zuckerberg’s Failed Negotiations to End Antitrust Case",
        "date": "2025-04-15",
        "summary": "The FTC wanted $30 billion to drop its case. Zuckerberg offered much less and hoped Trump would back him up."
    },
    {
        "company": "MSFT",
        "title": "Inside Mark Zuckerberg’s Failed Negotiations to End Antitrust Case",
        "date": "2025-04-15",
        "summary": "The FTC wanted $30 billion to drop its case. Zuckerberg offered much less and hoped Trump would back him up."
    },
    {
        "company": "MSFT",
        "title": "Nvidia’s Dominance Reflects the CEO’s Unique Business Logic",
        "date": "2025-04-12",
        "summary": "The AI powerhouse has become ubiquitous, paradoxically by doing only what it deems essential."
    },
    {
        "company": "MSFT",
        "title": "Amazon CEO Says Generative AI Will Reinvent Every Customer Experience",
        "date": "2025-04-10",
        "summary": "Generative AI is going to reinvent virtually every customer experience and enable entirely new ones that have only been dreamed about, Amazon.com Chief Executive Andy Jassy said."
    },
    {
        "company": "MSFT",
        "title": "Say Hello to Your New Colleague, the AI Agent",
        "date": "2025-04-03",
        "summary": "Today’s CEOs are the final generation of executives who will lead exclusively human workforces."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Apple Pivots to India to Soften iPhone Tariff Blow ",
        "date": "2025-04-07",
        "summary": "Plus Amazon and some other tech companies’ shares rebound after a chaotic day on Wall Street. And Chinese tech stocks take fright at Trump’s trade war. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Retreats From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "The Justice Department is backing away from some cases involving foreign bribery, money laundering and crypto markets. Defense lawyers are bracing for a slowdown."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "AMD Closes $4.9 Billion ZT Systems Deal, Targeting Its Piece of the ‘AI Factory’",
        "date": "2025-03-31",
        "summary": "Chip giant CEO Lisa Su says AI is still in its “very early stage” as the company revs up competition with Nvidia."
    },
    {
        "company": "MSFT",
        "title": "This Startup Says It Can Reshape How Companies Do R&D. Tech Luminaries Agree.",
        "date": "2025-04-07",
        "summary": "Rescale, an AI simulation startup, taps investors including Nvidia in $115 million round."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: New Auto Tariffs Sting Some Carmakers, But Not All",
        "date": "2025-03-27",
        "summary": "Plus, a freight startup comes up short on profitability. And, Sam-Bankman Fried makes a move. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Claims Tariffs Responsible for Nvidia U.S. Manufacturing Announcement",
        "date": "2025-04-14",
        "summary": "President Trump claimed that his re-election and tariffs were the reasons why Nvidia announced that it would build its AI supercomputers entirely in the U.S."
    },
    {
        "company": "MSFT",
        "title": "Dow Industrials Fall, Capping Another Tough Week on Wall Street ",
        "date": "2025-04-17",
        "summary": "Nvidia stock slips amid trade tensions; Trump renews attacks on Powell."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Leave Apple With a Cost Conundrum",
        "date": "2025-04-04",
        "summary": "The "
    },
    {
        "company": "MSFT",
        "title": "Nvidia to Make AI Supercomputers Entirely in U.S.",
        "date": "2025-04-14",
        "summary": "Plus: Goldman Sachs profit surges as tariff uncertainty powers trading revenue. And U.S. companies are going bankrupt at the fastest rate since 2010. Charlotte Gartenberg hosts."
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-27",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "OpenAI’s Latest Funding Round Comes With a $20 Billion Catch",
        "date": "2025-03-28",
        "summary": "A stipulation of the funding round, led by SoftBank, is adding pressure to OpenAI’s efforts to convert to a for-profit company."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-17",
        "summary": "Find insight on Deliveroo, Deutsche Telekom and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Fed Chair Warns of Difficult Choices as Trade War Rages",
        "date": "2025-04-16",
        "summary": "P.M. Edition for April 16. Federal Reserve Chair Jerome Powell warned today that the central bank could face "
    },
    {
        "company": "MSFT",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "The Magnificent Seven's Achilles Heel",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Dow and S&P Fall, Nasdaq Gains in Volatile Day for Stocks",
        "date": "2025-04-07",
        "summary": "Plus: Amazon outperforms the Nasdaq Composite Index. And Apple plans to send more iPhones to the U.S. from India to offset the high cost of China tariffs. Anthony Bansie hosts."
    },
    {
        "company": "MSFT",
        "title": "EU Competition Chief Goes to Washington, With Tech Rulings Looming",
        "date": "2025-04-01",
        "summary": "Teresa Ribera’s trip comes as her department wraps up investigations into Apple and Meta under the Digital Markets Act — the European Union’s digital antitrust law."
    },
    {
        "company": "MSFT",
        "title": "Meta’s Head of AI Research to Resign Amid Computing Push",
        "date": "2025-04-01",
        "summary": "Joelle Pineau said she would step down effective May 30, creating an executive vacancy as the company aggressively invests and competes in the booming sector."
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mr. Fix-It Takes Center Stage During a Really Bad Week",
        "date": "2025-04-05",
        "summary": "Antonio Gracias made a rare public appearance alongside his friend as he helps with DOGE."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Fed Chair in the Hot Seat",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "This Former USAID Head Has Advice for Elon Musk and DOGE",
        "date": "2025-04-18",
        "summary": "Rajiv Shah"
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "MSFT",
        "title": "Sam Bankman-Fried’s New Home: A Run-Down Prison That Once Housed Al Capone",
        "date": "2025-04-12",
        "summary": "The former crypto billionaire is now doing time at Los Angeles’s Terminal Island."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "On WSJ’s Take On the Week, co-host Telis Demos and guest co-host Miriam Gottfried dive into the impending 25 percent tariffs that are set to be placed on global automotive imports to the U.S. Then, we explore what the bond market tells us and what a decrease in the U.S. Treasury yields means for investors. Plus, is the IPO market buzzing? Provider of specialized cloud-computing services, CoreWeave, is the latest company to debut for trading. With companies like StubHub, eToro, and Klarna also announcing public offerings, does this mean more deals are on the horizon?"
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Nvidia, AMD, Abbott Laboratories, ASML",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Relief for the Magnificent Seven Stocks",
        "date": "2025-04-09",
        "summary": "Plus, a key iPhone maker stays with Vietnam. And Amazon cancels some vendor orders from China. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Why Musk vs. Navarro Matters",
        "date": "2025-04-08",
        "summary": "The fight reflects the competing factions in Trump’s coalition."
    },
    {
        "company": "MSFT",
        "title": "Semiconductor Sector Under Pressure After China Counters in Trump’s Tariff War",
        "date": "2025-04-04",
        "summary": "Shares of Nvidia and other semiconductor companies slid amid a flurry of tariffs between the U.S. and Asian countries that could subdue electronics demand and hinder Big Tech’s artificial-intelligence infrastructure buildout."
    },
    {
        "company": "MSFT",
        "title": "Recession vs. Stagflation and Jobs. Economist Weighs in on What’s Next",
        "date": "2025-03-30",
        "summary": "Aditya Bhave, a Bank of America senior U.S. economist, discusses with co-hosts Telis Demos and Miriam Gottfried what we can expect from the forthcoming jobs report and how it will offer a big clue to where the economy is heading. "
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Zuckerberg Continues to Lobby Trump",
        "date": "2025-04-02",
        "summary": "Plus, two big tech companies bid for TikTok. And Nintendo stays in the game with its coming Switch 2 release. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Meta Fights to Keep Instagram and WhatsApp, as Antitrust Trial Begins",
        "date": "2025-04-14",
        "summary": "The Federal Trade Commission says Meta has monopolized the social-media market—and should be broken up."
    },
    {
        "company": "MSFT",
        "title": "Mark Klein, a Whistleblower Who Revealed Domestic Spying, Dies at 79",
        "date": "2025-04-11",
        "summary": "The AT&T technician predated Edward Snowden by seven years, but his allegations were never able to achieve traction."
    },
    {
        "company": "MSFT",
        "title": "Investors Hold Their Breath as Trump Tariffs Loom",
        "date": "2025-04-02",
        "summary": "A.M. Edition for April 2. "
    },
    {
        "company": "MSFT",
        "title": "Trade Tensions Weigh Down Nvidia, Tech Stocks",
        "date": "2025-04-16",
        "summary": "The Dow drops 700 points, and Fed Chair Jerome Powell warns of economic risks."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Sink Ahead of Trump’s 104% Tariffs on China",
        "date": "2025-04-08",
        "summary": "P.M. Edition for April 8. U.S. stocks gyrated today but "
    },
    {
        "company": "MSFT",
        "title": "Judge Rules Google Operates Illegal Ad Monopoly",
        "date": "2025-04-18",
        "summary": "The tech giant faces multiple legal threats related to how it wields market power."
    },
    {
        "company": "MSFT",
        "title": "The AI Data-Center Boom Is Coming to Rural America",
        "date": "2025-03-30",
        "summary": "Meta Platforms and other tech companies are looking for huge swaths of flat land and plentiful power."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: A Challenging Scenario",
        "date": "2025-04-16",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-11",
        "summary": "Find insight on cable operators, Logitech International, Aussie Broadband, BYD, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tariff Pause Sends Tech Stocks Soaring",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Elon Musk’s Mission to Take Over NASA—and Mars",
        "date": "2025-03-30",
        "summary": "The billionaire is in position to speed up plans for a voyage to the planet, with a potentially huge impact on SpaceX."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Wednesday Recap: A Challenging Scenario",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "AI Agents Are a Moment of Truth for Tech",
        "date": "2025-03-29",
        "summary": "All emerging technology needs to deliver on its promise, sooner or later. For AI agents, that time is now."
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on Apple, BlackBerry, DoorDash and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump's Power Over the Fed, Explained",
        "date": "2025-04-18",
        "summary": "President Trump expressed confidence that he could remove Federal Reserve Chair Jerome Powell from his position. WSJ’s Nick Timiraos and former Fed Vice Chairman Richard Clarida explain how much influence the White House has over the central bank."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Monday Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-07",
        "summary": "Gain insight on online travel agencies, the closing of the de minimis tariff loophole, Pinterest and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": " TNB Tech Minute: TikTok Lives On…For Now",
        "date": "2025-04-04",
        "summary": "Plus, the Magnificent Seven continue their stock-market slide. And fintechs put their IPO roadshows on hold. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Uncertainty Is Hitting Tech Investment, Trade Association CEO Says",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump to Review Preliminary TikTok Deal As Deadline Approaches",
        "date": "2025-04-02",
        "summary": "Senior administration officials are expected to attend a Wednesday meeting about a potential deal; plan would require Beijing’s blessing."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Scrambles to Finalize ‘Liberation Day’ Tariff Plans",
        "date": "2025-03-31",
        "summary": "Plus, President Trump expresses anger at Russia’s Vladimir Putin with little progress made on Ukraine ceasefire talks. And Apple and Elon Musk’s SpaceX are feuding over satellite service as they race to eliminate cellphone dead spots. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "It’s Not a Bird, or a Plane: It’s Your Walmart Delivery",
        "date": "2025-03-28",
        "summary": "Drone-delivery company Zipline aims to safely—and quietly—drop packages to consumers. Plus, WSJ columnist Tim Higgins tells us about the latest in the duality of Elon Musk the "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Investors Cheer a Tariff Rollback for the Tech Industry",
        "date": "2025-04-14",
        "summary": "A.M. Edition for April 14. Global stocks rise after a Friday filing showed that smartphones, computers and other categories of tech products will be "
    },
    {
        "company": "MSFT",
        "title": "Trump Claims Victory After Nvidia’s U.S. Manufacturing Announcement",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "S&P, Nasdaq Post Worst Quarter Since 2022",
        "date": "2025-03-31",
        "summary": "P.M. Edition for Mar. 31. U.S. markets bounced back from "
    },
    {
        "company": "MSFT",
        "title": "Stocks Waver Ahead of Trump’s ‘Liberation Day’ Announcement at 4 p.m. ET",
        "date": "2025-04-02",
        "summary": "Tesla’s global vehicle deliveries fell 13% in the first quarter. And a federal judge has dismissed the bribery case against New York City Mayor Eric Adams. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Silicon Valley CEO Says U.S. Tech Dominance in Peril Because of Tariffs",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-01",
        "summary": "Read about Spotify, Peloton Interactive, Xiaomi, YOFC and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Musk Knocks Trump’s Trade Philosophy",
        "date": "2025-04-07",
        "summary": "The comments from the Tesla CEO and DOGE leader revealed tensions within the administration over the president’s trade agenda."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Tuesday Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall Sharply as Consumer Sentiment Sours in March",
        "date": "2025-03-28",
        "summary": "P.M. Edition for Mar. 28. Stocks sold off after hotter-than-expected inflation data, President Trump's tariff announcements and "
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Thursday: Alcoa, Netflix, Eli Lilly, Trump Media",
        "date": "2025-04-17",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Tries to Enlist Trump in Fight Against Meta EU Ruling",
        "date": "2025-04-01",
        "summary": "Meta executives have pressed U.S. trade officials to push back against a European Union law that could undermine its ad business."
    },
    {
        "company": "MSFT",
        "title": "Even AI-Infrastructure Spending Is at Risk",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Zuckerberg Tries to Enlist Trump in Fight Against Meta EU Ruling",
        "date": "2025-04-01",
        "summary": "Meta executives have pressed U.S. trade officials to push back against a European Union law that could undermine its ad business."
    },
    {
        "company": "MSFT",
        "title": "Even AI-Infrastructure Spending Is at Risk",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "MSFT",
        "title": "The Business Moguls Who Turn to Astrologists for Big Decisions",
        "date": "2025-04-13",
        "summary": "Executives in South Asia make sure the stars and planets are aligned for success before choosing the location of offices or launching new ventures."
    },
    {
        "company": "MSFT",
        "title": "How to Ditch Google Search",
        "date": "2025-04-03",
        "summary": "Our tech columnist shares why "
    },
    {
        "company": "MSFT",
        "title": "This Financial Firm Can Give Investment Advice in Gen Z Slang, No Cap",
        "date": "2025-04-01",
        "summary": "Arta, a wealth-management startup, is using mobile apps and AI tools to reach young millionaires."
    },
    {
        "company": "MSFT",
        "title": "The AI Arms Race Is Coming to Rural America",
        "date": "2025-04-08",
        "summary": "Mark Zuckerberg’s Meta plans to build a "
    },
    {
        "company": "MSFT",
        "title": "Protesters Rally Against Trump: ‘Democracy Not Dictatorship’",
        "date": "2025-04-06",
        "summary": "Mass protests kicked off around the country Saturday to oppose Trump administration policies that organizers say favor billionaires over everyday people."
    },
    {
        "company": "MSFT",
        "title": "Auto Stocks Slip Amid Tariff Fears",
        "date": "2025-03-26",
        "summary": "Plus, potential levies weigh down tech stocks like Nvidia, Tesla and Broadcom. And Gamestop shares jump after bitcoin news. Ariana Aspuru hosts. "
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Catching a Break",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-08",
        "summary": "Find insight on data centers, Infineon Technologies, Netflix and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump Ushers In ‘New High Water Mark’ for Deregulation",
        "date": "2025-03-28",
        "summary": "The president’s tariffs are clouding the outlook for plans to cut rules and Elon Musk’s efficiency efforts."
    },
    {
        "company": "MSFT",
        "title": "Dave Portnoy, Ben Shapiro and Other Podcasters Criticize Trump's Tariffs",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Vintage Trump",
        "date": "2025-04-15",
        "summary": "Reciprocal agreements for zero tariffs will enable his promised golden age for Americans."
    },
    {
        "company": "MSFT",
        "title": "Inside Elon Musk’s Shock-and-Awe Months in the White House",
        "date": "2025-04-05",
        "summary": "President Trump directed his chief of staff to better manage the billionaire adviser after complaints arose from his cabinet and staff."
    },
    {
        "company": "MSFT",
        "title": "Tariff Upheaval Threatens Private Equity’s Exit Recovery Hopes",
        "date": "2025-04-14",
        "summary": "U.S. private-equity exits and their total value rose in the first quarter compared with a year ago, but recent market volatility puts that momentum at risk."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Justice Department Pulls Back on Crypto Enforcement",
        "date": "2025-04-08",
        "summary": "Plus, a Congressional Commission raises alarms over China’s biotech advances. And the tech-heavy Nasdaq gives up big gains after early optimism on tariffs faded. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Watch: Biden Says Damage Trump Administration Has Done Is ‘Breathtaking’",
        "date": "2025-04-16",
        "summary": "Former President Joe Biden warned that the Trump administration has “taken a hatchet” to Social Security in his first major speech since leaving office."
    },
    {
        "company": "MSFT",
        "title": "Trade Restrictions on Chips Fuel Tech Stock Rout",
        "date": "2025-04-16",
        "summary": "Tech stocks fell after the U.S. said it will put export restrictions on chipmakers including Nvidia and AMD. Plus: shares of a transportation bellwether declined after reporting lower first-quarter income and revenue. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-28",
        "summary": "Find insight on Braze, Galaxy Digital Holdings, Telus and more in the latest Market Talks covering technology, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Surrender or Resist? The Dilemma Facing Allies Caught in Trump’s Trade War",
        "date": "2025-03-26",
        "summary": "P.M. Edition for Mar. 26. When confronted with President Trump’s plan to impose tariffs, governments are still figuring out "
    },
    {
        "company": "MSFT",
        "title": "Elon Musk Brings His Vision for Mars to NASA",
        "date": "2025-04-09",
        "summary": "The SpaceX founder has backed a friend to lead the space agency and make a Mars mission a priority. Wall Street Journal reporters Emily Glazer and Micah Maidenberg talk about Musk’s "
    },
    {
        "company": "MSFT",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "MSFT",
        "title": "With Trump Tariffs, Even AI Could Get More Expensive",
        "date": "2025-04-04",
        "summary": "Higher prices may be in store for a range of materials used to build the data centers that will deliver AI."
    },
    {
        "company": "MSFT",
        "title": "What Is an AI Supercomputer and Why Is Trump Talking About It?",
        "date": "2025-04-17",
        "summary": "The president enthused on social media that chip maker Nvidia would build “A.I. SUPERCOMPUTERS” in the U.S. Here’s a guide to the technology and why it matters."
    },
    {
        "company": "MSFT",
        "title": "Sam Bankman-Fried Moved to Oklahoma Prison Transit Facility",
        "date": "2025-03-27",
        "summary": "The disgraced cryptocurrency tycoon, who was sentenced to 25 years, was taken from a Brooklyn jail."
    },
    {
        "company": "MSFT",
        "title": "Chinese Tech Stocks Plunge on Escalating Trade War",
        "date": "2025-04-07",
        "summary": "Shares of major Chinese technology companies fell on the expected brunt of U.S. tariffs and broader concerns that the trade war could hurt the world’s second-largest economy ."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Nvidia Says It Will Make AI Supercomputers Entirely in the U.S.",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Intel to Sell Majority Stake of Altera to Private Equity Firm Silver Lake",
        "date": "2025-04-14",
        "summary": "Intel will sell a majority stake of its programmable-chip unit to private-equity firm Silver Lake."
    },
    {
        "company": "MSFT",
        "title": "Anatomy of a Trade Deal",
        "date": "2025-04-16",
        "summary": "What’s the likelihood of Team Trump landing 90 trade deals in 90 days? Consider the complexities of just one: India."
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "Hours in Line, Cut-Off Calls: Accessing Social Security in the Era of DOGE",
        "date": "2025-04-06",
        "summary": "Advocates say cutbacks hurt the agency’s already depleted field offices: “It’s like a house of cards.”"
    },
    {
        "company": "MSFT",
        "title": "In Secret Meeting, China Acknowledged Role in U.S. Infrastructure Hacks",
        "date": "2025-04-10",
        "summary": "A senior Chinese official linked intrusions to escalating U.S. support for Taiwan."
    },
    {
        "company": "MSFT",
        "title": "Trump Says ‘I Can’t Tell You’ What Will Happen With Markets",
        "date": "2025-04-07",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Dow Falls More Than 1,000 Points, Nasdaq Loses 4% in Another Volatile Day",
        "date": "2025-04-10",
        "summary": "Plus: President Trump says he is open to Japan’s Nippon Steel investing in U.S. Steel but not owning it. CarMax misses its quarterly earnings estimates. And Modelo owner Constellation Brands cuts its annual outlook. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Wall Street Starts to Speak Out Against Trump’s Tariffs",
        "date": "2025-04-07",
        "summary": "Stan Druckenmiller, Bill Ackman and Jamie Dimon are among those raising concerns about the president’s steep, across-the-globe levies."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Wall Street Starts to Speak Out Against Trump’s Tariffs",
        "date": "2025-04-07",
        "summary": "Stan Druckenmiller, Bill Ackman and Jamie Dimon are among those raising concerns about the president’s steep, across-the-globe levies."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Trump Family Expands Its Crypto Portfolio",
        "date": "2025-03-31",
        "summary": "Plus, tech stocks swing back after falling at today’s open. And France hits Apple with a hefty fine, risking Trump’s ire. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Pardons Nikola Founder Trevor Milton",
        "date": "2025-03-28",
        "summary": "Milton was convicted of fraud in 2022 for statements about zero-emission trucks."
    },
    {
        "company": "MSFT",
        "title": "The Score: CarMax, Harley-Davidson, JPMorgan Chase and More Stocks That Defined the Week",
        "date": "2025-04-11",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Heard on the Street Recap: Keeping It 104%",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Flagging Tech Trade Sent Stocks Lower in First Quarter",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Netflix Aims to Join the $1 Trillion Club",
        "date": "2025-04-14",
        "summary": "The streaming service has shared financial performance targets with staff that underscore its dominance."
    },
    {
        "company": "MSFT",
        "title": "How RFK Jr. Is Reshaping the U.S. Health Agencies",
        "date": "2025-03-27",
        "summary": "P.M. Edition for Mar. 27. Health and Human Services Secretary Robert F. Kennedy Jr. announced "
    },
    {
        "company": "MSFT",
        "title": "A Peter Thiel Protégé Is Leading Trump’s AI Strategy Against China",
        "date": "2025-03-31",
        "summary": "Michael Kratsios will work to counter Beijing without disrupting U.S. businesses."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch: Dollar Tree, Nike, Apple, Nvidia",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: China’s Tech Giants Plan to Help Exporters",
        "date": "2025-04-11",
        "summary": "Plus, Tesla removes a buy option on its China website. And the EU talks with Beijing about an alternative to current tariffs on Chinese EVs. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "The Dip Buyers Braving the Market During Stocks Carnage",
        "date": "2025-04-08",
        "summary": "The tariff selloff tests the long-held practice, with Wall Street warning about the blow to growth."
    },
    {
        "company": "MSFT",
        "title": "Watch: Musk and DOGE Team Answer Questions About Cost-Cutting Drive",
        "date": "2025-03-28",
        "summary": "Elon Musk and members of the Department of Government Efficiency team appeared on Fox News and addressed questions on what DOGE has achieved. "
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Lost a Combined $520 Billion in Market Value",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Putin’s Secret Dealmaker Emerges From the Shadows in Ukraine Peace Talks",
        "date": "2025-04-12",
        "summary": "Sergei Beseda, known to the CIA as ‘the Baron,’ also figured in one of the world’s biggest prisoner swaps."
    },
    {
        "company": "MSFT",
        "title": "What Would It Take to Make an All-American iPhone?",
        "date": "2025-04-10",
        "summary": "WSJ senior tech columnist Joanna Stern discusses the likelihood of a "
    },
    {
        "company": "MSFT",
        "title": "How BlackRock’s Larry Fink Won Over Donald Trump",
        "date": "2025-04-05",
        "summary": "CEOs the world over are trying to get in good with President Trump. This Wall Street titan found a way."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Investigating Pharmaceutical and Semiconductor Tariffs",
        "date": "2025-04-15",
        "summary": "Plus, South Korea says it’s preparing roughly $23 billion in government support for the chip sector amid tariff uncertainty. And Netflix aims for a $1trillion market capitalization. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Where Did the Republican Free-Traders Go?",
        "date": "2025-04-09",
        "summary": "Donald Trump's trade wars are roiling global business and financial markets, with China and the EU moving to retaliate. Yet only a handful of Republicans in Congress are pushing back, despite the GOP's past support for an open economy. Plus, the disruption raises pressure on Capitol Hill to pass a tax bill, and listeners write in with questions about the president's tariff strategy."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Investigating Pharmaceutical and Semiconductor Tariffs",
        "date": "2025-04-15",
        "summary": "Plus, South Korea says it’s preparing roughly $23 billion in government support for the chip sector amid tariff uncertainty. And Netflix aims for a $1trillion market capitalization. Luke Vargas hosts."
    },
    {
        "company": "MSFT",
        "title": "Where Did the Republican Free-Traders Go?",
        "date": "2025-04-09",
        "summary": "Donald Trump's trade wars are roiling global business and financial markets, with China and the EU moving to retaliate. Yet only a handful of Republicans in Congress are pushing back, despite the GOP's past support for an open economy. Plus, the disruption raises pressure on Capitol Hill to pass a tax bill, and listeners write in with questions about the president's tariff strategy."
    },
    {
        "company": "MSFT",
        "title": "CEOs Said They’d Speak Out When the Market Fell 20%. Most Remain Quiet.",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Trump 2.0: Tariff Turnaround",
        "date": "2025-04-11",
        "summary": "Kate Linebaugh"
    },
    {
        "company": "MSFT",
        "title": "More Than 100 Million Options Contracts Changed Hands on Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Banks Warn of Risk to U.S. Economy Because of Tariffs",
        "date": "2025-04-11",
        "summary": "P.M. Edition for April 11. In earnings calls today, executives warned that President Trump’s tariffs were "
    },
    {
        "company": "MSFT",
        "title": "Binance Seeks to Curb U.S. Oversight While in Deal Talks With Trump’s Crypto Company",
        "date": "2025-04-12",
        "summary": "These moves mark the progression of a growing alliance between the Trump family and Binance, which pleaded guilty to violating anti-money-laundering laws in 2023."
    },
    {
        "company": "MSFT",
        "title": "Elon Musk and Apple Go Head to Head in the Skies ",
        "date": "2025-04-02",
        "summary": "The iPhone maker is ploughing money into a satellite network to eliminate cellphone dead spots, setting up a "
    },
    {
        "company": "MSFT",
        "title": "The M&A Boom Wall Street Wanted Is Here, If You Know Where to Look",
        "date": "2025-04-01",
        "summary": "Relatively smaller deals are having their best start to the year since the 2021 pandemic-era, and sectors such as pharma are seeing more activity."
    },
    {
        "company": "MSFT",
        "title": "Energy & Utilities Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on oil futures, Bank of America, Shell and more in the latest Market Talks covering Energy and Utilities."
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Rocket After Trump Pauses Some Tariffs",
        "date": "2025-04-09",
        "summary": "Plus: Apple reclaims its title as the “world's most valuable company.” And Delta Airlines said it was working to avoid paying tariffs on planes it’s set to receive from Airbus this year. Anthony Bansie Hosts. "
    },
    {
        "company": "MSFT",
        "title": "Apple and Amazon Promised Us Revolutionary AI. We’re Still Waiting. ",
        "date": "2025-04-03",
        "summary": "With “more personal” Siri and Alexa+, the tech giants marketed features they have yet to deliver."
    },
    {
        "company": "MSFT",
        "title": "Ray Dalio Says He’s ‘Very Concerned’ About the Practicality of Trump’s Tariff Plans",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Treasury Secretary on Trump Tariffs: China Is the ‘Biggest Offender’",
        "date": "2025-04-09",
        "summary": "Treasury Secretary Scott Bessent, speaking at a banking convention in Washington, said he would begin taking a lead role in negotiations with other countries over tariffs. "
    },
    {
        "company": "MSFT",
        "title": "Stocks Slump as Trump Threatens Tariffs on All U.S. Trading Partners",
        "date": "2025-03-31",
        "summary": "A.M. Edition for Mar. 31. The Trump administration is still "
    },
    {
        "company": "MSFT",
        "title": "AppLovin and Amazon Emerge as TikTok Bidders Ahead of Trump’s Deadline",
        "date": "2025-04-03",
        "summary": "President Trump was briefed Wednesday on a framework to keep the video-sharing app operational."
    },
    {
        "company": "MSFT",
        "title": "President Trump Announces 10% Across-the-Board Tariff on All Imports",
        "date": "2025-04-02",
        "summary": "P.M. Edition for April 2. President Trump said that the U.S. will impose a 10% tariff on all imports, and even higher rates for some nations, in a series of moves he declared \"Liberation Day\" for U.S. trade policy. Plus, the U.S. tariffs send a message to companies that the era of globalization is over. Reporter "
    },
    {
        "company": "MSFT",
        "title": "Warner Bros. Discovery to Add New Board Member After Talks With Activist",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Consulting Giants Offer Billions in Cuts to Federal Contracts. It Might Not Be Enough.",
        "date": "2025-04-02",
        "summary": "Accenture, Deloitte, IBM and other firms submitted proposed price concessions but are expected to be asked to dig deeper."
    },
    {
        "company": "MSFT",
        "title": "What’s News: Business & Finance",
        "date": "2025-03-29",
        "summary": "What’s News: Business & Finance"
    },
    {
        "company": "MSFT",
        "title": "Markets Tumble as Donald Trump’s Tariff ‘Liberation Day’ Finally Arrives",
        "date": "2025-04-03",
        "summary": "Donald Trump delivers on his promise of sweeping tariffs, causing markets to plunge in response. The White House says the long-term gain will be worth the short-term pain, but how will the American consumer and the world at large be affected?  "
    },
    {
        "company": "MSFT",
        "title": "U.S. Stocks Fall, Wiping Out More Than $3 Trillion in Market Value",
        "date": "2025-04-03",
        "summary": "P.M. Edition for April 3. U.S. markets experience their s"
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Friday: Meta, Apple, Deutsche Bank, BP",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Attend The Future of Everything Hosted by The Wall Street Journal",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Vol. 38, No. 3: Canada",
        "date": "2025-03-31",
        "summary": "In the latest WSJ stylebook bulletin, some reminders about how we handle Canadian datelines and related Great White North terms. Also: We spell April Fools’ Day with an apostrophe, no fooling…"
    },
    {
        "company": "MSFT",
        "title": "Nikola Founder Trevor Milton Details Call With Trump Ahead of Pardon",
        "date": "2025-03-29",
        "summary": "Nikola founder Trevor Milton, who was convicted of fraud in federal court for what prosecutors said were lies to investors about his zero-emission trucks, spoke with WSJ about his recent pardon by President Trump."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-27",
        "summary": "Gain insight on rising demand for electricity in the U.S, cinema operators, ProSiebenSat.1, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Don’t Blame Trump for All of the Stock Market’s Problems",
        "date": "2025-03-27",
        "summary": "Though the trade war has heightened uncertainty, slower earnings growth and a cooler labor market would likely have impacted the market regardless."
    },
    {
        "company": "MSFT",
        "title": "Stocks Mixed Ahead of Sweeping Trump Tariffs Announcement",
        "date": "2025-04-01",
        "summary": "President Trump is due to unveil sweeping tariffs tomorrow afternoon—but what exactly he will announce is unclear. Plus: executives at Meta Platforms press trade officials to fight an expected European Union fine and cease-and-desist order. Pierre Bienaimé hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Mr. Cooper, Nvidia, Newsmax, Moderna",
        "date": "2025-03-31",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Fall After President Trump Unveils New Tariffs on Auto Imports",
        "date": "2025-03-27",
        "summary": "Shares in all of the Big Three U.S. automakers dropped after the announcement, but Tesla stock ticked up. Plus: GameStop plunged after saying it would issue $1.3 billion of convertible bonds to buy bitcoin. And Dollar Tree shares jumped after announcing the sale of its Family Dollar business. Danny Lewis hosts. "
    },
    {
        "company": "MSFT",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "MSFT",
        "title": "Trump 2.0: Group Chat Fallout",
        "date": "2025-03-28",
        "summary": "A journalist was added to a text thread with high-level Trump administration officials revealing plans for the timing and weapons to be used in a military strike against Houthi militants. Administration officials disputed that any classified information about the military operation had been shared. WSJ’s "
    },
    {
        "company": "MSFT",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    }
]