[
    {
        "company": "MSFT",
        "title": "Offices Ditch Harsh Fluorescent Lights. New Tech Is On the Way.",
        "date": "2025-04-22",
        "summary": "From faux skylights to circadian-tuned systems, lighting upgrades are a priority for companies trying to lure employees back to the workplace."
    },
    {
        "company": "MSFT",
        "title": "Corporate Giants Shred Outlooks Over Tariff Uncertainty",
        "date": "2025-04-25",
        "summary": "Chief executives are warning that big-ticket items will cost more, as travel becomes an early trade-war casualty."
    },
    {
        "company": "MSFT",
        "title": "He Wanted Room for 21 of His Porsches. So He Built a Second House Across the Street.",
        "date": "2025-04-23",
        "summary": "Near Palm Springs, Calif., architect Steven Harris spent millions designing a modern house equipped with an underground garage for his sports cars."
    },
    {
        "company": "MSFT",
        "title": "India Has a Golden Opportunity to Capture U.S. Business From China",
        "date": "2025-04-19",
        "summary": "The world’s most populous nation has long trailed not just China but also smaller countries with nimbler governments."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Apple Cedes Most-Valuable Crown After Tariff Pain Hits Stock Price",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Big Losers in Trump’s Tariff Chaos—and a Couple of Survivors",
        "date": "2025-04-04",
        "summary": "Shares of private-equity firms slid, while consumer staple companies were relatively unscathed"
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-03",
        "summary": "Find insight on ASML Holding, Tesla, U.S. tariffs and more in the latest Market Talks covering Tech, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Apple, Nvidia Among Tech Giants Hit Hard in Stock Market Selloff",
        "date": "2025-04-05",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stock Investors Cheer Tariff Exemptions",
        "date": "2025-04-14",
        "summary": "U.S. stocks rose after optimism about Trump’s tariff exemptions spread from technology goods to America’s car industry. The S&P 500 rose 0.8%, while the Nasdaq Composite added 0.6%."
    },
    {
        "company": "MSFT",
        "title": "Trump Claims Tariffs Responsible for Nvidia U.S. Manufacturing Announcement",
        "date": "2025-04-14",
        "summary": "President Trump claimed that his re-election and tariffs were the reasons why Nvidia announced that it would build its AI supercomputers entirely in the U.S."
    },
    {
        "company": "MSFT",
        "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
        "date": "2025-04-14",
        "summary": "The chip maker’s plan to build AI tech in Texas comes on the heels of a new tariff threat."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Apple, Alibaba, Novo Nordisk, Delta",
        "date": "2025-04-09",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Shifting Signals on Tech Tariffs Fuel Fresh Trade Uncertainty ",
        "date": "2025-04-13",
        "summary": "Various comments from the Trump administration over the weekend regarding tariffs on consumer electronics hint at another chaotic week on Wall Street and in Washington."
    },
    {
        "company": "MSFT",
        "title": "U.S. Tries to Crush China’s AI Ambitions With Chips Crackdown ",
        "date": "2025-04-17",
        "summary": "New chip restrictions for Nvidia and AMD show the Trump administration’s determination to battle China on tech advances as well as trade."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-14",
        "summary": "Find insight on Apple, Nvidia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-16",
        "summary": "Find insight on Nvidia, ASML and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Trump Administration Backs Away From White-Collar Criminal Enforcement",
        "date": "2025-04-14",
        "summary": "P.M. Edition for April 14. The U.S. administration is backing away from cases involving foreign bribery, public corruption, money laundering and crypto markets. WSJ reporter "
    },
    {
        "company": "MSFT",
        "title": "Trump’s Protectionist Bunker",
        "date": "2025-04-13",
        "summary": "The U.S. prospers atop a horizontal empire, not as a vertical island."
    },
    {
        "company": "MSFT",
        "title": "What Is an AI Supercomputer and Why Is Trump Talking About It?",
        "date": "2025-04-17",
        "summary": "The president enthused on social media that chip maker Nvidia would build “A.I. SUPERCOMPUTERS” in the U.S. Here’s a guide to the technology and why it matters."
    },
    {
        "company": "MSFT",
        "title": "What to Watch When Futures Markets Open",
        "date": "2025-04-13",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Plenty of Tariff Pain for Big Tech, From Supply Chains to Advertising Impact",
        "date": "2025-04-03",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Tariff Trade Off: Jobs vs. Higher Prices",
        "date": "2025-04-08",
        "summary": "President Trump is ramping up "
    },
    {
        "company": "MSFT",
        "title": "The Score: Nike, Apple, Stellantis and More Stocks That Defined the Week",
        "date": "2025-04-04",
        "summary": "Here are some of the major companies whose stocks moved on the week’s news."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Monday: Apple, Palantir, Intel, Pfizer",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-09",
        "summary": "Find insight on the U.S. housing market, Amazon, Warner Bros. Discovery, and more in the latest Market Talks covering tech, media and telecom."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "The Lessons of Trump’s Tariff Exemptions",
        "date": "2025-04-13",
        "summary": "It’s good to be Apple’s Tim Cook but not to be a small manufacturer that can’t afford a K Street lobbyist."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-02",
        "summary": "Find insight on AI investment in Canada, TikTok, BlackBerry and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Dow Falls More Than 1,000 Points, Nasdaq Loses 4% in Another Volatile Day",
        "date": "2025-04-10",
        "summary": "Plus: President Trump says he is open to Japan’s Nippon Steel investing in U.S. Steel but not owning it. CarMax misses its quarterly earnings estimates. And Modelo owner Constellation Brands cuts its annual outlook. Anthony Bansie hosts. "
    },
    {
        "company": "MSFT",
        "title": "Miners, Carmakers, Gadgets: How Tariff Fears Are Hitting Stock Markets Friday",
        "date": "2025-04-04",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Stocks Rise After Tech Tariff Rollback and a Potential Pause in Automaker Import Duties",
        "date": "2025-04-14",
        "summary": "President Trump’s zigzag on tariffs boosted shares of tech companies focused on hardware. Plus, Goldman Sachs shares rose after the investment bank reported higher revenue from equities trading. Danny Lewis hosts."
    },
    {
        "company": "MSFT",
        "title": "Trump Claims Victory After Nvidia’s U.S. Manufacturing Announcement",
        "date": "2025-04-14",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "The Day Trump’s Tariffs Shook Corporate America",
        "date": "2025-04-03",
        "summary": "Executives scrambled to grasp the scope and size of the president’s trade barriers."
    },
    {
        "company": "MSFT",
        "title": "Trump Tariffs Aim to Bring Down Curtain on Era of Globalization",
        "date": "2025-04-03",
        "summary": "The president wants companies to return production to the U.S., but it won’t be easy."
    },
    {
        "company": "MSFT",
        "title": "Mark Klein, a Whistleblower Who Revealed Domestic Spying, Dies at 79",
        "date": "2025-04-11",
        "summary": "The AT&T technician predated Edward Snowden by seven years, but his allegations were never able to achieve traction."
    },
    {
        "company": "MSFT",
        "title": "What Was the Impact of Trump’s First-Term Tariffs?",
        "date": "2025-04-02",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Magnificent Seven Stocks Waver",
        "date": "2025-04-08",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "What’s News in Markets: Nike Tariff Turmoil, The Not-So-Magnificent Seven, Newsmax’s Wild Debut",
        "date": "2025-04-05",
        "summary": "Why did President Trump’s tariff announcements send Nike stock spinning? And what’s weighing on the Magnificent Seven tech stocks? Plus, how did shares of conservative news outlet Newsmax do in their first trading week? Host Krystal Hur discusses the biggest stock moves of the week and the news that drove them."
    },
    {
        "company": "MSFT",
        "title": "How Trump’s Tariffs Will Affect Corporate Earnings",
        "date": "2025-04-05",
        "summary": "Christine Short, head of research of TMX Group's Wall Street Horizon, joins WSJ’s Take On the Week podcast to share what to look out for this earnings season as tariffs come into play. "
    },
    {
        "company": "MSFT",
        "title": "What to Watch for This Earnings Season as Trump’s Tariffs Come Into Play",
        "date": "2025-04-06",
        "summary": "President Trump’s latest tariff policy announcement has rocked companies, markets and investment portfolios. To get into what they mean for Americans from Main Street to Wall Street, What’s News brings you an episode of our sister podcast WSJ’s Take On the Week, where co-hosts Telis Demos and Miriam Gottfried discuss tariffs, Trump’s trade war and the upcoming first quarter earnings season. Christine Short, head of research of Wall Street Horizon, which is part of the financial services company TMX Group, discusses how companies are dealing with tariffs."
    }
]