[
    {
        "company": "MSFT",
        "title": "Max Streaming Service Builds Momentum by Dropping ‘More Is Better’ Approach",
        "date": "2025-04-23",
        "summary": "Warner shifted to a pared-down model rather than compete with Netflix, and now forecasts 150 million subscribers in 2026."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-24",
        "summary": "Find insight on Comcast, Delivery Hero, RELX, Nokia and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-16",
        "summary": "After years of trying to revive his "
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-04-10",
        "summary": "Find insight on Apple, Amazon, European tech stocks and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "How ‘A Minecraft Movie’ Won With Memes and Deliberate Stupidity ",
        "date": "2025-04-14",
        "summary": "The video-game adaptation succeeded at both things cinema struggles to do consistently: sell gobs of tickets and get young people into theaters."
    },
    {
        "company": "MSFT",
        "title": "The Race to Save a Salamander Whose Image Spawned a Global Cottage Industry",
        "date": "2025-03-29",
        "summary": "From TikTok to McDonald’s Happy Meals, Mexico’s ancient axolotl is everywhere, except where it is supposed to be—in the wild."
    },
    {
        "company": "MSFT",
        "title": "Bitcoin and Bonds: Have MicroStrategy and GameStop Found a Cheat Code for Markets?",
        "date": "2025-03-28",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "Gamers Can Gain a Classical-Music Education",
        "date": "2025-04-14",
        "summary": "Schubert, Rimsky-Korsakov and others have helped elevate several video games."
    },
    {
        "company": "MSFT",
        "title": "How Elon Musk Rescued X From the Brink",
        "date": "2025-04-09",
        "summary": "The xAI merger capped a yearslong turnaround effort for the social-media company."
    },
    {
        "company": "MSFT",
        "title": "Parents Hoped a Rec Room Would Get Their Kids Off Their Phones. It Worked.",
        "date": "2025-03-28",
        "summary": "Dungeon-like rec rooms, with their stingy light and cast-off sofas, are so last century. Behold the rise—literally—of the stylish game room, where everyone wants to hang and family time beats out screen time."
    },
    {
        "company": "MSFT",
        "title": "Tech, Media & Telecom Roundup: Market Talk",
        "date": "2025-03-26",
        "summary": "Find insight on online toy sales, Playtika, Lumen Technologies, and more in the latest Market Talks covering Technology, Media and Telecom."
    },
    {
        "company": "MSFT",
        "title": "Tariffs Are Still Coming for the AI Boom",
        "date": "2025-04-09",
        "summary": "Higher prices and slower consumer spending threaten the Big Tech pocketbooks fueling AI."
    },
    {
        "company": "MSFT",
        "title": "Nintendo Ups Its Game With Launch of the New Switch 2",
        "date": "2025-04-02",
        "summary": "The launch of a pricier console during a trade war carries risk, but pent-up demand should carry the day."
    },
    {
        "company": "MSFT",
        "title": "The Drone-Delivery Service Beating Amazon to Your Front Door",
        "date": "2025-03-29",
        "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables."
    },
    {
        "company": "MSFT",
        "title": "TNB Tech Minute: Zuckerberg Continues to Lobby Trump",
        "date": "2025-04-02",
        "summary": "Plus, two big tech companies bid for TikTok. And Nintendo stays in the game with its coming Switch 2 release. Victoria Craig hosts."
    },
    {
        "company": "MSFT",
        "title": "Stocks to Watch Wednesday: Dollar Tree, GameStop, Super Micro Computer",
        "date": "2025-03-26",
        "summary": null
    },
    {
        "company": "MSFT",
        "title": "70,000 Bets a Minute: How FanDuel’s Parent Is Winning at Sports Gambling",
        "date": "2025-04-25",
        "summary": "Peter Jackson, the CEO of "
    }
]